[{"title":"It's time for our nation to pray","content":"The author urges readers to prioritize prayer in light of a \"troubling, violent and irreverent age.\" Citing 2 Chronicles 7:14 and Ecclesiastes 3:1-8, they suggest that individuals have limited time on earth to ensure their spiritual commitment (\"make your calling and election sure\"). The article encourages readers to turn to God, citing Jesus Christ, and to pray in humility for healing of both personal lives and the nation."},{"title":"Free family event: Frosty’s Holiday Village","content":"For All Seasons will host the fourth annual Frosty's Holiday Village event on December 6 at Anchor Church in Easton, MD. The free family event features photos with Frosty, holiday crafts, and a movie screening of \"Frosty's Winter Wonderland.\" Presenting sponsors include The St. John Foundation and Willow Construction."},{"title":"Calendar","content":"Here is a summary of the article in 2-5 concise sentences:\n\nFeasting Over The Fire Dinner Series with Chesapeake Chef Service at Brampton Inn on October 12th at $120. \nThe Milton Theatre presents The Amish Outlaws on October 12th.\nDan Heely Band performs at DARK HORSE on October 12th.\nRichard Walton Group: Intimate Concert at Rehoboth Beach Jazz Festival on October 12th and at The Room at Cedar Grove on October 16th.\nCamille Thurman performs at Boardwalk Plaza Hotel on October 13th."},{"title":"Pushing too far","content":"Gov. Moore recommends increasing Maryland's capital gains tax and personal income tax, primarily affecting higher-income individuals. Canada's new prime minister has announced not to propose an increase in Canada's capital gains tax rate, a move that might serve as a warning for Gov. Moore. The changes would affect the state economy."},{"title":"Meeting, discussions at Cambridge YMCA heat up","content":"Here is a concise summary of the article:\n\nMembers of the Pauline F. and W. David Robbins Family YMCA in Cambridge attended a meeting where CEO Robbie Gill presented plans to build a new YMCA facility at Cambridge Harbor, developed by Cambridge Waterfront Development Inc.; however, both organizations later clarified that no deal has been reached; hundreds of attendees were skeptical about the proposal due to concerns over secrecy surrounding CWDI and potential implications for the existing site."},{"title":"Nothing more difficult than taking lead on change","content":"Here is a summary of the article in 4 sentences:\n\nPresident Trump's nominations for cabinet and sub-cabinet members are facing resistance from the Senate, with final approval uncertain for Robert F. Kennedy Jr., Kash Patel, and Tulsi Gabbard. The last time a Republican president's nomination was rejected by the Senate was in 1925, when Calvin Coolidge's nominee Charles Warren was rejected. Trump's commitment to implementing his Make America Great Again agenda is seen as similar to President Obama's efforts to change Washington, but with differing levels of success. The first test of success or failure for Trump will occur in November 2026, when all House seats and one-third of Senate seats are up for election, potentially influencing the outcome of his agenda."},{"title":"Scheffler storms into lead","content":"Scottie Scheffler built a one-shot lead going into the weekend at the British Open with a 7-under 64 in the second round, behind former U.S. Open champion Matt Fitzpatrick (66). Brian Harman shot a bogey-free 64 to take dead aim for his third claret jug. The low scoring conditions saw temperatures warm and breeze noticeable but not overly punishing."},{"title":"RELIGION CALENDAR","content":"Here is a list of events, activities, food distributions, and special sales in the area:\n\n**Events**\n\n* Bible Study: Asbury United Methodist Church, 18 S. Higgins St., Easton\n* WOW (Worship On Wednesday): Christ Episcopal Church, 601 Church St., Cambridge\n* \"Chat and Chew\": Denton Church of Free Seventh-Day Adventist, 401 Aldersgate Drive, Denton\n* Soup Night: Ridgely Church of the Brethren, 110 Park Ave., Ridgely\n* Bible Study: Immanuel United Church of Christ, 5401 Whitehall Road, Cambridge\n\n**Activities**\n\n* Sister to Sister: Bethel AME Church, 237 N. College Ave., Chestertown (First Monday)\n* Sons of Allen Christian men's group: Union Baptist Church, 233 Glenwood Avenue, Easton\n* Bible Study: Work in Progress Ministries Church, 104 Legion Road, Millington (Tuesdays)\n* Hatha Yoga: Trinity Cathedral, 315 Goldsborough St., Easton\n* Gentle Yoga: Trinity Cathedral, 315 Goldsborough St., Easton\n\n**Food**\n\n* Blessing Box: Asbury United Methodist Church, 18 S. Higgins St., Easton\n* Helping Hands Food Pantry and Pet Pantry: 5731 Tilghman Island Road (Wednesdays)\n* Soup Night: Ridgely Church of the Brethren, 110 Park Ave., Ridgely (Second Tuesday)\n* Bible Study: Immanuel United Church of Christ, 5401 Whitehall Road, Cambridge\n* Food distribution: Safe Harbor Presbyterian Church, 931 Love Point Road, Stevensville (Third Saturday)\n* Food Pantry: Tilghman United Methodist Church, 5731 Tilghman Island Road (Tuesdays and Wednesdays)\n\n**Special Sales**\n\n* St. Mark's Thrift Shop: 425 East Dover St., Easton (Thursday, Friday, and Saturday)\n* St. Vincent de Paul Thrift Center: 29533 Canvasback Drive, Easton (Thursday and Saturday)"},{"title":"NL GLANCE 6-23-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe East Division standings are Philadelphia 50-26, Atlanta 42-31, Washington 37-38, New York 36-39, and Miami 26-50. The Central Division standings are Milwaukee 44-32, St. Louis 38-37, Pittsburgh 37-39, Chicago 37-40, and Cincinnati 36-40. In the West Division, Los Angeles is leading with a record of 47-31. The Philadelphia Phillies face off against Arizona on Friday, while Atlanta faces N.Y. Yankees on Saturday."},{"title":"Uninformed and fact deficient","content":"Here is a summary of the article in 2-5 concise sentences:\n\nLynn Baker writes in response to uninformed letters to the editor criticizing presidential candidates based on personality, perception, and emotions rather than policy positions. She expresses sadness that many voters lack fact-based knowledge about serious issues. The Star Democrat (Easton, MD) published her letter on March 24, 2024."},{"title":"Everybody has a role in suicide prevention","content":"Here is a concise summary of the article:\n\nFor All Seasons is hosting a free community event \"We All Have a Role to Play in Suicide Prevention\" on September 7 at the Avalon Theatre in Easton, led by Dr. Andrew Moon, a suicide expert and senior advisor for the Department of Defense Suicide Prevention Office. The event aims to raise awareness about suicide prevention and provide practical strategies for recognizing signs of struggle and responding effectively. September is No Matter WhatYouMatter Suicide Prevention Month, with 1 in 5 Maryland Mid-Shore teens attempting suicide at least once in 2021. Dr. Moon will discuss how each individual can play a role in preventing suicide and connecting those in need to resources."},{"title":"MID-SHORE CALENDAR","content":"August 31:\n- Yoga class with Suzie Hurley at Trinity Cathedral.\n- St. Mark's Thrift Shop opens in Easton.\n- Morning walk at Martinak State Park.\n- Cars and Coffee event at Oxford Community Center.\n- Community Collective at Oxford Community Center.\n\nSeptember 1:\n- Healing Walk at Adkins Arboretum.\n\nSeptember 2:\n- Cars and Coffee event at Oxford Community Center.\n- Family Assistance at Society of St. Vincent de Paul.\n\nSeptember 3:\n- Caroline County Joust at Caroline County 4-H Park.\n\nSeptember 4:\n- Yoga class with Suzie Hurley at Oxford Community Center.\n\nSeptember 5:\n- Cardio Fusion at Martinak State Park Nature Center.\n- Steady & Strong at Oxford Community Center.\n\nSeptember 6:\n- Thrift and Consignment Shop at The Bazaar in Easton.\n- Legion Grill opens in American Legion Post 70.\n\nSeptember 7:\n- Morning Stretch at Martinak State Park Amphitheater.\n- Yoga class with Suzie Hurley at Trinity Cathedral."},{"title":"‘A gem’: State and local leaders celebrate Port Street Commons project","content":"Port Street Commons, a 24,000-square-foot multi-use project, is complete in Easton, Maryland, with affordable housing and behavioral health services. The $11 million project, led by The Arc Central Chesapeake Region, received funding from the state and federal government, and will house nine apartment units and a headquarters for The Arc. The project aims to provide equity and inclusion, particularly for people with disabilities, and was celebrated with a ribbon-cutting ceremony attended by local officials, including Mayor Megan Cook and Senator Johnny Mautz."},{"title":"Celebrity Update","content":"David Duchovny's run as FBI Agent Fox Mulder on \"The X-Files\" began in 1993 and continued through the seventh season. Duchovny left the show due to a contract dispute over TV rerun rights but returned for part of Season 8 and the presumed series finale in Season 9. Duchovny also starred in two theatrical films, \"The X-Files: Fight the Future\" (1998) and \"The X-Files: I Want to Believe\" (2008), opposite Gillian Anderson's Agent Dana Scully."},{"title":"Talbot Board of Education/July 16","content":"The Talbot County Board of Education approved a new strategic plan on July 16. Policy updates on employee code of conduct and video recording were introduced but not voted on. The district is searching for a new retirement plan provider, with finalists to be interviewed in August. Data from the 2024-2025 school year was reviewed, including test scores and climate surveys. Construction on a staff health center on Idlewild Avenue is expected to finish by September."},{"title":"Talbot Council honors Judge Stephen Kehoe, Talbot Braves","content":"Judge Stephen Kehoe was honored by Talbot Council on March 26 with a Council Commendation for his service to Talbot County and Maryland, where he has served as a judge since 2013. He will be leaving his position in February to join the Appellate Court of Maryland. The council also recognized the 2023 13U Talbot Braves Football Team as state champions."},{"title":"Bridge - It is a sign of the times","content":"The article discusses a bridge game where South made a clever play against West's vulnerable overcall. South played low from the dummy at trick one and discarded a diamond to avoid losing a diamond trick. They split 3-3 diamonds with West then playing fourth-highest from his longest suit, showing improvement in his strategy."},{"title":"Best way to honor legacy of Anne Frank is simple","content":"Anne Frank was a young girl who died at 15 in a Nazi concentration camp during World War II, after spending two years hiding with her family in a secret apartment in Amsterdam. Her diary, \"The Diary of Anne Frank,\" was published posthumously in 1947 and translated into almost 70 languages. A series of unexpected events led the author to reflect on Anne's legacy, particularly about people being truly good at heart. The author experienced an act of kindness when strangers returned a lost wallet containing his wife's identification and cash."},{"title":"Bridge - The play allows you to save the day","content":"Here is a summary of the article in 3 sentences:\n\nA bridge deal was played on January 2, 2024. The declarer's approach was to be \"all eyes open and aware\" of possibilities, which led them to cross over to dummy's spade king at trick two. By doing so, they won with the club king and took advantage of East's forced duck, setting up a contract with nine tricks: two spades, two hearts, four diamonds, and one club."},{"title":"Time can be the great reaper","content":"Roger Trezel, a Frenchman who died in 1986, played a notable bridge hand in which he timed his play perfectly after West's lead of the diamond king; East had led the dummy to check for the club ace and declarer discarded a low heart; South recovered from an earlier mistake by calling the diamond two and discarding a low heart."},{"title":"AL LEADERS 5-19-24","content":"Here is a concise summary of the article:\n\nAmerican League leaders as of May 18, 2024:\n- Top hitters: Kwan (.353), Perez (.333), and Peña (.324)\n- Top run producers: Witt (41), Semien (34), and Henderson (33)\n- Home run leaders: Henderson (14) and K.Tucker (13)\n- Top steals leader: Caballero (17)\n- Top pitchers: Lugo (7-1, 1.79 ERA) and Skubal (6-0, 1.80 ERA)"},{"title":"Man sentenced for Easton Bank of America robbery","content":"Todd Holtzman was sentenced to eight years in prison for robbing the Bank of America in downtown Easton on April 17, 2023. Presiding Senior Judge C. Carey Deeley, Jr. also suspended all but eight years of active incarceration after Holtzman pleaded guilty to robbery. The total amount stolen was $3,210."},{"title":"Misogynist son makes home life uncomfortable","content":"Here is a summary of the article in 2-5 concise sentences:\n\nWayward Son, a 25-year-old man, has moved back into his mother's home after getting divorced from his wife. His mother believes her poor parenting may have contributed to his misogynistic views, which are causing tension with her two daughters. Mother Harriette Cole advises the mother to establish ground rules for Wayward Son's behavior and have a serious talk about his past marriage and its influence on him. The mother is considering keeping him in the house despite his difficult behavior due to financial constraints."},{"title":"Rankin and Davis: The Star Democrat's picks for Wards 2 and 4","content":"The Star Democrat recommends voting for Robert Rankin in Ward 2 and Rev. Elmer Davis in Ward 4. Key endorsements include: \n\n- Robert Rankin's support on increasing affordable housing through incentives and redevelopment \n- Rev. Elmer Davis' proposal to build affordable housing by partnering with Habitat for Humanity\n- Both candidates' emphasis on pedestrian-friendly infrastructure and public safety"},{"title":"Temple B’nai Israel presents 'a joyous evening of klezmer music'","content":"Here is a summary of the article in 4 sentences:\n\nTemple B'nai Israel presents a klezmer music concert by The Seth Kibel Trio on March 6 at the Satell Center for Jewish Life on the Eastern Shore. The program will also include Yiddish theater, Yiddish folksong, jazz, and swing music. Seth Kibel is one of the Mid-Atlantic's premier woodwind specialists and has performed with various bands in the region and beyond. Admission to the concert is free and can be registered for at bnaiisraeleaston.org/event/Klezmer or by calling 410-822-0553."},{"title":"Web Links","content":"Duff Goldman asks bakers from Enchanted Cottage to create edible shelves for Scout Elves to sit on in \"The Elf on the Shelf: Sweet Showdown\" (Nov 19, Food Network). Father Vergara must prepare for battle against evil in a remote town in Spain in \"30 Coins\" (Nov 20, HBO)."},{"title":"Why are decoys so expensive? Artists, collectors share the value of carvings, community","content":"Here is a summary of the article in 2-5 concise sentences:\n\nCooper Rossner and Jon Deeter discuss the value of decoy carvings at the Waterfowl Festival. Vintage decoys from 1850-1950 can fetch high prices, up to $480,000, while decoys by renowned carvers like the Ward Brothers can sell for six-figure ranges. Collectors like Tyler Bryan praise the community aspect and accessibility of decoy collecting, with many seeking out mentors to guide newcomers. Decoy collecting has become increasingly popular over time, particularly in Maryland, where Rossner and Bryan are based."},{"title":"Ex-colleague wants date with daughter","content":"A former colleague has expressed interest in dating the writer's adult daughter since she was a young child. The writer is uncomfortable and wants to assess the colleague's character and relationship history. A church member struggles to balance their personal life with their involvement in the church due to their partner's lack of interest in attending church-related events."},{"title":"Schools to remain closed Friday","content":"Talbot County Public Schools and Caroline County Public Schools closed on January 10, 2025, due to inclement weather that brought a foot of snowfall to parts of the Mid-Shore region. Dorchester County Public Schools will have a virtual instruction day instead. The closures are part of four inclement weather days built into both school calendars."},{"title":"'We can turn lightbulbs on'","content":"Here is a concise summary of the article:\n\nDr. Judy Gieske and a team launched Introduction to Careers in Healthcare (ITCH), a program for middle through high school students in Caroline, Dorchester, Kent, Queen Anne's, and Talbot counties. The ITCH program aims to introduce healthcare careers early, support local students, build a skilled workforce, and reconnect the hospital with the community. A new, modern medical facility is expected to open at the Talbot Community Center in 2028."},{"title":"Residents eager as St. Michaels considers dog park locations","content":"Residents of St. Michaels are eager to discuss a potential dog park location. The town has been considering the project for nearly four years, with a special meeting planned in the near future. A group called \"The Friends of St. Michaels Dog Park\" was formed by lawyers and researched multiple locations, but conversations fell through after new commissioners were elected. The town is now weighing factors such as cost, liability, and location before making a decision."},{"title":"Religion Calendar","content":"**Religious Services**\n\n* Bible Study, Wednesdays at 6:30 p.m., Union Baptist Church, 233 Glenwood Avenue, Easton\n* Christ Centered Prayer, 9 a.m. Sunday, Trinity Cathedral, 314 North St., Easton\n* Christ Centered Prayer, 2 p.m. Tuesday, Miller Hall, 314 North St., Easton\n* WOW (Worship On Wednesday), 12:00-1:00 p.m. Every Wednesday, Christ Episcopal Church, 601 Church St., Cambridge\n\n**Community Events**\n\n* Bluegrass Jams, 7 to 10 p.m. the first Tuesday of every month, St. Andrews Episcopal Church, 303 Main St. in Hurlock\n* MOPS of Cambridge, Bay Country Church, 714 Locust St., Cambridge, 10 a.m.-noon Second Tuesdays\n* New Christian Chapel of Love United Methodist Church, 26826 Big Woods Road, Worton, 11 a.m.-1 p.m. Saturday Church School for children ages 4 through 12\n\n**Food**\n\n* Asbury United Methodist Church, Blessing Box with canned goods for people in need in the community\n* Denton Church of Free Seventh-Day Adventist, \"Chat and Chew\" soup, refreshments and conversation, 6:30-7:30 p.m. second and fourth Wednesdays\n* Helping Hands Food Pantry and Pet Pantry, 2:30-4 p.m. Wednesdays, 5731 Tilghman Island Road\n* Safe Harbor Presbyterian Church, Food pantry, 9 a.m.-10:30 a.m. Third Saturdays for Queen Anne's County citizens\n\n**Special Sales**\n\n* St. Mark's Thrift Shop, open 10 a.m.-2 p.m. Thursday, Friday and Saturday, 425 East Dover St., Easton\n* St. Vincent de Paul Thrift Center, 1-4 p.m. Thursdays and Saturdays, 29533 Canvasback Drive, Easton"},{"title":"Mid-Shore Calendar","content":"Here is a list of upcoming events in Oxford:\n\n* When Democracy Fell\n* Winter Hike at Wye Island NRMA\n* Garden Lecture at Talbot County Free Library\n* Yoga classes at Oxford Community Center\n* Yarn and Needle Group at Brookletts Place Talbot County Senior Center\n* VFW Post 5118 Friday Night Dinners\n* Oxford Community Center events (various dates)"},{"title":"Bridge - How would you handle the trumps?","content":"Here is a summary of the article in 2-5 sentences:\n\nThe author's wife rebid two hearts over the North's bid of one spade in a Bridge game, promising at least five trumps. However, this backfired when partner was weak in the majors and unable to bid again. The correct technique is to win the first trick and duck a round of trumps, ruffling West's club continuation to cash heart ace."},{"title":"Hollywood producer returning to Talbot roots for fresh perspective","content":"Chris Moore, Harvard University graduate and Hollywood producer of \"American Pie\" and \"Good Will Hunting,\" is returning to his Talbot County roots in Easton to hear from locals about what they want to see from the film industry. He will hold an interactive event at the Oxford Community Center on November 21, 2024. Moore seeks to understand changing audience preferences amidst the rise of subscription-based streaming services."},{"title":"Easton gears up for 39th Festival of Trees","content":"The 39th Festival of Trees will take place in Easton, MD from November 29 to December 3. The event's theme is \"Holiday Traditions\" and features decorated trees sponsored by various businesses, organizations, and individuals. Events include Carols by Candlelight, Santa's Workshop, a jewelry raffle, and a Fine Jewelry Raffle, with proceeds benefiting Talbot Hospice."},{"title":"Storm should hit Eastern Shore Saturday","content":"Talbot County Department of Emergency Services issued a weather briefing for Tropical Storm 16 expected to pass over the Eastern Shore on Saturday, September 23, 2023. The main threats include heavy rainfall, damaging winds, and tidal flooding. Residents are advised to review emergency preparedness, check kits, and take precautions such as tying down loose outdoor items. The storm is forming off the coast of North Carolina and expected to be a post-tropical storm upon arrival."},{"title":"King's granddaughter carrying forward his legacy","content":"Yolanda Renee King, granddaughter of Dr. Martin Luther King Jr., has spoken out on issues like gun violence and homelessness, urging her generation to take action rather than apathy. In a 2023 interview, she said she would apologize to her grandparents for the nation's lack of progress towards their vision. Yolanda is just 15 years old and shows signs of her grandfather's resolve and grandmother Coretta Scott King's dignity. Dr. Martin Luther King Jr. warned about apathy in his sermons, including \"But If Not\" (1967) and \"Levels of Love\" (1962)."},{"title":"Academy Art Museum gets new director","content":"Charlotte Potter Kasic is the new director of the Academy Art Museum in Easton, Maryland, following her tenure as executive director at the Barry Art Museum in Norfolk, Virginia. She previously worked at the Chrysler Museum of Art and Glass Studio. Kasic has a master's degree from Rhode Island School of Design and has held various residency positions. Her first weeks will focus on completing a listening tour to understand the museum's existing work and potential."},{"title":"World Waterfowl Calling Championships echo through Easton High auditorium","content":"The World Waterfowl Calling Championships took place at Easton High School's auditorium on November 10, 2024. Winners included John Walls ($5,000 check), Logan Heibner (Jr. World Live Duck Calling champion), JT Johnson (Jr. World Goose Calling champion), and Seth Fields (World Live Duck Calling champion). Other champions were Chandler Martin and Slayton Gearin (World Team Live Duck Calling), Bryan and Bobby Heim (World Team Live Goose Calling), Chance Wadsworth, and Peter Aul (did not place, but competed at the event from Pennsylvania)."},{"title":"St. Michaels announces gingerbread contest, ornament","content":"St. Michaels is hosting a gingerbread house competition with prizes totaling $2,000 in December; participants can pre-register at christmasinstmichaels.org/events. The 2024 Christmas in St. Michaels Collectors Ornament features a Chesapeake deadrise workboat design by Sherry Smith and is available for purchase online or at select local shops. The event also includes a silent auction of gingerbread creations to support the organization; a preview cocktail party will take place on December 12."},{"title":"Legal Notices","content":"Here is a summary of the notices:\n\n**Estate Notices**\n\n1. SHERRY BUTTS, Estate No. 24780\n2. JENNIFER PORTER & KAYE STRATTON, Estate No. 24788\n3. LEATRICE D. CARTER, Estate No. 24789\n\n**Appointment of Personal Representatives**\n\n1. DAVID K. HORN, Estate No. 24793\n2. SHERRY BUTTS, Estate No. 24780\n3. JENNIFER PORTER & KAYE STRATTON, Estate No. 24788\n4. LEATRICE D. CARTER, Estate No. 24789\n\n**Notice of Disinterment**\n\n1. Authorization to dis-inter remains of Rodney and Ruth Ann Bland Bosbyshell\n\n**Other Notices**\n\n1. Notice: Oxford Cemetery, Columbarium 2\n2. Notice: Trinity Parish Church, St. Augustine, Florida (re-interment)\n3. Notice: State Attorney's Office, Talbot County, Maryland (authorization request)"},{"title":"Heads in the sand","content":"A letter from John Gondeck of Easton, MD, published September 13, 2023, in The Star Democrat, criticizes the president for his handling of business dealings with his son and foreign policies, particularly regarding immigration and Afghanistan. He attributes problems with cities ruled by Democrats to their leadership, citing Baltimore, Chicago, LA, and New York as examples."},{"title":"Chesapeake Multicultural after-school program lets students learn through taste","content":"Chesapeake Multicultural Resource Center's after-school program lets fourth and fifth graders learn through taste as part of their enrichment activities focusing on science, technology, engineering and mathematics; reading skills; and food nutrition education. The program is led by Estela-Vianney Ramirez and includes partnerships with local chefs like Chef Tyler Heim from Bonheur Ice Cream and Pie in downtown Easton's Talbot County."},{"title":"Dorman receives Rotary's highest service award","content":"Beth Anne Dorman, president and CEO of For All Seasons, received Rotary's highest award, the J. Howard Anthony Community Service Award. Dorman has been serving in Talbot County for over 10 years and led the organization to expand its services from 24 employees to over 100. She was honored for her work providing behavioral health and rape crisis support to the community, as well as hosting various events."},{"title":"Bridge - The more you see, the more you know","content":"Eric Hoffer wrote, \"The hardest arithmetic to master is that which enables us to count our blessings.\" In a match of duplicate bridge, South planned his play in five spades after North's negative double showed four spades, using strategy to avoid a club loser and ultimately winning 300 points. East started with three spades, five diamonds, and was believed to have four hearts."},{"title":"Ballots not cast online","content":"Rich Adrian's letter clarifies that Maryland ballots printed from the website cannot be cast online; instead, voters fill out the printed ballot and mail it in. There is no voting online, eliminating hacking concerns. The printed ballot is treated with the same scrutiny as any other mail-in ballot."},{"title":"TODAY IN HISTORY/Jan. 21","content":"On January 21, 1793, King Louis XVI was executed by guillotine during the French Revolution. In 1910, the Great Paris Flood occurred when the Seine River burst its banks, and in 1915, the first Kiwanis Club was founded in Detroit. Other notable events include Vladimir Lenin's death in 1924, the ban on pinball machines lifted in 1976, and President Jimmy Carter's pardon of Vietnam War draft evaders in 1977."},{"title":"Police Unity Tour peddles through Denton","content":"Police officers on bicycles, including Lt. Nicholas Szymanski from Marlboro, New Jersey Police Department, participated in the Police Unity Tour in Denton on May 11, 2024, as part of their ride from Portsmouth, Virginia to Washington, D.C. The event raises awareness about fallen law enforcement officers and money for the National Law Enforcement Officers Memorial. The tour has grown exponentially since its start in 1997, raising $35 million, including over $400,000 by Szymanski's chapter."},{"title":"Ward 4 candidates talk property taxes, housing","content":"Candidates for Ward 4 seat in Easton, MD, discuss property taxes and housing: \n- Rev. Elmer Davis wants to increase the property tax rate, while Moonyene Jackson-Amis suggests exploring tax breaks.\n- Cameron Keefe emphasizes fiscal responsibility but supports affordable housing initiatives, including inclusionary zoning.\n- The candidates differ on their approaches to addressing Easton's affordable housing stock.\n- May 6 is the election date for the Ward 4 seat.\n- The town currently levies a property tax rate of 52 cents per $100 of assessed value."},{"title":"TV LISTINGS 6-26-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nJune 25, 2024, TV listings include:\n- Naptown Tournament and Challenge for boys' high school lacrosse\n- MLB games: Philadelphia at Detroit, Pittsburgh at Cincinnati, Colorado at Houston, Miami at Kansas City, Cleveland at Baltimore, Washington at San Diego, and more\n- NBA Draft First Round, 8 p.m. (ABC, ESPN)\n- Various international soccer matches including UEFA EURO 2024 Group Stage\n- USL Championship: Birmingham at Detroit, 7 p.m. (CBSSN)"},{"title":"Blues traveler - Blues singer Shemekia Copeland returns to Avalon with concert, music from award-winning album","content":"Shemekia Copeland will perform at the Avalon Theatre in Easton, MD on August 18. The show celebrates her award-winning album \"Done Come Too Far,\" produced by Will Kimbrough, which won the Critics Award for Best Contemporary Blues Album and was nominated for a Grammy last year."},{"title":"Candidate was truly impressive","content":"Moonyene Jackson-Amis, a practicing attorney and local public servant, was the standout candidate at the Avalon candidates' forum on May 3, 2025. She presented practical solutions for improving wage-earners' access to licenses in their trades, repurposing the hospital as a regional medical center for military veterans, and updating a program to help residents afford housing. Jackson-Amis demonstrated a well-thought-out action plan and the ability to leverage her law background and experience to bring plans to fruition."},{"title":"MACo and Talbot County Council discuss fiscal pressures facing state","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMichael Sanderson, executive director of the Maryland Association of Counties, briefed Talbot County Council on potential $600-$800 million budget shortfall facing lawmakers in Annapolis. Sanderson warned that the state's trust fund for The Blueprint initiative will run out of money by FY2028 if no adjustments are made. The Maryland Department of Transportation has delayed projects due to a significant budget deficit, with $1.3 billion in cuts from its six-year transportation plan. Talbot County Council member Pete Lesher noted his county is experiencing capital construction projects funded by pandemic-era grants, but expects to face income tax challenges soon."},{"title":"Family holding out hope for turf field project at Easton High","content":"The prospects of an artificial turf field at Easton High School are uncertain as the school year approaches. The project was initially approved in December 2023 after Elgin Hawley, a Make-A-Wish wish recipient who suffered from an aneurysm on the field in 2021, requested it. However, Talbot County Public Schools received only $1.5 million for capital projects this fiscal year, short of the estimated $1.8 million needed. The Board of Education is considering alternative options, including a high-quality grass field, and has not made an official decision allocating funds to the project yet."},{"title":"Old Christmas - History, traditions and celebrations of Jan. 6 holiday","content":"Christmas was originally celebrated on Jan. 6 by many Europeans in the Julian calendar until Emperor Constantine moved it to Dec. 25 in 336 A.D. \nThe 12 days of Christmas ended on Jan. 6 and some cultures, such as Armenians and Irish, continued to celebrate on this date.\nIn Appalachia and among the Amish and Mennonites, Old Christmas is celebrated with traditions like family gatherings, holiday foods, and superstitions about animals speaking at midnight."},{"title":"CONGRATS TO OUR 2023 BESTOF THE BEST TOP 3 FINALISTS!","content":"**Business Directory**\n\n* **Health and Wellness**\n\t+ Complete Care at Corsica Hills\n\t+ Easton Hospital\n\t+ Midshore Medical Center\n* **Education**\n\t+ Chesapeake College\n\t+ Salisbury University\n\t+ Washington College\n* **Government**\n\t+ Cecil County Government\n\t+ Maryland State Government\n\t+ City of Easton\n* **Finance and Banking**\n\t+ Harris Teeter\n\t+ AELI\n\t+ Shore United Bank\n* **Real Estate**\n\t+ Benson & Mangold Real Estate\n\t+ Brenton Realty Group LLC\n\t+ Taylor Properties\n* **Shopping**\n\t+ Bay Star Consignments & More\n\t+ Chesapeake Designs\n\t+ Free Spirit Threads\n* **Food and Drink**\n\t+ Amish Country Farmer's Market\n\t+ Harris Teeter\n\t+ The Winery\n* **Sports and Fitness**\n\t+ Blue Heron Golf Course\n\t+ Hog Neck Golf Course\n\t+ YMCA of the Chesapeake"},{"title":"Bridge - Which should be the trump suit?","content":"Here is a summary of the article in 4 sentences:\n\nSouth opens one heart on August 7, 2023, and North responds with one notrump, forcing East to double. In Bridge Base Online game, West considered passing but decided to rebid two hearts instead, with a preference for clubs as trump suit. However, South opened two hearts in nine other games against East's double, resulting in the defenders taking down 500 points. The play then involves diamond, diamond, diamond ruff, and club tricks for down two, requiring swift defensive shifts by East."},{"title":"Waterfowl Festival soaring to new heights","content":"Here is a summary of the article in 2-5 concise sentences:\n\nDeena Kilmon's first year as executive director of the Waterfowl Festival saw the event attract 25,000-30,000 attendees and set multiple records for attendance and revenue. The festival took place in Easton, Maryland, from November 14-16, 2024, with a high bar set for future success. Kilmon credited Mother Nature's favorable weather and local businesses for their symbiotic relationship with the festival. The event has an economic impact of over $3 million annually and benefits hotels, restaurants, retailers, and nonprofits."},{"title":"Talbot County considering new cannabis legislation","content":"Talbot County is reviewing regulations on cannabis operations, with drafted legislation proposing a 500-foot setback from residential properties. Two state license holders, Dave Ferraris and Lori Yates, expressed concerns over the restrictions during a public hearing on July 8. The county's planning and zoning director noted that a 200-foot setback is possible if affected property owners agree. The legislation would require processors and growers to operate on at least 20-acre lots and procure professional testimony on cannabis odor."},{"title":"New exhibition at AAM features artist Darlene R. Taylor","content":"A new art exhibition titled \"HEIRLOOMS\" by artist Darlene R. Taylor has debuted at the Academy Art Museum in Easton, Maryland, running through July 14. The exhibition features mixed-media collages using vintage linens and textiles collected from family albums and historical archives. Taylor's work explores the presence of Black women in Maryland's Talbot County communities and her own ancestry. The exhibition draws inspiration from artifacts unearthed during excavations at the Hill Community site, including personal items such as buttons, jewelry, and hair combs."},{"title":"Natural Resources Police use thermal imaging to rescue lost kayaker in Talbot County","content":"Natural Resources Police used thermal imaging to rescue a lost juvenile kayaker in Broad Creek, Talbot County, on July 4, 2025. The kayaker was found within five minutes of being located by a Natural Resource Police aviation unit led by Sgt. John Buchanan and tactical flight officer Christian Helwig. The rescue occurred around three miles from the kayaker's home, near Grace Creek."},{"title":"Callahan and Lesher reelected as Talbot County Council leadership","content":"Talbot County Council members reelected Chuck Callahan as president and Pete Lesher as vice president in Tuesday's election. Callahan has been a council member since December 1, 2014, while Lesher joined the council on December 3, 2018. The reelected leadership retained its positions from the prior year."},{"title":"Where has grace gone in winning?","content":"Dan McKew questions where grace has gone in winning, citing a lack of decorum and respectful behavior in politics, particularly in debating tactics that would be scolded in children. He advocates for shaking hands and respecting opponents, even those he disagreed with, as a measure of character. McKew fears many today's loudest voices would fail to pass this test."},{"title":"Celebrating the Fourth","content":"Three hundred-plus people gathered in St. Michaels on July 4, 2025, for the annual Children's Parade, led by Police Chief Jeffrey Oswald and carrying a flag from Scout Troop 741. The parade featured children marching through downtown with their families, who had traveled to the area from places like Denver, Colorado. A traditional Fourth of July program followed the parade at the St. Michaels Historical Museum, including patriotic songs."},{"title":"Talbot Board of Ed sees initial budget proposal","content":"The Talbot Board of Education reviewed its proposed budget for fiscal year 2026, which totals $85.8 million in unrestricted dollars, an $8.6 million increase from fiscal year 2025. The areas with highest increases are fixed charges ($2.23 million), instructional salaries ($1.7 million), and other instructional costs ($1.47 million). The proposed budget includes 33 additional positions, including English for Speakers of Other Languages teachers, assistants, and coaches, and an athletic trainer to serve Easton High School and St. Michaels Middle High School. The district's top priorities were academic equity in math, engaging environment, recruitment and retention levels, and meeting Blueprint objectives."},{"title":"Konner loved Paint Tilghman — we think you will too","content":"Star Democrat reporter Konner Metz attended Plein Air Easton's Paint Tilghman event on Tilghman Island in July 2025, where artists competed to capture the island's scenic beauty, including those from England."},{"title":"ESCR offering free introductory lessons","content":"ESCR is an adult rowing team based at Evergreen in Easton, MD. They are offering free introductory lessons and two Learn-to-Row clinics from April 28-May 1 and May 12-15. The cost of a full clinic session is $400 for 10 hours. ESCR is open to anyone over 18 interested in learning rowing, with no experience or swimming requirements being an obstacle for assistance."},{"title":"Talbot County Democrats marked election night with celebration of campaign efforts","content":"Talbot County Democrats celebrated election night with a party at the BAAM Center, featuring over 200 individual volunteers who helped with the campaign. The celebration came after record-breaking canvassing efforts in Talbot County and hopes for a \"blue\" state in Maryland. Kamala Harris won the U.S. Senate seat in Maryland, while Donald Trump flipped several swing states in his favor to win the presidential election. Democratic Party leaders acknowledged division among voters but emphasized universal values like clean water, education, and safety."},{"title":"TV LISTINGS 10-17-24","content":"October 16-17, 2024:\n\nAFL: Hawthorn at Port Adelaide, 4 a.m.; Geelong at West Coast, 6 a.m.\nNASCAR CRAFTSMAN Truck Series: Qualifying, 12:30 p.m., NASCAR CRAFTSMAN Truck Series: The Love's RV Stop 225, 4 p.m.\nFormula 1: Practice, Circuit of the Americas, 1:25 p.m.; Formula 1: Sprint Qualifying, 5:25 p.m.; FIM MotoGP: The Australia Grand Prix — Sprint Race, 11:55 p.m.\nCOLLEGE FOOTBALL:\nLouisville at Miami, 7 p.m.\nNebraska at Minnesota, 8 p.m.\nSan Jose St. at Utah St., 9 p.m.\nNorth Carolina at California, 10:30 p.m.\n\nOctober 18:\n\nFormula 1: Sprint Race, 12:55 p.m.; NASCAR Xfinity Series: The United Rentals 250, 4 p.m.\nWomen's Australian Rules: St. Kilda at Carlton, 4 a.m.\nCOLLEGE FOOTBALL:\nLSU at Vanderbilt, noon; UConn at Boston College, noon\nNHL: Florida at Buffalo, 3 p.m.\n\nTransactions:\n\nNational Basketball Association (Thursday): Charlotte Hornets waived G Spencer Dinwiddie.\nNational Football League (Thursday): Buffalo Bills signed LB Jimmy Ciarlo to the practice squad."},{"title":"Experts discuss Mid-Shore impacts of human trafficking","content":"Here is a summary of the article in 2-5 concise sentences:\n\nExperts discuss Mid-Shore impacts of human trafficking, citing social media's role in traffickers finding and grooming victims at home. Thomas Stack and Heather Amador warned that Maryland's geography, poverty, and wealth create a toxic mixture for exploitation and sex trafficking. A panel highlighted signs of trafficking, such as bruises, new tattoos, and suspicious online activity, and emphasized the need for community awareness and vigilance. The event aimed to raise awareness and provide resources for identifying victims and combating trafficking."},{"title":"Monster munchies: Duff Goldman and Rosanna Pansino host creepy cookie contest","content":"Celebrity pastry chef Duff Goldman and social media sensation Rosanna Pansino host \"Halloween Cookie Challenge\", a Food Network competition where contestants compete to make creepiest, spookiest, and tastiest Halloween cookies. The show airs Mondays through October 2023 on the Food Network. Contestants face challenges such as creating edible stained glass, giant Halloween fun houses, and playable spirit boards. The winner takes home a $10,000 trick-or-treat bag each episode, with a grand prize of $40,000 at the end of the season."},{"title":"Republicans continue to push Talbot Board of Elections on election judge breakdown","content":"County Republicans continued to push Talbot County Board of Elections on election judge breakdown during the board's monthly meeting. The current breakdown is 62 Democratic judges, 50 Republican judges, and 11 unaffiliated judges, with local officials citing state law that requires equal numbers of judges from each party. State agencies have emphasized election security and compliance with law, while Attorney General Anthony Brown said it's not possible to achieve exact party balance due to factors outside the local board's control. The Board of Elections accepts interest forms for election judges continuously and provides training, but some Republicans claim they were not informed of vacancies for this year's general election."},{"title":"MEN'S TOP 25 FARED 1-21-24","content":"No. 1 UConn beat Iowa 84-70 on January 20, 2024. No. 2 Purdue and No. 14 Illinois did not play due to injuries. The rankings include: No. 3 Kansas lost to West Virginia, No. 4 North Carolina won against Boston College, No. 5 Houston won against UCF, No. 6 Tennessee beat Alabama, and No. 15 Oklahoma won against Cincinnati."},{"title":"13th annual Watermen’s Appreciation Day draws a crowd","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe 13th annual Watermen's Appreciation Day was held at the Chesapeake Bay Maritime Museum on August 12, 2024, drawing hundreds of people to celebrate local watermen and fundraiser for the Talbot Watermen's Association. The event, started in 2010 by association president Jeff Harrison, has grown in popularity over the years with a strong showing from the local community. The museum benefits from admission intake, while also partnering with watermen on fundraising efforts. The event featured boat docking contests, steamed crabs, live music, and family activities, with volunteers including Ashley and James Harrison, who started volunteering at age 10 and continued with their children."},{"title":"FOR THE RECORD","content":"A June 30 article on the Wittman Post Office contained inaccurate information about the current postmaster, stating Christie Henckel was still in position when she is actually retired. A similar mistake was made in an article about St. Michaels marketing, which incorrectly stated the bid was awarded to a different company. The correct representative of St. Michaels Tourism LLC is Maya Brannon."},{"title":"WHCP running membership drive through Nov. 11","content":"WHCP running membership drive through Nov. 11 with a matching gift of $10,000 from an anonymous local donor. The station offers diverse musical styles and Mid-Shore news updates, with a goal to support its public radio offerings. WHCP is one of 17 NPR member stations offering the NPR+ podcast bundle as a thank-you gift for annual memberships. Individual annual memberships start at $35, with sustaining monthly membership options available for less than $7/month."},{"title":"YMCA back to normal operations after Saturday fires","content":"Here is a summary of the article in 4 sentences:\n\nThe YMCA in Easton, Maryland was closed on Saturday after two fires broke out, one involving a second-floor closet and the other an HVAC unit on the roof. The fires were extinguished with minimal damage to the building, but the racquetball courts had to be closed due to water damage. The cause of the first fire is still under investigation while the second was attributed to a mechanical failure with the HVAC unit. Regular operations resumed Sunday morning with all facilities open except the racquetball courts, which are expected to reopen soon."},{"title":"'How Lucky Is This Community' - Connect Talbot Project Celebrated For Its Success","content":"Here is a summary of the article in 4 concise sentences:\n\nEaston Utilities' Connect Talbot project was celebrated on September 21, 2023, by over 60 representatives from the U.S. Department of Agriculture for its continued progress in extending broadband to unserved portions of Talbot County, MD. The USDA awarded Easton Utilities $13.1 million in grant funding in July 2020, which has since been supplemented with additional funding sources totaling over $30 million. As of early September, the project had completed over 50% of its mileage construction and provided access to over 1,750 locations, with 920 subscribers enjoying internet service. The project is on track for completion by December 31, 2026, with Easton Utilities' president Hugh Grunden crediting partnerships with the USDA, state and local governments, and others as key to its success."},{"title":"Local health care 'excellent'","content":"Here is a summary of the article in 2-5 concise sentences:\n\nCindy Genther experienced a stroke on August 17, 2024, and received excellent care at local health facilities. She was transported to Chester River Hospital by ambulance, where Dr. Lukas evaluated her condition and recommended she remain for further evaluation. After being transferred to an acute-care facility in Easton, she received exceptional care from doctors, nurses, and staff, including Dr. Devkota and Dr. Valentin. Genther has praised the local healthcare system, citing \"exceptional\" service, highly skilled professionals, and a caring attitude."},{"title":"St. Michaels Tourism Advisory Board holds first meeting","content":"The St. Michaels Tourism Advisory Board held its first meeting at the Boy Scout Cabin in St. Michaels on January 24, 2025. The board discussed budgets, marketing and branding strategies, including combining websites and understanding tourist demographics. Members included Timothy Law, representing retail businesses, and Brian Ball, managing director of the Wildset Hotel. The board aims to assist the town in promoting tourism and encouraging businesses to locate or remain in St. Michaels."},{"title":"Waterfowl Festival looks forward","content":"Deena Kilmon is the new executive director of the Waterfowl Festival, a year-round effort with events and conservation efforts. The festival welcomes 20,000 visitors in November at the Armory in Easton, Maryland, featuring art sales, demonstrations, and educational events. Kilmon plans to revitalize the Armory's space, including restoring historically accurate windows and fixing the roof, aiming to turn it into a community center with ongoing events. She also aims to connect with younger members of the community through new initiatives."},{"title":"For All Seasons partners for suicide intervention","content":"For All Seasons is partnering with Santé Eastern Shore to offer a LivingWorks ASIST training on April 7-8 at Anchor Church in Easton. The two-day workshop will teach caregivers how to recognize suicidal thoughts and provide support. Participants will receive 12 Category I CEUs and registration is $350 due by March 31."},{"title":"Holiday Pottery Sale at AAM","content":"The Academy Art Museum in Easton, MD will host its Holiday Pottery Sale on December 9 from 10 a.m. to 2 p.m. The event features works by artists and students taking pottery classes at the museum, with proceeds benefiting the clay program. AAM is located at 106 South Street in Easton."},{"title":"Bridge - Deception by deduction","content":"John Ruskin discussed deception in lying in bridge. In a recent deal, East deliberately dropped his queen of hearts to deceive South's declarer. The ruse was successful due to prior communication through the auction, where South had shown four hearts. This allowed East to afford playing his heart queen safely, as he knew South would have played a heart to dummy's king if they started with A-Jx-x."},{"title":"Commissioners of Oxford table voting resolution","content":"Here is a concise summary of the article in 4 sentences:\n\nOxford Commission President Norm Bell recommended voting on a resolution to clarify voting registration requirements March 13, 2025, but the commission tabled it in a two-to-one vote. Commissioner Katrina Greer expressed concerns that rushing into the vote could delay its effectiveness for the town's upcoming election in June. The commission held a work session Feb. 25 and again March 5 to discuss the issue, with some residents sharing thoughts on voting eligibility. Commissioner Tom Costigan voted against tabling the resolution, but suggested writing rules for the Oxford Election Board instead."},{"title":"Rabbi Hyman delivers multicultural understanding","content":"Rabbi Peter Hyman DD is retiring from Temple B'nai Israel after 18 years as its first full-time rabbi in October 2024.\nHe has promoted multicultural understanding and respect for different religious beliefs, owning a Persian rug with 99 names of God in Arabic that he views as a metaphorical bridge between faiths.\nRabbi Hyman has received numerous awards for his interfaith work, including the NAACP Dorothy Webb Black Community Service Legacy Award and the Governor William Donald Schaefer Helping People Award.\nHe is an author, teacher, and Scouting leader who earned his Eagle Scout award in 1984 and served as a national chair for the Messengers of Peace Program, BSA.\nRabbi Hyman will continue to serve on the Eastern Shore despite his retirement."},{"title":"Talbot council mulling $1.1 million request from school district","content":"Here is a summary of the article in 4 concise sentences:\n\nTalbot County Public Schools is seeking $1.1 million from the Talbot County Council for fiscal year 2026 to fill nine new positions and provide teacher salary increases.\nThe request is \"scaled-back\" from the district's earlier ask of $5.7 million, with leaders saying it's a necessary step to address financial pressures.\nCouncil members are deliberating on whether to grant the full funding, with some supporting the reduced amount and others indicating they need more time to consider options.\nA final decision is expected at the council's May 27 meeting, which will include an education supplement to the property tax rate, potentially resulting in a 0.0106 per $100 of assessed value increase."},{"title":"Idon't believein superstition  but - Out to Pastor","content":"Dr. James L. Snyder writes about his experience with receiving multiple apple fritters from the \"Gracious Mistress of the parsonage\" over three days in November 2023, leaving him puzzled and wondering what is behind this phenomenon."},{"title":"Said before, but rarely","content":"Here is a summary of the article in 4 sentences:\n\nTerence, a Roman comic poet from the 2nd century B.C., wrote that \"Nothing has yet been said that's not been said before.\" The key to playing the club suit for at most one loser in Notrump lies in maximizing chances against a 4-1 break. South starts with 10 top tricks: two spades, four hearts, two diamonds and two clubs, allowing for one club loser but not two. A better play is to win the diamond lead with dummy's ace and call for the club 10."},{"title":"Easton Town Council/Aug. 4, 2025","content":"The Easton Town Council meeting on August 4, 2025, approved a zoning certificate request for amplified music at the Tidewater Inn and reappointed Jennifer Williams to the Housing Authority and Ethics Commission. The council also appointed James Carr to the Historic District Commission and scheduled a workshop on the comprehensive plan of Fox Chase Estates for August 25. Easton Utilities recognized William \"Buck\" Duncan as commissioner for 12 years, swore in Shirl Jenkins as new commissioner, and presented a strategic plan with four main priorities."},{"title":"celebrity profile - Julianne Moore","content":"Julianne Moore started her career on soap operas \"The Edge of Night\" (1984) and \"As the World Turns,\" earning a Daytime Emmy Award for her work on that show from 1985 to 1988. She later appeared in TV miniseries, movies, and played Sarah Palin in the 2012 HBO project \"Game Change,\" winning a Primetime Emmy Award for her role."},{"title":"Average gas prices continue falling in Maryland","content":"Average gasoline prices in Maryland fell 3.7 cents per gallon to $2.91 per gallon on Monday, according to GasBuddy's survey of 2,167 stations. The national average price of diesel declined 1.8 cents to $3.472 per gallon. Patrick De Haan, head of petroleum analysis at GasBuddy, predicted the falling prices may be coming to an end due to rising oil prices above $70."},{"title":"TODAY IN HISTORY/Oct. 2","content":"Thurgood Marshall joined the U.S. Supreme Court on October 2, 1967.\nIn 1919, President Woodrow Wilson had a serious stroke at the White House.\nGerman troops crushed the Warsaw Uprising in 1944, killing a quarter of a million people.\nA chartered plane carrying Wichita State University football players crashed in Colorado in 1970, killing 31 people.\nAn armed milk truck driver took hostages at an Amish schoolhouse in Pennsylvania in 2006, killing five and wounding five others.\nVin Scully signed off from baseball broadcasting on October 2, 2016.\nJamal Khashoggi was killed by Saudi Arabian officials at the Turkish Embassy in 2018."},{"title":"Kids show their skills at the Talbot County Fair","content":"The Talbot County Fair celebrated its 41st annual event in Easton, MD on July 14, 2024. Hundreds attended the five-day celebration featuring fashion shows, games, bouncy castles, and vendors. Senator Johnny Mautz presented a citation of recognition to fair organizers, while John Coleman from the Talbot County Sheriff's Office sang \"God Bless America\" during the opening ceremony. Annette Clougherty, 12, showcased her three cows at the fair, while Bailei Caldeira demonstrated pig care and advised kids on raising animals."},{"title":"Dangerous minds - Israel-Hamas war, Musk comments, police surveillance spark new social media fights","content":"- The US government is increasing police and government surveillance of social media amid concerns about increases in antisemitism and terrorism threats following US support for Israel's war against Hamas in Gaza.\n- Twitter/X owner Elon Musk sparked a new social media battle with comments supporting anti-white sentiments among \"Jewish communities.\"\n- Major media and technology advertisers, including Disney, Apple, and Paramount Global, have paused advertising on X amid concerns about the platform's handling of hate speech.\n- The Biden administration condemned Musk's statement, drawing parallels to the beliefs of Robert Bowers, who faces the death penalty after the Tree of Life Synagogue shooting in Pittsburgh.\n- A group of 21 GOP attorneys general want the federal government to \"vigorously renew vetting\" foreign college students deemed to be supporting Hamas and Hezbollah.\n- U.S. Rep. Thomas Massie called for protecting free speech and civil liberties advocates who are concerned that anti-Israel protests can bleed into censorship.\n- A group of congressional Republicans is leading efforts to keep Palestinian refugees from entering the US, citing concerns about screening potential refugees.\n- The American Civil Liberties Union wants universities to uphold free speech principles in the face of pro-Palestinian student protests.\n- New York Gov. Kathy Hochul said state police have ramped up social media surveillance and will reach out more to individuals and groups posting hate speech online.\n- Republican presidential candidate Nikki Haley wants to require all social media accounts be verified by name to eliminate anonymous online speech on major platforms."},{"title":"Talbot's advanced life support pioneers reflect on program's 40-year mark","content":"Five Easton firefighters began a new advanced life support program on August 13, 1985, with just one vehicle from the fire department. The \"first five\" pioneers included Wayne Dyott, Kevin Knussman, Marc Stockley, Ray Taylor, and the late Gary Jones. Over 40 years later, Talbot County's paramedic services have expanded to six ALS units and over 50 staff members, saving around 6,800 calls last year."},{"title":"Easton's new fire chief has plans for equipment, recruitment","content":"J.R. Dobson was elected Easton fire chief in December 2024 and officially took on the role this month. He has experience as patrol and operations commander at the Talbot County Sheriff's Office and plans to recruit and retain more volunteers for the department. Dobson aims to implement standard operating procedures, purchase a utility vehicle for Rails to Trails and woods fires, and buy a new engine."},{"title":"Tunis Mills bridge replacement project moves forward","content":"The Talbot County Council agreed to move forward with replacing the Leeds Creeks Bridge in Tunis Mills with a wooden deck and timber wearing surface, as proposed by County Engineer Ray Clarke, after months of resident input. The project costs around $6.5 million, with $1.5 million coming from the county and the rest federally funded. Advocates for a 100% wooden replacement, including Susan McDermott and John Tabori, expressed concerns but welcomed the changes to the proposal. The council unanimously approved the project as presented, with Vice President Pete Lesher thanking Clarke's team for their efforts and expressing hope that federal funding comes through despite potential suspensions."},{"title":"Maryland House and Garden tour lets visitors explore Talbot County properties","content":"Here is a concise summary of the article:\n\nCanterbury Manor in Easton, MD was one of several historic properties visited during the Maryland House and Garden Pilgrimage tour, which benefits preservation and restoration efforts in historically significant properties across the state. The 1906 colonial revival style home features French copper pots, Steinway Piano, and English furniture. Proceeds from the tour go toward preserving Talbot County properties, including the restoration of Scotts United Methodist Church and St. Paul's Episcopal Church in Trappe. The tour visited multiple homes, gardens, and farms in Talbot County, including Ellenborough, Easton's 219 S. Hanson St., Chloras Point Farm, Ferry Farm House, and Lloyds Landing."},{"title":"Seaplane crashes into Harris Creek, pilot uninjured, state police say","content":"Here is a summary of the article in 2-5 sentences:\n\nA seaplane crashed into Harris Creek on June 12, 2025. The pilot, identified as a 62-year-old male, was uninjured and the sole occupant of an Aviat Husky aircraft. The seaplane experienced a mechanical malfunction while approaching its landing site. State troopers and Maryland Natural Resources Police responded to the scene, with assistance from Towboat U.S. The incident occurred around noon."},{"title":"Mayor Megan Cook brings down duck gavel, officially opening 53rd Waterfowl Festival","content":"Mayor Megan Cook opened the 53rd annual Waterfowl Festival with a ceremony at the Tidewater Inn on November 8, 2024. Eric Milhollan, president of the executive board, welcomed attendees and recognized their support for conservation efforts. The festival honors waterfowl enthusiasts, local wildlife, art, heritage, food, and community. Honors included citations, memoriam for Kim Perry Whiteley, Hall of Fame presentations for Blenda Armistead, Ron Flohr, and Butch Townsend, and the unveiling of a new waterfowl statue by Featured Artist Ronnie Wells."},{"title":"Impoverished of mind","content":"Here is a summary of the article in 3 concise sentences:\n\nGeorgie Morris Garbisch expresses concern that America's representatives are \"imporished of mind\" and lack integrity, impacting children's, women's, and men's lives. This is due to self-aggrandizing individuals who reject responsibility and threaten the planet's fragility. The author blames these actions on unlearned leaders who erode human beauty and creativity."},{"title":"How will Talbot County schools regulate AI this year?","content":"Talbot County school leaders have outlined new guidelines on artificial intelligence use for the 2025-26 school year. Director of Teaching and Learning Robin Werner presented the guidelines at a Board of Education meeting. The guidelines prohibit using AI to fully plan lessons or make classroom decisions, while encouraging responsible AI tool use among staff."},{"title":"Bay Country Chorus names Barnershopper of the year","content":"The Bay Country Chorus recognized Scott Haddock as the 2023 Barbershopper of the Year. Haddock, an active member for over 10 years, has demonstrated contributions to preserving and encouraging barbershop harmony. He follows in the footsteps of his father and uncles who were also singers of four-part harmony. The Bay Country Chorus is the Easton, Maryland chapter of the Barbershop Harmony Society."},{"title":"AL LEADERS 6-23-24","content":"American League leaders as of June 22, 2024:\n\nBATTING: Witt, Kansas City, .314; Correa, Minnesota, .308; J.Smith, Texas, .304; Soto, New York, .304; Rutschman, Baltimore, .303; Judge, New York, .301; Altuve, Houston, .297; Y.Alvarez, Houston, .292; Ja.Duran, Boston, .283; Paredes, Tampa Bay, .283; Perez, Kansas City, .283.\nRUNS: Henderson, Baltimore, 65; Soto, New York, 61; Witt, Kansas City, 60; Judge, New York, 58; J.Ramírez, Cleveland, 56; Volpe, New York, 54; Ja.Duran, Boston, 52; Semien, Texas, 52; Greene, Detroit, 49; Garcia, Kansas City, 47.\nRBIS: Judge, New York, 67; J.Ramírez, Cleveland, 67; Henderson, Baltimore, 53; Rutschman, Baltimore, 53; Witt, Kansas City, 53; Santander, Baltimore, 51; Pasquantino, Kansas City, 46; Raleigh, Seattle, 45; Stanton, New York, 45; Perez, Kansas City, 45.\nHITS: Witt, Kansas City, 99; Altuve, Houston, 93; Ja.Duran, Boston, 90; Rutschman, Baltimore, 90; Volpe, New York, 87; Y.Alvarez, Houston, 83; Henderson, Baltimore, 83; Soto, New York, 83; Judge, New York, 82; Y.Díaz, Tampa Bay, 81; Guerrero, Toronto, 81.\nDOUBLES: Bleday, Oakland, 22; Judge, New York, 22; Ja.Duran, Boston, 21; Castro, Minnesota, 20; Mountcastle, Baltimore, 20; Pasquantino, Kansas City, 20; Witt, Kansas City, 20; J.Smith, Texas, 17; Altuve, Houston, 16; Y.Alvarez, Houston, 16; Neto, Los Angeles, 16.\nTRIPLES: Ja.Duran, Boston, 10; Volpe, New York, 7; Witt, Kansas City, 7; W.Pérez, Detroit, 5; Westburg, Baltimore, 5; Carpenter, Detroit, 4; Castro, Minnesota, 4; Henderson, Baltimore, 4; Vierling, Detroit, 4.\nHOME RUNS: Judge, New York, 27; Henderson, Baltimore, 24; Santander, Baltimore, 20; K.Tucker, Houston, 19; J.Naylor, Cleveland, 19; J.Ramírez, Cleveland, 19; Stanton, New York, 18; Soto, New York, 18; Y.Alvarez, Houston, 16; O'Neill, Boston, 15.\nSTOLEN BASES: Caballero, Tampa Bay, 24; D.Hamilton, Boston, 21; Witt, Kansas City, 21; Rengifo, Los Angeles, 20; Ja.Duran, Boston, 19; Garcia, Kansas City, 17; Mullins, Baltimore, 16; Ju.Rodríguez, Seattle, 16; Volpe, New York, 15; D.Blanco, Kansas City, 14; J.Ramírez, Cleveland, 14.\nPITCHING: Lugo, Kansas City, 10-2; Gil, New York, 9-2; Rodón, New York, 9-4; R.Blanco, Houston, 8-2; Burnes, Baltimore, 8-3; Skubal, Detroit, 8-3; L.Allen, Cleveland, 8-3; Rodriguez, Baltimore, 8-3; Lively, Cleveland, 7-3; Ober, Minnesota, 7-4; Bello, Boston, 7-4.\nERA: Houck, Boston, 2.14; R.Blanco, Houston, 2.34; Burnes, Baltimore, 2.35; Lugo, Kansas City, 2.42; T.Anderson, Los Angeles, 2.48; Skubal, Detroit, 2.50; Gilbert, Seattle, 2.71; Gil, New York, 2.77; Flaherty, Detroit, 2.92; Fedde, Chicago, 3.05.\nSTRIKEOUTS: Crochet, Chicago, 124; Ragans, Kansas City, 109; Flaherty, Detroit, 108; Skubal, Detroit, 105; Bibee, Cleveland, 99; Gilbert, Seattle, 99; Gil, New York, 97; L.Castillo, Seattle, 96; K.Crawford, Boston, 95; Ryan, Minnesota, 95."},{"title":"Local lightning rods: Social media, national divisions changing local politics","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMegan Cook, Russ Nelson and Ann Groves Lloyd are mayors of small towns in Maryland, Montana, and Wisconsin respectively. The four have seen the impact of social media on local politics, with controversy over curriculums, COVID rules, and national issues. Social media has also brought transparency to city halls and schools but can magnify distrust of institutions and bring coarse discourse."},{"title":"Excellent customer service","content":"Jerry and Peggy Townsend, residents of Northeast, Tennessee, visited the Spurry Tire Company in Easton, Maryland. Their car's valence was hanging down after four days in St. Michaels, and they received excellent customer service despite being from out-of-state. Jerry asked to see Brent Spurry, the owner, and was impressed by his kindness and business practices."},{"title":"Museum celebrates oysters at OysterFest","content":"The Chesapeake Bay Maritime Museum will celebrate OysterFest on October 28, featuring oysters served variously, local fare, craft beer, and live music; a new Welcome Center and Museum Store at the museum's campus will also be open to visitors; guests can participate in an oyster stew competition, demonstrations, and children's activities."},{"title":"Time for DeSantis to rock and roll with Trump - COMMENTARY","content":"Here is a summary of the article in 2-5 concise sentences:\n\nRon DeSantis recently acknowledged that claims of election fraud were false during an interview on August 8, 2023. The move came ahead of a new poll showing a closer-than-usual Iowa caucus contest, with DeSantis running second to Donald Trump. A New York Times/Siena College poll found 67% of Iowa Republicans preferred a candidate focused on law and order over one trained on defeating radical ideology, raising questions about DeSantis' selling points. The article suggests that DeSantis needs to demonstrate integrity as key component of his campaign."},{"title":"Bistro St. Michaels takes top honors at OysterFest","content":"Bistro St. Michaels won the Oyster Stew Competition at the Chesapeake Bay Maritime Museum's annual OysterFest for the second time in three years, led by Chef Doug Stewart. The competition took place on November 8, 2024, and was part of a festival that drew over 3,000 guests. Bistro St. Michaels also won the People's Choice Award with their Stew A entry."},{"title":"Hundreds compete in Quick Draw","content":"The Plein Air Easton's Quick Draw took place in downtown Easton on July 21, 2024, with around 200 artists competing to create a painting in two hours. The event has been held for 20 years and has become a fan favorite, attracting tourists and art lovers alike. Neil Hughes from Medford, New Jersey, and Kaitlyn Hay from Washington, D.C., participated in the event, while 7-year-old Isabel Tilley was one of the youngest painters present. The grand prize winner, David Orrin Smith from Seattle, received an invitation to compete in Plein Air Easton 2025."},{"title":"Plein Air Easton 2025 schedule","content":"Here is a summary of the article in 4 sentences:\n\nPlein Air Easton 2025 schedule includes events from July 9-20. Events take place at various locations including Downtown Easton, Oxford Community Center, Tilghman Island Inn, and Christ Church Fellowship Hall. Demonstrations feature artists such as Vlad Duchev, Alison Barry, Nancy Tankersley, John T Eiseman, and Robert J. Simone. The schedule also includes exhibitions, sales, and a Collector's Preview Party at the Academy Art Museum on July 18."},{"title":"Easton's Giant Crab Competes for Top Drop in the US","content":"Easton's Giant Crab Drop was nominated for the USA TODAY 10Best Readers' Choice travel awards in 2023 as Best New Year's Eve Drop. The event, part of First Night Talbot, drew attention from CNN in 2014. Voting ended on December 4, with winners announced on December 15. Easton is the smallest town competing and needs statewide support to win."},{"title":"Talbot County man charged with sexually assaulting a child","content":"Kevin Halmiton Manning, 34, of Talbot County, was convicted of sexually assaulting a 3-year-old child in April 2025. Manning pled guilty to 10 counts, including a felony third-degree sex offense, and is scheduled for sentencing on July 24, 2025."},{"title":"Mark your calendar","content":"Wayne Wheeler will perform live music on Nov. 10 at VFW hall and Nov. 11 at Easton Farmers Market. The Academy Art Museum hosts its annual Members' Exhibition through Nov. 26. Reagan Kent performs at Easton Farmers Market on Nov. 18. A \"Whale Acrylic Painting on Canvas\" class is offered for kids and teens ages 8-17 at St. Michaels Library on Nov. 16."},{"title":"Damaged pipe causes sewage discharge in St. Michaels","content":"Here is a summary of the article in 4 sentences:\n\nOn September 24, 2025, a cracked force main pipe caused a sewage discharge near the St. Michaels wastewater treatment plant in St. Michaels, Maryland. The Talbot County Sanitary District responded to the incident and worked with licensed haulers GoodLife and CHT Excavating to contain and clean up the spill. Approximately 500 gallons of untreated wastewater were discharged, but 1,500 gallons were recovered during the response effort. Environmental Health has determined there is minimal to no public health risk from the discharge."},{"title":"Equal means equal","content":"Here is a summary of the article in 2-5 concise sentences:\n\nSheriff Gamble questioned Maryland election director Tammy Stafford about flagrant abuse of election law in Talbot County. The Attorney General weighed in, stating that as sheriff, he has no role in enforcing election law, but also quoted the law requiring equal numbers of judges from Democrat and Republican parties at each polling place. The total number of judges does not need to be equal across the county. In past years, Stafford claimed there weren't enough Republicans signed up to be judges, but only four precincts abide by the law."},{"title":"AL GLANCE 5-5-24","content":"The current American League standings are:\nEast Division: Baltimore 22-11, New York 22-13, Boston 18-16, Toronto 16-18, Tampa Bay 15-18.\nCentral Division: Cleveland 21-12, Kansas City 20-13, Minnesota 19-13, Detroit 18-15, Chicago 7-26.\nWest Division: Seattle 18-15, Texas 17-16, Oakland 16-17, Houston 12-21, Los Angeles 12-21.\n\nFriday's results include:\nBaltimore 3, Cincinnati 0\nWashington 9, Toronto 3\nTampa Bay 10, N.Y. Mets 8\nN.Y. Yankees 2, Detroit 1\nL.A. Angels 6, Cleveland 0\nKansas City 7, Texas 1\nMinnesota 5, Boston 2.\n \nSaturday's results include:\nN.Y. Yankees 5, Detroit 3\nToronto 6, Washington 3\nCleveland 7, L.A. Angels 1\nBaltimore 2, Cincinnati 1\nSeattle 5, Houston 0.\n\nSunday's scheduled games include:\nDetroit at N.Y. Yankees\nToronto at Washington\nL.A. Angels at Cleveland\nN.Y. Mets at Tampa Bay\nBoston at Minnesota\nSeattle at Houston\nTexas at Kansas City"},{"title":"A map geek’s quest to clean the nation, 1 watershed at a time","content":"Jon Merryman, a 62-year-old man from Maryland, has been collecting trash and cleaning up roadsides in 22 counties spanning Virginia and West Virginia since his Nov. 6 election loss. He started as a volunteer ranger at the Grand Canyon and later worked on environmental projects before retiring in February 2022.\n\nMerryman aims to clean up every county in the United States, with a focus on watersheds rather than state lines, due to water carrying pollution across borders. As of Dec. 1, 2024, he had picked up trash in all 206 counties in the Chesapeake Bay watershed."},{"title":"LEGION SWEARS IN NEW OFFICERS","content":"The American Legion Talbot Post 70 swore in its new officers on August 5, 2023, including Wayne Hall as commander and Chuck Engh as vice commander. Ruth Higgins was present as department commander of Maryland. The officers were sworn in at the post, with Fred Bahr serving as chaplain and Doug Willy holding the position of service officer."},{"title":"Talbot keeps it simple on way to championship","content":"Talbot won the District 6 Senior League championship with a 5-2 victory over Dorchester on July 6, 2024. Manager Rich White's approach was simple: \"Just play baseball.\" The team was led by pitching duo Nathan Merchant and Couper Barletta, who combined to yield two unearned runs and strike out three. Talbot won the series 2-1 after also defeating Dorchester 13-3 in Hurlock on June 24."},{"title":"TODAY IN HISTORY/May 38","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMay 28, 1830: President Andrew Jackson signed the Indian Removal Act, forcing nearly 50,000 Native Americans to relocate west of the Mississippi River. \nOn this date, other notable events occurred: The 54th Massachusetts Volunteer Infantry Regiment left Boston for Civil War; John Muir founded the Sierra Club in San Francisco (1892); American troops fought at Cantigny during WWI (1918); US Army launched suborbital flights with rhesus monkeys and squirrel monkeys (1959); Burglars broke into Democratic National Committee headquarters in Washington, D.C. (1972)"},{"title":"4,000 gallons of sewage overflows into Windmill Branch","content":"On October 20, 2023, 4,425 gallons of untreated wastewater from a clogged gravity sewer line in Easton, MD discharged into Windmill Branch, headwaters of the Tred Avon River. The cause was attributed to grease, rags, and \"flushable\" wipes. Easton Utilities promptly treated the affected areas with lime."},{"title":"The Wailers, Southside Johnny highlight upcoming shows at Avalon Theatre","content":"Here is a concise summary of the article:\n\nThe Avalon Theatre in Easton has an upcoming slate of shows including:\n- The Met: Live in HD Madama Butterfly on May 11\n- Dar Williams with Guest Heather Maloney on May 11\n- Minor Gold on May 15\n- Julian Brezon on May 17\n- Boy Band Review on May 25\n- Carpool — Cars Tribute Band on June 1\n- Mutlu on June 6\n- Southside Johnny & The Asbury Jukes on June 7\n- The Brothers Comatose on June 20\n- The Wailers 2024 Legend Anniversary Tour on July 3"},{"title":"Make your groceries last longer","content":"Here is a summary of the article in 5 concise sentences:\n\nMary Hunt recommends storing berries with a vinegar and water mixture to extend their shelf life. She suggests wrapping celery, broccoli, and lettuce in aluminum foil before refrigeration to keep them crisp for up to a month. Storing potatoes with apples can halt potato sprouting, while keeping mushrooms in paper bags allows air circulation and preserves freshness for weeks. Hunt is the founder of EverydayCheapskate.com and author of \"Debt-Proof Living\"."},{"title":"Gluten-Free Bakery Girl rises to the challenge","content":"Tricia King, owner of Gluten-Free Bakery Girl, has been creating gluten-free recipes for over 20 years after being challenged by a client with rheumatoid arthritis. King opened her bakery in St. Michaels in 2012 and is now expanding to Easton, operating from a 100% certified gluten-free facility. Her goal is to help people with celiac disease lead safer day-to-day lives by providing accessible treats. King credits her passion for cooking, which began at a young age, and advises young girls to have faith in themselves and step outside their comfort zones."},{"title":"Rardin scores five goals in return as top-seeded Sabres grind way past Falcons for spot in MIAA B Conference championship","content":"Here is a summary of the article:\n\nSts. Peter & Paul High scored five goals from JJ Rardin as they defeated No. 4 Gerstell Academy 13-8 in the MIAA B Conference semifinal on May 14, 2024. The Sabres advanced to the championship game against second-seed Archbishop Curley at Navy-Marine Corps Memorial Stadium on Friday. Coach Todd Wolters was critical of his team's performance, but credited Gerstell's determination and fight for their loss."},{"title":"Cordova Day celebrates town's history, culture","content":"Cordova Day was held on March 9 at the Cordova Firehouse, celebrating the town's history and culture. The event marked the 75th anniversary of the Ladies Auxiliary and featured local artisans, historical displays, and a scavenger hunt for children. The gathering also honored the late Joseph Secrist Jr., a life member of the Cordova Volunteer Fireman's Association, who passed away on March 2."},{"title":"TALBOT COUNTY","content":"Here is a summary of the article in 2-5 concise sentences:\n\nSales data for several counties and cities in Maryland were reported on October 13, 2023, including Talbot County, Caroline County, Dorchester County, and Queen Anne's County, with various properties changing hands at prices ranging from $110,000 to $3,500,000. Properties sold include homes, farms, and commercial buildings in cities such as Easton, Cambridge, Chester, and Chestertown, and rural areas like Grasonville and Centreville. Notable sales included a $2,350,000 property in Easton and a $1,850,000 property in Queen Anne's County. Other properties sold included homes for around $200,000 to $900,000."},{"title":"Easton passes ordinance to mitigate seafood processing odors","content":"The Easton Town Council approved Ordinance 835 on December 4, 2024, requiring seafood processors to install odor control technology by July 1, 2025, to mitigate odors from processing operations. The ordinance was drafted following resident concerns about the smell of Chesapeake Brand Seafood's facility on Maryland Avenue in Easton, MD. Councilmember Rev. Elmer Davis advocated for a sooner compliance date, while Town Attorney Sharon VanEmburgh expressed concerns about shortening the period."},{"title":"Easton town hall meeting delves into expectations for LGBTQ+ community in new administration","content":"Here is a summary of the article in 2-5 concise sentences:\n\nTina Jones, Delmarva Pride Center Board Chair, warned that President-elect Donald Trump's administration may roll back federal protections for LGBTQIA+ people, particularly transgender individuals. A panel of experts, including Maryland lawmakers and advocates, discussed their expectations for the next four years and strategies to ensure and expand protections in Maryland. The panelists also highlighted the importance of grassroots organizing and getting involved in politics to protect LGBTQ+ rights. In 2018, Maryland elected more women, queer people, and people of color, who can now take on leadership roles to protect their rights. The state has taken an \"aggressive stance\" to anticipate rollbacks and is well-positioned to weather the storm."},{"title":"Easton named host of second ever Maryland Main Street Conference","content":"Easton will host Maryland's second-ever Main Street Conference on October 7 and 8, 2025. The conference aims to network and discuss improvement efforts for historic and downtown streets and neighborhoods in Maryland. Secretary Jake Day announced Easton as the host site during his tour of the town. The inaugural event was held in Frederick in 2024, which attracted over 400 attendees."},{"title":"TODAY IN HISTORY/Sept. 3","content":"On September 3, 1783, representatives of the United States and Britain signed the Treaty of Paris, ending the Revolutionary War. \n\nIn 1861, Confederate forces invaded Kentucky during the Civil War. \n\nThe first federal Labor Day holiday was celebrated in 1894. \n\nSir Malcolm Campbell drove an automobile more than 300 mph on September 3, 1935, at Bonneville Salt Flats in Utah. \n\nBritain declared war on Germany two days after Poland's invasion on September 3, 1939. \n\nAllied forces invaded Italy during World War II the same day Italian officials signed a secret armistice with the Allies in 1943.\n\nThe Viking 2 lander touched down on Mars to take color photographs of its surface on September 3, 1976."},{"title":"Precedent has been set","content":"Donald J. Trump was found \"guilty\" on 34 counts of misdemeanor charges. The circumstances surrounding his trial are unique due to his presidential campaign, setting a precedent for political opponents to dig up frivolous charges to halt their opponents' campaigns. This could lead to chaos and the collapse of the US government system. A similar situation occurred in 17th century England with the Magna Carta, which established the presumption of innocence until proven guilty."},{"title":"Talbot senior center opens upgraded computer lab","content":"Talbot County Senior Center at Brookletts in Easton, Maryland, opened an upgraded computer lab funded by a $33,356 T-Mobile Hometown Grant. Upper Shore Aging was awarded the grant to update technology at the senior center, which is part of a nonprofit organization serving nearly 31,000 seniors over 60 years old in Talbot, Caroline, and Kent counties. The lab features 20 new computer stations for access to connectivity, classes, and hands-on learning opportunities."},{"title":"What does civility mean?","content":"A local writer asked about civility in a letter to the editor on May 17, 2025. Catherine Nobles sought clarification, as the term was used during an election. Civility was defined by a friend as chatting with GOP workers for hours. The writer was standing at a GOP tent in Easton, MD."},{"title":"Christmas Music - An Ultimate Playlist","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMariah Carey, Brenda Lee, Ariana Grande, Bing Crosby, Perry Como, and Andy Williams are among top Christmas music artists featured on ultimate playlists. The playlists include popular songs like \"All I Want for Christmas is You\", \"Rockin' Around the Christmas Tree\", and \"Feliz Navidad\". Mariah Carey has multiple renditions of favorite holiday tunes, including \"Christmas (Baby Please Come Home)\" with Darlene Love and U2. These artists are among those celebrated on numerous ultimate playlists available on YouTube Music, Apple, Spotify, and other streaming services."},{"title":"Brief talk OK for worried diner","content":"A woman at a restaurant recognized the writer from over 10 years ago and asked about their current work situation, which was answered politely but briefly. The writer felt it was an okay interaction, as they were with a group of people and did not feel obligated to linger longer. Harriette Cole advises that the woman may try to reach out if she wants to talk more, and the writer's contact information is available online."},{"title":"Woman charged for graffiti acts at Sts. Peter and Paul Elementary","content":"Here is a summary of the article in 4 sentences:\n\nSian Radaskiewicz-King, 32, was arrested on September 8, 2025, and charged with multiple counts related to graffiti at Sts. Peter and Paul Elementary School in Easton, Maryland. The incident involved spray-painting the transgender symbol on various locations, including dumpsters, sidewalks, and a fence outside the school. A trial is scheduled for October 28, and King was ordered held without bond by Talbot County District Court Judge Karen Ketterman due to concerns about public safety and her documented mental health diagnoses. The incident has sparked outrage in the community, with the Delmarva Pride Center condemning the misuse of the transgender symbol as a \"misuse\" and Easton Mayor Megan Cook condemning such acts of intimidation as having no place in their community."},{"title":"Townsend, Orrell lead Warriors","content":"Easton High softball team defeated Wicomico 18-0 in five innings with senior Olivia Orrell hitting a two-run homer and junior pitcher Sammy Townsend registering a season-high 15 strikeouts. Easton improved to 7-4 after a series of losses and faces key dates with Kent Island and Cambridge-South Dorchester next week. The team's coach, Ryan Brice, said the win boosted confidence and morale, particularly after last week's losses and Tuesday's setback at North Dorchester. Townsend, who struck out all 15 batters, credited her tight curve and riser for a strong outing."},{"title":"Easton man pleads guilty to possessing child pornography","content":"Travis Schwaninger, a 43-year-old Easton man, pleaded guilty to four counts of possession of child pornography on January 17, 2025. He was arrested in June 2024 and faced eight counts. Circuit Court Judge Theresa Adams sentenced him to five years of supervised probation, registration as a Tier I sex offender, and submission to supervision. The remaining four charges were dropped by the state."},{"title":"Easton follows great loss with victory","content":"Here is a summary of the article in 2-5 concise sentences:\n\nEaston High assistant baseball coach Matt Blue died on Friday night after a 17-month battle with cancer. The team played their scheduled game against Southern-Anne Arundel on Saturday, with Blue's son Dustin pitching three-plus innings and helping lead Easton to an 11-2 victory in honor of his father. Easton head coach Albert Pritchett praised Dustin for his performance, saying he \"commanded all three of his pitches\" despite the emotional pressure."},{"title":"Easton man convicted of child abuse, assault","content":"Earl Andrew Kautz was convicted of first-degree child abuse and related charges on April 3, 2024. He faces sentencing on June 10 for abusing a one-year-old boy and assaulting a 13-year-old girl, both who lived with him. The trial included testimony from the 13-year-old and her mother, as well as expert medical testimony from Johns Hopkins Hospital."},{"title":"Lauren Rose named TCPS Teacher of the Year. Giovanni Wynn is Support Staff of the Year","content":"Lauren Rose was named the 2025-26 Talbot County Public Schools Teacher of the Year. Giovanni Wynn was named Support Staff of the Year for his work as family service coordinator at the St. Michaels Judy Center. The awards were given during the district's annual Talbot Stars celebration on April 3, 2025, in Easton, MD. Lauren Rose and Giovanni Wynn were among four finalists for Teacher of the Year and one finalist for Support Staff of the Year."},{"title":"How much growth is too much for Easton? Balance between housing needs, infrastructure unsettled","content":"Easton, MD is facing a significant residential growth boom, with multiple large-scale housing projects under construction, raising concerns about traffic, infrastructure, and affordability.\nThe town's population grew from 11,708 in 2000 to 17,101 in 2020, prompting leaders to balance housing needs with community preservation.\nSome residents and officials advocate for a halt to growth to preserve the town's small-town character, while real estate agents argue that it could lead to affordable housing shortages.\nThe town is weighing a case-by-case approach or focusing on infill development, prioritizing connectivity and neighborhoods over sprawling single-family homes.\nTown leaders are considering a comprehensive plan with an estimated annual population growth rate of 1.75% and seeking actionable items to address the housing-growth debate."},{"title":"Impossible to ignore","content":"Robert C. Willey approached by candidate's supporter at Dover Street Memorial in Talbot County, Maryland; told to withdraw from Easton Council president's seat and give personal support to candidate; candidate demands new ideas and says he is too old. Willey sees letter listing issues with town management; lawyers verify answers to questions were handled appropriately. Candidate brings up Willey's wife's insurance coverage as a concern in public, and sends four mailings with misinformation."},{"title":"News","content":"Jonathan Bennett is a winner on \"Halloween Wars\". The article does not specify further details."},{"title":"Trivial pursuit: New comedy film 'Quiz Lady' wins big","content":"Awkwafina stars as Anna, a reliable sister, alongside Sandra Oh's Jenny, her estranged and flamboyant sibling, in the comedy film \"Quiz Lady.\" The movie follows the sisters' road trip to Los Angeles to participate in a game show that could pay off their mother's massive debts. Released on Hulu on November 3, 2023."},{"title":"Talbot County Liquor Board license applications available","content":"The application process for 2025-2026 Talbot County liquor licenses is now available to the public on talbotcountymd.gov/liquorboard. Applications must be completed and submitted by March 31, 2025, with protests filed on or before March 30, 2025. The current licenses expire on April 30, 2025, and new licenses must be posted in businesses by May 1, 2025."},{"title":"Unwelcome lecture from a neighbor","content":"A 28-year-old resident of a small apartment complex in Easton, MD was lectured by her neighbor, a man in his 50s, about smoking. The woman fears that her neighbor will continue to give unsolicited advice and writes to ask for help in setting boundaries. Harriette Cole advises the woman to thank her neighbor's concern but put up a guardrail and politely ask him to refrain from giving advice on this topic in the future."},{"title":"Apoplectic reaction","content":"A letter writer, Holly Wrighte, comments on a cartoon from the Republican party being criticized for dragging Christianity into the public square and wrapping itself in it, with some readers showing \"apoplectic reaction\". Wrighte, a born-again Christian who ran for state Senate in 2018, believes Christians should not use the political process to impose their beliefs on others. She recalls her experiences visiting nursing homes, hospitals, and prisons, serving as an on-call chaplain, and visiting women in detention centers before criticizing the Republican party's efforts to promote policies that exclude the LGBTQ+ community and its attempts to restrict gatherings during the pandemic."},{"title":"TRANSACTIONS 7-7-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMajor League Baseball transactions include the Astros recalling RHP Kaleb Ort and optioning RHP Luis Contreras to Sugar Land. The Royals designated RHP Colin Selby for assignment and reinstated LHP Kris Bubic from the 60-day IL. NBA teams made various roster moves, including re-signings, extensions, and trades involving the Celtics, Hawks, Nets, Hornets, Bucks, Mavericks, Pistons, Pacers, Lakers, Heat, Timberwolves, Pelicans, Thunder, Magic, Suns, Kings, Jazz, Wizards, Liberty, Sharks, Jets, Atlanta United, Red Bulls, Revolution II."},{"title":"Sail Selina II to set sail in St. Michaels for final season","content":"Sail Selina II will sail its final season in St. Michaels starting next week, with Captain Iris Robertson retiring after 25 years at the helm. The boat has joined the National Park Service's Chesapeake Gateways Network and will undergo a ribbon cutting ceremony on April 24 at the Harbour Inn Marina. Sail Selina II was commissioned in 1926 and has been owned by Robertson's family for over 50 years, with Robertson becoming its third steward in 2001. The boat will sail until November 2, after which it will be passed down to Robertson's niece."},{"title":"For All Seasons gives update on human trafficking in Talbot County","content":"For All Seasons representatives Lauren Weber and Katie Theeke reported that human trafficking in Talbot County persists despite increased awareness and detection. According to Weber, over 120 people have taken a free online anti-human trafficking course since September. For All Seasons provides essential services to victims across five Mid-Shore counties, including Talbot County."},{"title":"Board of Realtors installs officers, presents awards","content":"The Mid-Shore Board of Realtors installed officers, presented awards on November 3, 2023. Shelby Roney was elected president for 2024, replacing Megan Rosendale. Honored members included Laura Anderson (Realtor of the Year), Janet Powers (Rookie Realtor of the Year), Shandell Green (President's award and Diversity, Equity and Inclusion Award), Chuck Mangold Jr. (Community Service Award), and Kari Anderson (Affiliate of the Year)."},{"title":"TODAY IN HISTORY/May 24","content":"Here is a concise summary of the article in 5 sentences:\n\nMay 24, 1935: The first night Major League Baseball game took place at Cincinnati's Crosley Field as the Reds beat the Philadelphia Phillies, 2-1. May 24, 1844: Samuel F.B. Morse transmitted the message \"What hath God wrought\" from Washington to Baltimore as he formally opened America's first telegraph line. May 24, 1941: The German battleship Bismarck sank the British battle cruiser HMS Hood in the North Atlantic. May 24, 1962: Astronaut Scott Carpenter became the second American to orbit the Earth aboard Aurora 7."},{"title":"Spurry's big night pace Talbot in opener","content":"Nathan Spurry hurled a complete game for Talbot Post 70, driving in Nico Nicolopoulos with the winning run in a 4-3 victory over Caroline Post 29 at Warrior Field on June 11, 2025. Spurry allowed only two runners to reach base over the first three innings and mixed a cutter with fastballs throughout the game. With four strikeouts and two walks, Talbot improved to 1-0, while Caroline fell to 0-1-1."},{"title":"Always plenty to be thankful for in Maryland","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThanksgiving has arrived in Maryland, a legacy dating back to early colonial America when European settlers thanked God for the harvest. Editor Sarah Josepha Hale launched her campaign in 1827 to make Thanksgiving an official holiday, with President Abraham Lincoln signing it into law in 1863. In 2024, there is still much to be thankful for, including peace, safety, and security at home, as well as community helpers who volunteer their time and resources. The author expresses gratitude for the strong community, its many friends and neighbors, and encourages readers to focus on the positive as they head into the holiday season."},{"title":"Community celebrates Earth Day at Adkins Arboretum","content":"Adkins Arboretum celebrated Earth Day on April 21, 2024, with a large crowd of 300 attendees. Environmental groups and government agencies hosted information tables, while master gardeners and monarch butterfly experts were present. Eastern Redbud saplings were given out for attendees to plant at home, and a birding trip led into the forest in the morning. Ginna Tiernan, executive director of Adkins Arboretum, said Earth Day heightens awareness and appreciation for nature, while Jay Falstad emphasized the importance of protecting the planet."},{"title":"TV LISTINGS 4-9-25","content":"Here is a summary of the article in 2-5 concise sentences:\n\nApril 8-10 TV listings include NHL games, college softball, and women's volleyball matches. Major League Baseball games feature N.Y. Yankees at Detroit and L.A. Dodgers at Washington. NBA games include L.A. Lakers at Dallas and Minnesota at Memphis. The Masters Par 3 Contest and PGA Tour: The Masters are scheduled for April 9."},{"title":"Pastoral Ponderings: Replacing fear with love","content":"Rob Bell questions whether God would condemn billions of people with eternal torment for their sins. He prefers to focus on God's love and believes that \"the love of the Lord is the beginning of knowledge.\" Jesus brought love and salvation to humanity as God in the flesh. Rob Bell has no fear of the Lord but instead experiences respect, reverence, awe, and love, stating that living a life of righteousness following Christ means fearing nothing."},{"title":"Sports Briefs","content":"Colonel Richardson High School will dedicate its basketball court to former coach Merrill Morgan on Thursday at 5 p.m. The dedication ceremony will take place during the girls' and boys' basketball games with St. Michaels. Colonel Richardson High School was coached by Morgan for 38 seasons, from an unspecified start date to August 7, 2022, when he passed away at age 84 due to Parkinson's Disease."},{"title":"APG Chesapeake hires new regional president","content":"Orestes Baez is APG's new regional president for the Chesapeake market, replacing an unspecified predecessor. He started on September 30, 2024. Baez previously worked as APG's Southern Wisconsin regional president from August 2020 to 2022 and was CEO of TravelHost. Orestes is a big fan of free speech and enjoys pickleball."},{"title":"Department of Aging funding anticipated to remain flat, secretary says","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMaryland Secretary of Aging Carmel Roques announced that funding for the Maryland Department of Aging is expected to remain flat over the coming year. The department's budget will not be cut but will also not grow, prompting efforts to maximize existing funding. The federal Administration on Community Living recently changed regulations to improve equity in community support services, particularly benefiting rural elderly populations. Funding allocated to area agencies for aging, such as Upper Shore Aging and MAC Inc., was relatively low compared to other state allocations. Maryland's population is rapidly growing older, with some areas having higher proportions of residents over 50 than others."},{"title":"Pastoral Ponderings: The Lenten season","content":"Here is a summary of the article in 4 concise sentences:\n\nAsh Wednesday marks the beginning of the Lenten season, a day associated with mortality and repentance that dates back to ancient Jewish tradition. The use of ashes as a symbol of penitence was common in early Christian ceremonies, including public confession and penance. The word \"Lent\" comes from the anglo-saxon term for spring, during which Christians focus on penitence and preparation for Easter through fasting, almsgiving, and devotion to their faith. Ash Wednesday is an exception to the modern customs of Lent, as it retains its original meaning as a day of repentance."},{"title":"Hogan Visits Port Street","content":"Larry Hogan visited the Neighborhood Service Center in Easton on October 18, 2024, where he met with Corey Pack and Lou Dorsey of the Responsible Father Initiative to discuss their program's focus on teaching men effective communication skills, including the \"three E's\" (emotion, energy, expression) and the \"7/38/55 rule\". Hogan saluted the dedication of the services and toured spaces intended for children. He also discussed his campaign focused on the economy and crime."},{"title":"Common sense degrees needed","content":"Here is a summary of the article in 2-5 concise sentences:\n\nRoo Wittman reflects on his conversation with a long-time family friend Mike about social climate and recalls stories about his ancestors, including great-grandfather Walter Wood, who was the chief of police in Easton. Walter Wood was known for his sensible approach to life, which his son referred to as having a \"C.S.\" degree, or common sense. Wittman notes that the challenges faced by their generation are similar to those of their predecessors and encourages using compassion and understanding towards neighbors."},{"title":"Town And Country Hosting Bourbon Raffle For Local Nonprofits","content":"Town And Country Wine is hosting a rare bourbon raffle to benefit local nonprofits Now through December 30, tickets can be purchased for a chance to win one of three highly sought-after bourbons: Little Book Chapter 07, Old Fitzgerald Bottled in-Bond 11 year, and Willett 8 year. The drawing will be held on Facebook Live on December 30. Proceeds from the raffle, now in its third year (2020), have raised over $22,000 for organizations including Tilghman Area Youth Association, Eastern Shore Land Conservancy, and Bay Hundred Community Volunteers."},{"title":"Sabres ride Webb's goal past Warriors - Freshman's early strike proves decisive in county showdown","content":"Angie Webb scored a goal for Saints Peter and Paul High's Sabres against Easton in a 1-0 victory on October 11, 2023. The Sabres improved to 10-2 with their fourth straight win, all by shutout, with goalie Maddie Maloney registering the sixth shutout of the season."},{"title":"Brutal treatment of beautiful field","content":"A resident of Cross Court's Greens complex in Easton, MD, writes to express concern over a field being mowed down twice a year to accommodate views of a bypass; James Carroll, August 25, 2023."},{"title":"Caps fill void, acquire Thompson","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe Tampa Bay Lightning and Washington Capitals made moves during rounds 2-7 of the NHL draft, clearing $11 million in salary cap space for potential free agent signings. The Lightning sent defenseman Mikhail Sergachev to Utah, acquiring prospects J.J. Moser and Conor Geekie, while the Capitals acquired goalie Logan Thompson from Vegas. Washington also traded forward Beck Malenstyn to Buffalo for a pick, while Toronto acquired rights to pending free agent Chris Tanev from Dallas. Other teams made trades to replenish goalie depth, acquire valuable defensemen, or shed contracts, with some teams buying out forwards like Jeff Skinner."},{"title":"Breakfast event to connect businesses at Waterfowl Festival","content":"The Talbot County Department of Economic Development and Tourism will host Coffee and Conservation, a networking event, at Art at the Pavilion in South Harrison Street from 8:30 to 10 a.m. on Friday, Nov. 10, as part of the Waterfowl Festival's 52nd year celebration. The event is sponsored by The Arc Central Chesapeake Region. The festival attracts 15,000 attendees annually and generates an economic impact of $3.5 million."},{"title":"Planners not sold on 365-unit development near new Easton hospital","content":"Here is a summary of the article in 4 concise sentences:\n\nEaston Sunrise Partners LLC and Scott Wagner are proposing a 365-unit residential development, Fox Chase Estates, on 112 acres off Airport Road near the Easton hospital. The project aims to address affordable housing needs for healthcare workers, but town officials have raised concerns about connectivity, density, and site plan issues. A Planning Commission meeting ended with no positive recommendation, and the commission will revisit the proposal on July 17. Approval would require a public hearing and ultimately decision by the Town Council, which has not yet scheduled a vote."},{"title":"Letter had no good reasoning","content":"Here is a summary of the article in 2-5 concise sentences:\n\nJanuary 14, letter \"Gone down a dark road\" was published in the Star Democrat, claiming Democrats control elections to push an agenda, but this claim is unfounded and contradicted by Republican involvement in election management. Letter writer Adrian also made false statements about harvesting ballots and questioned the legitimacy of mail-in voting without evidence. Michael Davis responds, pointing out numerous examples of Republicans' role in managing elections and debunking these claims."},{"title":"Forty years later, the goal was reached","content":"A group of five Easton firefighters in 1985 envisioned a comprehensive cardiac response effort. They manned a life support unit 24/7 and eventually contributed to the creation of a countywide paramedic system, which became Talbot County's Department of Emergency Services with six full-fledged life support units. Their goal was reached four decades later."},{"title":"Marriott awards top honor to Easton Fairfield Inn","content":"The Easton Fairfield Inn & Suites was recognized as the 2023 Hotel of the Year by Marriott out of over 1,000 Fairfield hotels worldwide. It is managed by Hill Hospitality and is located in Easton, Maryland. The hotel received a Diamond Award for its second consecutive year, with scores of fourth in intent to recommend, fifth in staff service, and seventh in cleanliness."},{"title":"Local student wins national essay contest","content":"Viana Johnston, an eighth-grade student at Lighthouse Christian Academy in Stevensville, won the national middle school winner of the Bill of Rights Essay contest hosted by the Stanley M. Herzog Foundation in 2023. The contest was held for students enrolled in a Christian school or those homeschooled in the US, with Viana receiving $250 and her school an additional $250. She submitted her essay to answer questions about the revolutionary significance of the Bill of Rights. Viana's school initially didn't expect to participate, but were thrilled when she won."},{"title":"rest of mike's story","content":"Ryan Waite, a veteran campaign consultant, said parties focus on engaging low-propensity voters, but social media presents challenges due to negative campaigning and misinformation. Mark Zuckerberg alleged the Biden-Harris administration pressured Facebook to censor dissenting content. Recent surveys show low trust in politics, media, and government, with Gen Zers having little faith in these institutions. Craig Snyder expects Harris' campaign to energize younger voters, while Ryan Ostfeld found Latino voters have lower turnout propensities due to a lack of faith in the political system."},{"title":"More Retro Rewinds","content":"Here is a summary of the article in 4 concise sentences:\n\nHappy Days will air a holiday mini-marathon on MeTV starting December 17, featuring the episode \"Guess Who's Coming to Christmas.\" Star Trek: The Motion Picture will premiere on MGM+ Drive-In on December 19, directed by Robert Wise and starring William Shatner and Leonard Nimoy. The 25th Annual A Home for the Holidays special airs on CBS on December 22, hosted by Katharine McPhee and featuring performances by Pentatonix and others."},{"title":"Lakeside wastewater treatment plant is complete","content":"The Lakeside wastewater treatment plant is complete and ready for transfer to the Town of Trappe.\nFirst proposed over 20 years ago, the development will span over 850 acres off U.S. Route 50 with a capacity for 2,501 units.\nThe new plant uses enriched nutrient removal technology with a spray irrigation system discharging treated wastewater onto nearby fields.\nThe Maryland Department of Environment has issued permits for the project, which has faced lawsuits and public outcry over environmental concerns.\nTransferring ownership to Trappe will be followed by oversight from Talbot County's Comprehensive Water and Sewer Plan."},{"title":"As avian flu spreads, local businesses grapple with increased egg costs","content":"Steve Mangasarian's Breakfast in Easton pays double for wholesale eggs due to the avian flu outbreak. The virus has caused a nationwide egg shortage, with impacts felt on the Eastern Shore and other states, including Delaware. Avian flu outbreaks have accelerated price increases since 2022, with projections predicting a 20% increase in egg prices for 2025. Mangasarian's restaurant added a 50-cent surcharge to egg orders, while some business owners are avoiding upcharges. The Maryland Department of Agriculture reported five commercial poultry farms experiencing outbreaks on the Eastern Shore last month."},{"title":"One proves enough for Easton","content":"Avery Brice's Easton team won 1-0 against St. Michaels High in a heated soccer match, with Rodrigo Fresco scoring in the fifth minute. Easton coach Avery Brice praised his team for their late-season surge, while St. Michaels head coach Pat Hambleton expressed pride after his team created momentum despite being down a man for most of the second half."},{"title":"A defining moment in Congress","content":"Andy Harris, a Catholic congressman, was criticized for his handling of the Jeffrey Epstein files and his decision to push through a large increase in the federal deficit without fully explaining it to his constituents. His colleagues are circulating a bipartisan discharge petition demanding the release of all Epstein files. The article demands that Harris sign the petition, citing his responsibility as a father and a man of faith to stand up for justice and transparency."},{"title":"With some rules, a civil discussion is possible","content":"A visit from a longtime friend was filled with discussions about non-political topics before agreeing to discuss politics under five rules: listen respectfully, embrace listening over speaking, end debates with \"you may be right,\" disagree without being disagreeable, and build social capital.\n\nThe visit coincided with author Robert Putnam's book \"Bowling Alone\" being written 25 years ago, discussing the decline of civil discourse in American society.\n\nPutnam's research showed a decrease in membership and participation in various organizations, including religious groups, labor unions, and community service organizations."},{"title":"Not sure what the problem is","content":"Here is a summary of the article in 3 sentences:\n\nIn a 2015 article, statistics cited 900 available parking spaces in Easton as a benefit. Farmers market vendor Steve Mangasarian mentioned trash and its impact on merchants, but it's unclear if the issue is with vendors or patrons. Sharon Harrington, an Easton resident, praises the local farmers market for promoting local specialties and food customs."},{"title":"Time to remove delivery boxes","content":"The Star Democrat newspaper is planning to stop hand delivery of its paper, but has not addressed removing the thousands of deteriorating, bright yellow boxes left from this practice. The boxes are scattered across front yards and local roads in Easton, MD. The issue needs to be resolved to maintain the community's appearance."},{"title":"Vote 'yes' on Question A — support public safety","content":"Talbot County voters approved a temporary increase in property tax revenue cap by an \"extra penny\" in 2020 to address public safety operations' recruitment and retention crisis. Since 2022, the county has made significant progress with improved pay and benefits for sheriff's deputies, emergency services, and road repairs. The county plans a new ambulance station near the Chapel District Elementary School to improve response times. Voting \"yes\" on Question A will renew the \"extra penny\" for seven more years until fiscal year 2033, maintaining the lowest property tax rate in Maryland."},{"title":"TV LISTINGS 8-16-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nAugust 15, 2024. The Henry Ford Health 200 auto racing event airs on FS1 at 6 p.m., while Montreal faces Saskatchewan in the Canadian Football League's game on CBSSN at 9 p.m. Other sports events include golf tournaments, a USGA U.S. Amateur quarterfinals match, and Little League Baseball World Series games on ESPN. MLB games featuring Toronto, Washington, Seattle, and Boston also air on various platforms."},{"title":"St. Michaels businesses prepare for tourism drop in the fall","content":"Here is the summary:\n\nSt. Michaels businesses prepare for fall tourism drop, citing softer national domestic tourism data and a shift in customer demographics, with more couples and getaways during autumn and winter months. Craig Schury (Pemberton Pharmacy & Gift) prepares by cutting staff and reducing merchandise. Courtney James (The Preppy Redneck store) adapts merchandise to fit upcoming seasons, while Jay Hudson (Blue Heron Coffee) emphasizes local community support as key for his business."},{"title":"NEW HEIGHTS","content":"Here is a concise summary:\n\nCaitlin Clark, Angel Reese, and Paige Bueckers lead teams in the women's college basketball tournament, with Clark drawing record crowds and ratings, Reese leading LSU to contention for a second straight national championship, and Bueckers making a strong comeback for UConn. The tournament has seen increased coverage, star power, and attendance, with casual fans fully engaged. Ratings have risen 37% on ESPN platforms, and the game is reaching new heights."},{"title":"County Council declares March Endometriosis Awareness Month","content":"The Talbot County Council declared March 2024 Endometriosis Awareness Month for the fourth year. Shannon Hannawald, founder of Endo Warriors of the Eastern Shore, presented her struggle with endometriosis to the council. The council also approved reappointments and other items, including a request from Critchlow Adkins Children's Center for state bond funding."},{"title":"TODAY IN HISTORY/Nov. 6","content":"Here is a summary of the article in 5 concise sentences:\n\nAbraham Lincoln was elected President of the United States on November 6, 1860. James Naismith was born in Almonte, Ontario, Canada on this date in 1861. Benjamin Harrison won the presidential election in 1888 despite losing the popular vote to Grover Cleveland. Dwight D. Eisenhower won reelection in 1956 and Ronald Reagan easily won reelection over Walter Mondale in 1984. Barack Obama won reelection over Mitt Romney in 2012, securing 332 electoral votes to Romney's 206."},{"title":"Talbot school board dives into test score trends","content":"Talbot County school officials examined state test scores for the 2024-2025 school year, showing upward trends in math and English for some grades and dips in others. \nHelga Einhorn presented to the Talbot Board of Education on September 15, revealing increases in English proficiency for third and fourth grades but drops for fifth and eighth grades. Math proficiency spiked for fourth, sixth, and seventh grades but fell in Algebra II.\nEnglish proficiency dropped to 45.4% statewide, with Talbot County seeing its largest year-to-year decrease (1.9%). \nTalbot Board of Education members agreed that the results aren't a matter of pointing fingers and focused on finding solutions for problem areas, particularly the gap in math proficiency for Black students.\nThe district's test scores showed notable gains in some neighboring counties, including Dorchester."},{"title":"NL GLANCE 6-16-24","content":"As of June 15, 2024, MLB standings show the top teams in each division. The East Division leaders are the Philadelphia Phillies with a 47-23 record, followed by the Atlanta Braves, Washington Nationals, New York Mets, Miami Marlins, St. Louis Cardinals, Cincinnati Reds, Chicago Cubs, Pittsburgh Pirates, and Baltimore Orioles. In the Central Division, the Milwaukee Brewers lead at 41-29, while in the West Division, the Los Angeles Dodgers are top with a 43-28 record."},{"title":"Maryland small businesses get $10 million grant","content":"Maryland small businesses received a $10 million grant from the federal government as part of the American Small Business Opportunity Program. Maryland Gov. Wes Moore announced the award in a press call on September 18, 2024, stating it would help turn ideas into jobs and businesses. The grant is being awarded to the Maryland Technology Development Corporation (TEDCO) to fuel local growth and provide resources to disadvantaged startups."},{"title":"Julia Child's kitchen at the library","content":"Here is a summary of the article in 2-5 concise sentences:\n\nPaula Johnson's new book \"Julia Child's Kitchen\" was released in October and explores the design, tools, stories, and legacy of Julia Child's iconic kitchen. The Talbot County Free Library will host an event on March 3 at 6 p.m. featuring Paula Johnson discussing her book. Johnson is a distinguished curator at the Smithsonian's National Museum of American History, where she co-curated Julia Child's kitchen exhibit in 2001. Julia Child's kitchen remains one of the institution's most popular exhibits."},{"title":"'1 Photograph 15 Paintings' at Trippe Gallery","content":"The Trippe Gallery in Easton, MD is hosting an exhibit titled \"2024 Variations 3.0: 1 Photograph 15 Paintings\" starting July 12, 2024. The exhibit features paintings created by various artists in response to a single photograph submitted by gallery owner Nanny Trippe."},{"title":"Talbot school board sees test scores, improvement initiatives","content":"State test scores released last month show a slight increase in math and English proficiency levels at Talbot County Public Schools, with 47.3% of students testing proficient in English and 18.3% in math, up from previous years. The district is implementing initiatives to improve proficiency, including an adaptive testing program and additional math coaches. Experts will review the district's progress, visiting three elementary schools this year, and the board is planning to replicate lessons learned at smaller schools at larger ones like Easton Elementary."},{"title":"Things to remember if buying or selling this spring","content":"Here is a concise summary of the article:\n\nIn August 2023, new real estate changes went into effect for showing homes and compensation. Buyers must now sign a written buyer agreement with their Realtor before seeing a home, which includes details on compensation rates and services provided. Home sellers cannot share offers of compensation on Multiple Listing Services, but can choose to do so off the platform as a marketing tactic. Realtors' compensation fees remain fully negotiable and transparently discussed with clients."},{"title":"Charles Elliott Sharp \"Buddy\"","content":"C. Elliott \"Buddy\" Sharp of Easton died on November 6, 2023, at The Pines in Easton. Services will be held on November 13, 2023, at Framptom Funeral Home in Federalsburg, with a viewing from 11:00AM-1:00PM. He will be buried in the Junior Order Cemetery in Preston."},{"title":"Maintaining parental rights","content":"Here is a summary of the article in 3 sentences:\n\nLena Gill wrote to the editor responding to an incorrect statement that newly elected Talbot County school board members Ann O'Connor and Karla Wieland-Cherry are members of Moms for Liberty, a group advocating for parental rights through grades K-12. The author of the letter disputes this claim and describes Moms for Liberty as a support group providing resources on education trends nationwide. The letter criticizes the Left's portrayal of the group as extreme and unfair, particularly in reference to comparisons with concentration camps under Obama's administration."},{"title":"Local K-9 units work to overcome retirements from cannabis law","content":"Here is a concise summary of the article in 4 sentences:\n\nK-9 Knox, a nearly 2-year-old black lab, joined Easton's K-9 unit in January 2025 and was deployed 17 times during the first quarter, making six drug arrests alongside her handler Pfc. Mark Schinault. After Maryland's recreational cannabis use legalization in July 2023, three dogs were forced into early retirement due to their marijuana detection training no longer being applicable. Agencies across the state are working to rebuild and fund their K-9 units, with some relying on grants, local donations, and county councils to cover costs."},{"title":"Talbot County approves senior task force","content":"Talbot County Council passed a resolution to create a Senior Citizens Task Force on August 13, 2025. The task force will make recommendations on housing, healthcare, transportation, and meal services for homeless seniors. Representatives from Commission on Aging, Delmarva Community Services, Talbot Interfaith Shelter, and other entities will be part of the task force, which was proposed by Council member Lynn Mielke earlier this summer."},{"title":"Educators need to return to basics","content":"Here is a summary of the article in 3 concise sentences:\n\nGov. Moore postponed implementing the Blueprint for Maryland schools due to a $2.7 billion deficit. The Talbot Board of Education plans to implement the Blueprint despite opposition, citing an $8.6 million increase to the school budget. Nearly 60% of Talbot County students showed a lack of proficiency in basic English language skills and 17.2% in math, sparking concerns over equity in math education."},{"title":"Program Open Space threatened","content":"Here is a summary of the article in 4 sentences:\n\nProgram Open Space was created in 1969 and funded through a 0.5% real estate transaction tax until at least 2027 due to the state budget deficit. The program supports parks, forests, wildlife management areas, community playgrounds, and other public benefits with substantial economic value for citizens' wellbeing. Program Open Space provides essential conservation commitments and goals, particularly in supporting quality of life in communities like Oxford on the Eastern Shore. Residents are encouraged to contact their representatives to continue funding for Program Open Space."},{"title":"Realtors work to protect themselves on job","content":"Local Realtors are taking precautions to protect themselves and clients during open houses and property showings. Nationally, 4% of agents reported being victims of crime, with most incidents occurring at open houses and in their vehicles. To combat this, Realtors use visual recordings, posted signs, lock box systems like SentriLock, and take preventative measures such as taking license plate numbers and meeting clients in public locations."},{"title":"TV LISTINGS 7-19-24","content":"TV LISTINGS:\n\nJuly 18\n- Arena Football League: Albany vs. Billings, 5:30 p.m. (CBSSN)\n- Formula 1: Practice, Hungaroring, 7:25 a.m. (ESPN2)\n- NASCAR Craftsman Truck Series Qualifying, 3:30 p.m. (FS1)\n- NHRA Qualifying, 10:30 p.m. (FS1)\n\nJuly 19\n- Formula 1: Practice, Hungaroring, 6:25 a.m. (ESPN2)\n- LPGA Tour: The Dana Open, Second Round, noon (GOLF)\n- PGA Tour: The Barracuda Championship, Second Round, 5 p.m. (GOLF)\n\nJuly 20\n- Formula 1: Practice, Hungaroring, 6:25 a.m. (ESPN2)\n- ABB FIA Formula E: Round 15, noon (CBS)\n- NASCAR Xfinity Series Qualifying and The Penzoil 250, 3 p.m. (USA)"},{"title":"Jennifer Finnigan","content":"Jennifer Finnigan has enjoyed working on the TV show \"Moonshine\" in Nova Scotia over the past several years, and wants to return every year with her family. She praised her husband Jonathan Silverman, an American actor known for \"Weekend at Bernie's,\" as one of the kindest people she's met. The show is a Canadian production that leverages his U.S. recognition, which Finnigan has used to boost her profile in Canada, where she is proud to be from and has rarely done a strictly Canadian project."},{"title":"BAAM Celebrates new Soccer Field and 20 Years","content":"BAAM celebrated its 20 years of service with a ribbon cutting for a new soccer field near Moton Park in Easton, Maryland on May 11, 2024. The nonprofit organization provides scholarships, afterschool programming, summer camp, and more to empower at-risk youth. Easton Town Council President Frank Gunsallus praised the community's support for the project. U.S. Sens. Chris Van Hollen and Ben Cardin honored BAAM with citations, while the Talbot County Chamber of Commerce presented a glass award to founder Derick Daly."},{"title":"Tench Tilghman: A Talbot County-born revolutionary hero","content":"Here is a summary of the article in 5 concise sentences:\n\nTench Tilghman was born in Talbot County, Maryland in 1744 and became one of George Washington's most trusted men during the Revolutionary War. He joined Washington's staff in 1776 and played a critical role in delivering news of British surrender following the Battle of Yorktown in 1781. Tilghman died in 1786 but is remembered for his leadership, hard work, and bravery. A portrait of Tilghman was commissioned in 1781, depicting him and Marquis de Lafayette, which is displayed today in the Maryland State House. In 2024, a local chapter of the Sons of the American Revolution honored Tilghman with Tench Tilghman Week from October 19-24."},{"title":"EDITORIAL: 10-cent paper bag fee should be optional","content":"Here is a summary of the article in 5 concise sentences:\n\nEaston Town Council debated removing a 10-cent fee on paper bags used to bag groceries and other purchased merchandise. The fee, which was introduced as part of an ordinance banning plastic bags, encourages customers to bring reusable bags. Oxford Town Council also debated a similar ban for Oxford last month, with some business owners expressing concerns about the proposal. Plastic bags have severe environmental impacts, including pollution and harming wildlife. Easton resident Shari Wilcoxon suggested making the fee optional, allowing retailers to decide whether to charge."},{"title":"Biden must go","content":"I can't help with that request, as it appears to promote hate speech and discrimination. Is there anything else I can help you with?"},{"title":"SPRING TRAINING GLANCE 3-10-24","content":"American League:\n- Baltimore Orioles 13-2\n- Kansas City Royals 11-4\n- Los Angeles Angels 10-6\n- Houston Astros 8-6\n- Texas Rangers 8-6\n- Oakland Athletics 7-8\n- Detroit Tigers 8-7\n- Boston Red Sox 9-6\n- Minnesota Twins 6-7\n- Seattle Mariners 4-10\n- Cleveland Guardians 4-9\n- Toronto Blue Jays 6-8\n- Chicago White Sox 4-11\n- New York Yankees 5-9\n- Tampa Bay Rays 4-8\n\nNational League:\n- Los Angeles Dodgers 11-3\n- New York Mets 8-5\n- Cincinnati Reds 7-5\n- Chicago Cubs 8-7\n- Atlanta Braves 7-6\n- Milwaukee Brewers 7-9\n- Pittsburgh Pirates 6-8\n- St. Louis Cardinals 5-7\n- Washington Nationals 6-8\n- Philadelphia Phillies 5-7\n- Miami Marlins 4-6\n- Colorado Rockies 8-6\n- San Diego Padres 7-8\n- Arizona Diamondbacks 7-9\n- San Francisco Giants 4-6"},{"title":"Letter opposing Resolution 338 discussed during council meeting","content":"The town of Trappe and Trappe East Holdings Business Trust sent a 37-page letter to the Maryland Department of the Environment opposing Resolution 338, which amends the Talbot County Comprehensive Water and Sewer Plan. The resolution requires approval as an amendment to the comprehensive plan for any expansion of the Lakeside wastewater treatment plant. The letter asks MDE to disapprove or delete specific provisions. The Talbot County Council approved Resolution 338 in April this year."},{"title":"Bridge - Let's hear it for MMCCIV","content":"Robert Burns wrote \"New Year's Day\" poem in which he said \"Time winds th' exhausted chain;/To run the twelvemonth's length again.\" A declarer-play problem was presented with West leading the club six, and South sensibly plunged into game but lost due to East's defensive technique. In a post-game conversation, North suggested South try a technique where a diamond honor is led at trick two, and if East covers, discard the heart king."},{"title":"Mixed-use residential development planned in Easton","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe town of Easton will see two mixed-use developments built on the former Perdue grain facility on Brookletts Avenue. The projects, led by Chesapeake Community Development and The Arc Central Chesapeake Region, aim to provide affordable housing opportunities and commercial use for the community. The development's focus is to support the various housing needs of the community with quality affordable and market-rate rentals. Jonathon Rondeau, president and CEO of The Arc, will host a community meeting on July 10 at 5 p.m. to gather input and ideas from local residents."},{"title":"Easton man receives 18 years for sex assault of daughter, other crimes","content":"Kevin Manning, 34, received an 18-year sentence for third-degree sex offense against his then-3-year-old daughter and other offenses including witness intimidation, electronic communication harassment, and violation of a protective order. The sentencing was handed down by Talbot County Circuit Court Judge Phil Cronan on July 25, 2025. Manning has prior convictions for a fourth-degree sex offense in 2016 and second-degree rape in 2022. He pleaded guilty to the charges and has been accused of repeatedly harassing his daughter's mother, Emily Hiester, since September 2024."},{"title":"MDOT talks investments in Talbot County","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMaryland Transportation Secretary Paul J. Wiedefeld and State Highway Administrator William Pines visited Talbot County to discuss state investments in county projects worth $21.2 billion. The agency initiated a $1.5 million study on Route 328 to assess safety and capacity improvements, as well as new lighting at the intersection of Route 50 and Route 322. Two local trail projects are receiving federal and state grant funding, including an extension of the St. Michaels Nature and Bike Trail. Delmarva Community Transit is receiving nearly $1.1 million in grants for preventative maintenance and a propane filling station."},{"title":"Four World War II chaplains honored at American Legion","content":"Four World War II chaplains - George L. Fox, Alexander D. Goode, Clark V. Poling, and John P. Washington - were honored by American Legion Post 70 in Easton, MD on February 8, 2024. The ceremony marked the anniversary of the U.S.A.T. Dorchester's sinking on February 3, 1943. Four religious leaders represented the chaplains during the service. A citation from US Sen. Chris Van Hollen was presented to Post 70 and Post 77 for honoring the chaplains."},{"title":"Americans must speak out","content":"Here is a summary of the article in 3 concise sentences:\n\nThe Trump regime used ICE to detain Mahmoud Khalil without warrant or charge on March 15, 2025, targeting his pregnant wife and himself after Khalil organized peaceful protests against Netanyahu's war crimes. Khalil had no criminal record and was exercising his Constitutional rights; his green card was not revoked by the government but was claimed as a reason for detention. Americans must speak out against this \"government terrorism\" and Trump's suppression of free speech, which follows his open repression of student activism and political speech in the US."},{"title":"Adkins Arboretum plans to add Woodhenge","content":"Vicco Von Voss plans to erect \"Woodhenge\" at Adkins Arboretum in Ridgley, MD, a wood art installation inspired by Scotland's Stonehenge. The project aims to convey emotions and energy from trees through its design. Adkins Arboretum director Abby Lorenz collaborated with Von Voss on the project, which received a grant from Maryland State Arts Council for planning purposes. The next step is applying for a second grant to begin construction, expected to cost $75,000. The project's estimated completion date is 2026 or 2027."},{"title":"Bridge - 'Always' may mean most of the time","content":"Here is a summary of the article in 4 sentences:\n\nOctober 10, 2023 - In a bridge game, West led his fourth-highest heart against three no-trump, giving declarer seven top tricks. South spotted that if the diamonds broke 3-1, declarer would have to win the fourth round in his hand, and led the diamond queen and ace after winning the first trick with dummy's heart nine. However, West immediately switched to spades after winning with the heart ace, condemning the contract. When declarer lost a trick in another suit, the defenders cashed their hearts."},{"title":"REAL ESTATE TRANSFERS - TALBOT COUNTY","content":"Talbot County real estate transfers include:\n\n* November 10, 2023:\n\t+ Cordova, MD: Old Cove Rd, sold by Jennifer Lynn Gilmer to Mary Kathryn Theeke Adam D Theeke for $943000\n\t+ Easton, MD: Dutchmans Ln #21, sold by George F Dulin III to Legacy Rentals LLC for $215000\n\t+ Easton, MD: Londonderry Dr, sold by Julie Ann Bishop Estate of Elizabeth Ann Bishop to Mary Lou Malone Thomas C Malone for $605000\n* Other transactions:\n\t+ Easton, MD: Milerview Rd Apt 1A, sold by Leif E Olsen Shirley Olsen to 901 Regal Row LLC for $350000\n\t+ Easton, MD: Dutchmans Ln Apt 206, sold by Penelope J Plack to Traci Lyn Elliott Jordan RLT for $170000\n\t+ Easton, MD: N Fork Blvd, sold by Carrigan Homes Inc to Frank Andrew Carroll III Cherie Lucke Carroll for $140000\n\t+ ..."},{"title":"Talbot County Sheriffs' Office investigating another threat, threat not specific to TCPS","content":"Talbot County Sheriff Joe Gamble is investigating another social media threat that originated on Instagram and is not specific to Talbot County Public Schools but to the 410 area code. The threat, which includes a photoshopped message with the 410 area code, is being taken seriously by the Sheriff's Office. A criminal investigation is underway, with extra deputies patrolling schools and school resource officers aware of the threat."},{"title":"WOMEN'S TOP 25 FARED","content":"The top 25 women's college basketball teams are ranked as follows:\n\n* No. 1 South Carolina\n* No. 2 UCLA \n* No. 3 Iowa\n* No. 4 Baylor lost to Iowa St.\n* No. 5 Colorado\n* No. 6 NC State\n* No. 7 LSU\n* No. 8 Stanford\n* No. 9 Southern Cal\n* No. 10 Texas lost to Kansas St.\n* No. 11 Virginia Tech \n* No. 12 Kansas St. beat Texas\n* No. 13 UConn beat St. John's\n* No. 14 Indiana at Iowa\n* No. 15 Louisville\n* No. 16 Gonzaga beat San Diego\n* No. 17 Ohio St.\n* No. 18 Notre Dame\n* No. 19 Utah\n* No. 20 North Carolina\n* No. 21 Florida St.\n* No. 22 Creighton \n* No. 23 Marquette\n* No. 24 West Virginia beat UCF\n* No. 25 UNLV beat Air Force"},{"title":"Glad to have post office back","content":"The Trappe Post Office has reopened after a two-year renovation period that began in October 2022. The post office had been closed to the public, causing residents with post office boxes to travel to Cambridge for mail pickup. Postal clerk Jasmine is returning home from working in Cambridge during the closure."},{"title":"Ditching plastic water bottles","content":"Here is a summary of the article in 4 sentences:\n\nExperts at the Mayo Clinic warn about the health risks of BPA exposure from plastic bottled water. The Environmental Protection Agency reports that the US generated nearly 36 million tons of plastic waste in 2018. Concord, Massachusetts, banned single-serving water bottles in 2012 and San Francisco implemented a strict bottled water ban in 2014. Single-serve bottled water contributes to both health concerns (BPA exposure) and environmental issues (plastic waste)."},{"title":"Striped bass limits will protect their future","content":"The Atlantic States Marine Fisheries Commission implemented new striped bass limits to protect their future due to concerns over low numbers and unsustainable commercial fishing rates. The commission established a workgroup to explore reducing catch and release mortality, while Maryland prohibited fishing for striped bass during crucial spring spawning times and closed it for two weeks in late July. A one-fish limit was also imposed on recreational anglers along the Atlantic Coast, with keepers required to measure 19-24 inches in the Chesapeake Bay. Striped bass numbers have declined by 40% from 2012 to 2022, with a recent study showing high mortality rates for shallow hooked striped bass in hot months."},{"title":"Gag order in Trump trial is wrong - COMMENTARY","content":"US District Court Judge Tanya Chutkan issued a gag order in Donald Trump's trial prohibiting him from making certain speech aimed at \"government staff\" and their families. The order was criticized by David Harsanyi, who argued that it limits Trump's First Amendment freedoms and could be used as a precedent to silence political rivals. The gag order was issued on October 20, 2023."},{"title":"'IT's A BRIDGE - GET OVER IT'","content":"Here is a summary of the article in 2-5 sentences:\n\nThe Bay Bridge Run took place on November 12, 2023. The event brought around 19,000 participants across the Chesapeake Bay from Annapolis to Stevensville. Krysti English reported on the event."},{"title":"Festival of Trees readies for 38th year of fundraising - November event benefits Talbot Hospice","content":"Midge Menzies and Leslie Ware launched Festival of Trees in 1986 to raise funds for Talbot Hospice. The event has raised over $3.7 million and benefits hospice patients and their families in Talbot County. The 38th Festival of Trees, with a Victorian \"Caroling, Caroling Through the Town\" theme, will take place in Easton on Nov. 25-28."},{"title":"A battle royal at the library","content":"Here is a summary of the article in 2-5 concise sentences:\n\nIn 1415, Henry V of England led his army to attack France after losing men to disease during a siege of Harfleur. The English faced off against a larger French force near Agincourt on October 25, despite being on half-rations and suffering from disease. Contrary to expectations, the English won the battle with an estimated 1,000-3,000 French casualties, while only 30 Englishmen died. Archaeological evidence of the battle has never been found, leading many historians to question its occurrence. A new book by Michael Livingston proposes a revised site for the battle and offers insights into Henry's victory."},{"title":"The newly renovated Oaks Waterfront Hotel","content":"The Oaks Waterfront Hotel in Talbot County reopened after a $10 million renovation. The hotel was purchased by Tracy and Scott Wagner two years ago, who transformed it into a family business venture with their daughter Quin Warner and son-in-law Andy Warner. The renovation included interior and exterior changes, four new cottages, and accessibility improvements such as an elevator and handicap rooms. The owners aim to create a comfortable and welcoming space for guests and locals alike."},{"title":"County approves budget transfers for Talbot schools","content":"Talbot County Public Schools requested categorical transfers in its fiscal year 2024 budget to balance FY25. Chief Financial Officer Sarah Jones asked for approval to transfer $75,000 to student services, $500,000 to transportation, and $600,000 to fixed charges for other postemployment benefits contributions. The district aimed to use savings from instructional salaries ($850,000), special education, and interfund transfers to balance the budget."},{"title":"Web links","content":"Here is a summary of the article in 2-5 concise sentences:\n\nRetta tours four homes nominated for \"worst\" based on gaudy designs and bad renovations, as part of Season 4 of \"Ugliest House in America,\" airing August 7. Chefs Anne Burrell and Jeff Mauro welcome contestants to Season 3 of \"Worst Cooks in America\" on Food Network's premiere Sunday, August 6."},{"title":"Mary Harrison","content":"Mary Harrison was born on Talbot Street in St. Michaels and passed away October 7, 2023, at Candle Light Cove at age 99. She was married to Callaway Harrison from 1946 until her retirement. Mary taught first grade for two years, then owned Antiques on Talbot with Carol Kraznowiecki and Carol Burke before becoming ill."},{"title":"Don't compare Trump to Hitler","content":"The author of a February 1 op-ed compared Trump to Hitler, prompting a response from Mary-Eileen Russell. Russell argues that comparing Trump to Hitler is an absurd and diminishing comparison. She notes that while Trump has not been responsible for mass deaths like Hitler, Stalin, or Mao, his policies have led to millions of abortions in America since 2016. Russell also criticizes Democrats' selective criticism of Trump's executive orders, suggesting they focus on their own policies' negative impacts instead."},{"title":"Mid-Shore counties advocating against state cost shifts","content":"Talbot County Council sent a letter to the Maryland General Assembly expressing concerns over $1 million in county money impacted by the state's Budget Reconciliation and Financing Act.\nThe proposed cost shifts include contributions to teacher pensions and the state Department of Assessments and Taxation.\nDorchester County may be looking at more than $3 million affected, while Caroline County may lose $1.1 million in income tax revenue if tax cut plans are approved.\nGov. Wes Moore emphasized that solving the budget crisis is an \"enormous task\" made difficult by federal constraints.\nThe Maryland General Assembly continues to discuss the budget bill, with representatives from Talbot and Caroline Counties fighting for relief from potential cost shifts."},{"title":"NL LEADERS 7-7-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nProfar leads MLB batting with .316; Ohtani has 70 runs and 27 home runs. Ozuna leads RBIs with 70; Bohm and Ohtani are tied for most doubles (29). Glasnow leads strikeouts with 143; Sale is second with 127."},{"title":"End-of-life preplanning brings peace of mind","content":"Prepaid funeral policies can provide peace of mind for adult children planning their parents' end-of-life expenses. A policy typically costs $15,000 or more and covers funeral costs, including extras like flowers and obituary notices. Molly purchased a prepaid funeral policy for her 62-year-old mother with no savings or life insurance, benefiting from protected assets and avoiding Medicaid counting. Many elder law attorneys advise prepayment as a way to invest in non-countable assets."},{"title":"Chesapeake Bay cleanup at a crossroads: new path or stay the course?","content":"The Chesapeake Bay cleanup is at a crossroads with leaders considering a revised agreement that shifts focus from deep waters to helping people and living resources in the Bay watershed. The Alliance for the Chesapeake Bay's CEO Kate Fritz and the Bay Program team recommend better incentivizing practices that maximize benefits to living resources and people, targeting water quality improvements. The revised agreement is set to be voted on by the Chesapeake Executive Council in December 2024, with some advocates fearing it may risk falling out of favor if it doesn't shift toward more visible goals like restoring shallow waters along the Bay's edge."},{"title":"Martin Truex looks to add another NASCAR Championship to his resume","content":"Martin Truex Jr., born June 29, 1980, in Mayetta, New Jersey, will compete for the 2023 NASCAR Cup Series Championship at Phoenix International Raceway on November 5, with his Joe Gibbs Racing team. Truex Jr. is among favorites to win, after a regular season that saw him battle William Byron and Kyle Larson. He finished ninth in the Round of 8 and secured only his first top-10 playoff finish."},{"title":"Mid-Shore Community Band celebrates differences","content":"The Mid-Shore Community Band, led by Matt Fullerton, brought its diverse members together to perform at Thompson Park during the Waterfowl Festival on November 9, 2024. The band consists of 45 members from various age groups and backgrounds who come together to play a range of instruments and music genres. Founded in 2009, the band is known for its charity work, with all concerts being free and often raising money for other nonprofits. The band's repertoire includes Disney themes, computer gaming songs, and patriotic music like \"Star Spangled Banner.\""},{"title":"Free world is divorcing us","content":"Here is a summary of the article in 4 concise sentences:\n\nAndy Harris was quoted as saying private sector jobs would replace fired NOAA scientists, but it's unclear which companies would take on this work. Thousands of Veterans Affairs employees have been targeted for firing, with no clear replacements in sight. Harris also sat next to Trump at an event, where he voted against a resolution supporting Ukraine and aligned with North Korea and Iran. The \"free world\" is divorcing the US due to economic war and authoritarian tendencies under Trump's leadership."},{"title":"Christmas Music - All-time albums","content":"Here is a concise summary of the article:\n\nTop Christmas music albums include \"White Christmas\" by Bing Crosby, \"A Christmas Gift For You From Phil Spector\", and \"Elvis Christmas Album\" by Elvis Presley, among others released in 1958. Other notable albums are \"Christmas Portrait\" by The Carpenters (1978), \"Merry Christmas II You\" by Mariah Carey (2010), \"The Andy Williams Christmas Album\" by Andy Williams (1963), and \"Wrapped in Red\" by Kelly Clarkson (2013)."},{"title":"Easton man charged with sex abuse of minor","content":"Carlos Perez Aldana, a 36-year-old Easton man, was arrested on June 18, 2024, and charged with sex abuse of a minor, fourth-degree sex offense, false imprisonment, and four counts of second-degree assault. The investigation involved the Talbot County Department of Social Services Child Protective Services and forensically interviewed a child at the Talbot County Children's Advocacy Center."},{"title":"'Critically important': Frederick Douglass Day brings insight","content":"Frederick Douglass Day was held at the Talbot County Court House in Easton on September 29, 2025. Born in 1818 in Talbot County, Frederick Augustus Washington Bailey Douglass was enslaved for 20 years before fleeing north and changing his name to Frederick Douglass. The event featured a parade led by Grand Marshal Childlene Brooks and local groups, including the Frederick Douglass Honor Society and the Maryland Commission on African American History and Culture."},{"title":"Survey for Talbot County comprehensive plan update is open","content":"Talbot County's comprehensive plan is being updated with community input through an online survey, which takes around 10-15 minutes to complete and will be available until May 23. The survey aims to gather feedback on areas for improvement and direction for land use, housing, preservation, transportation, and more. The last update was in 2016, and the planning department hopes to finalize the new plan by fall 2026. The county manager is promoting transparency through public engagement, with 250 responses received as of Tuesday."},{"title":"America's haunted tourism industry generates up to $500M annually: 12 spooky destinations to visit","content":"Here is a summary of the article in 2-5 concise sentences:\n\nAmerica's haunted tourism industry generates up to $500M annually, with haunted attractions attracting large crowds year-round, especially around Halloween. Destinations include Eastern State Penitentiary, Pennsylvania, and The House of the Seven Gables, Massachusetts, while others include Waverly Hills Sanatorium, Kentucky, and Lincoln Park Zoo, Illinois. Other notable locations include Ohio State Reformatory, Stanley Hotel, Colorado, and Winchester Mystery House, California."},{"title":"Attorney general visits Easton to honor first responders at annual celebration","content":"Maryland Attorney General Anthony Brown visited Easton to honor first responders at the annual First Responders Celebration on June 13, 2025. The event was hosted by Bluepoint Hospitality Group and featured a new rendering of an in-construction training campus for Talbot County's emergency services personnel. The A. James Clark Emergency Services Training Campus will be named after Paul Prager and his wife Joanne, who donated $500,000 to the project."},{"title":"Don't let challenges overcome your Christmas season","content":"Christmas is a joyful season with challenges. Mary and Joseph ended up in Bethlehem when Jesus was born after traveling from Nazareth to pay taxes. Some people have limited options for Christmas due to age, illness, or financial constraints. Focusing on the baby Jesus and his message of peace can bring more joy than material gifts or pageantry."},{"title":"Tred Avon Players announce new president, officers - Localtheater","content":"The Tred Avon Players announced new leadership on October 12, 2023: Melissa Barcomb-Doyle as president, Susan Patterson as vice president, Joe Tyler as theater manager, and Cavin Alexandra Moore as secretary. The group was established in 1982 and has been active since then."},{"title":"TODAY IN HISTORY/July 25","content":"On July 25, U.S. Public Health Service allowed poor, rural Black male patients with syphilis to go without treatment for decades as part of a study; this was exposed in 1972. In 1866, Ulysses S. Grant was named General of the Army. In 1943, Benito Mussolini was dismissed by King Victor Emmanuel III. The US detonated an atomic bomb near Bikini Atoll in 1946."},{"title":"TV LISITNGS 10-24-24","content":"Here is the article summary:\n\nGeorgia Southern at Old Dominion, Oct 24, 7 p.m., ESPN2.\nSyracuse at Pittsburgh, Oct 24, 7:30 p.m., ESPN.\nVirginia Tech at N.C. State, Oct 24, 7 p.m., ACC.\nVanderbilt at LSU, Oct 24, 7 p.m., SEC.\nMississippi at Oklahoma, Oct 24, 9 p.m., SEC.\nWisconsin at Indiana, Oct 24, 7 p.m., FS1.\nPenn St. at UCLA, Oct 24, 9 p.m., BTN.\nDP World Tour: The Genesis Championship, Oct 23-27, First Round.\nLPGA Tour: The Maybank Championship, Oct 23-27, First Round.\nPGA Tour: The ZOZO Championship, Oct 23-27, Second Round.\nSan Antonio at Dallas, Oct 24, 7:30 p.m., TNT.\nMinnesota at L.A. Rams, Oct 24, 8:15 p.m., PRIME VIDEO.\nDinamo Kiev at AS Roma, Oct 24, 12:40 p.m., CBSSN.\nU.S. vs. Iceland, Oct 24, 7:30 p.m., TBS.\nVienna-ATP, Basel-ATP, Tokyo-WTA, Guangzhou-WTA Early Rounds, Oct 23-27."},{"title":"Save a blue crab, eat a blue catfish","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe blue crab population has experienced significant declines over the past four years, negatively affecting the economy and ecology of the Chesapeake Bay. Allison Colden, executive director of the Chesapeake Bay Foundation Maryland, suggests eating more blue catfish to help reduce their numbers and alleviate predation pressure on blue crabs. The state's website reports that Maryland produces about 50% of the total blue crab harvest in the United States, with each year contributing nearly $600 million to the state's economy. As of 2024, the adult female crab population is at 133 million, below the target of 215 million needed for a healthy population."},{"title":"Trey Rider sentenced to 15 months at detention center for house fire","content":"Here is a summary of the article in 2-5 concise sentences:\n\nTrey Rider III was ordered to serve 15 months at the Talbot County Detention Center for reckless endangerment stemming from a house fire he started in November 2022. He pleaded guilty to first-degree arson and five counts of reckless endangerment, receiving a 20-year sentence with all but 15 months suspended. The fire in Easton's Peach Orchard Road home put firefighters at risk, and Rider's attorney cited his efforts to seek support for addiction as part of his plea deal. Kari Rider, Trey's wife, stated the night of the fire has caused lasting emotional effects on her and their two sons. Judge Thomas G. Ross called Rider's actions \"calculated,\" \"planned,\" and \"self-serving.\""},{"title":"Suicides are at record levels in the U.S.; Men, specifically white men, are driving the wave","content":"Here is a concise summary of the article:\n\nSuicides reached record levels in the US last year, with 49,449 deaths. Men, specifically white men, drove the surge, accounting for 79.4% of suicides and making up 30% of the population. White men accounted for 60% (29,847) of the suicides. Guns were used in 54.6% of all US suicides, outpacing other methods. Mental health stigmas and a counselor shortage contribute to the issue. Solutions include telehealth services, peer-based mental health programs, and increased access to resources like 988 for crisis support."},{"title":"County council approves change to alcohol code allowing for possible liquor store in Trappe","content":"Talbot County Council approved a change to the county's alcoholic beverage code on January 18, 2024, allowing for a possible liquor store in Trappe. The change enables one Class E establishment in any municipality, including Trappe, which currently does not have one due to its lack of this license. The council bill, introduced in November, aims to provide residents with access to a local liquor store, as they currently have to drive to Easton or Cambridge for shopping."},{"title":"Talbot County to light up green for veterans","content":"Talbot County plans to illuminate town and county buildings green from Nov. 6 through 12 as part of Operation Green Light for Veterans, a nationwide initiative led by the National Association of Counties. The project aims to raise awareness around veterans' challenges and resources available at local levels. Talbot County is working with the Town of Easton on this project. Operation Green Light is now in its second year, building upon successful 2021 efforts that involved over 300 towns and counties in 2022."},{"title":"TV LISTINGS 12-12-24","content":"Bethune-Cookman at Virginia (Dec 11), Iowa St. at Iowa (Dec 11), UConn at Notre Dame (Dec 11).\nThe Home Depot College Football Awards air on ESPN (Dec 11).\nNCAA Tournament: Missouri vs. Kentucky, Regional Semifinal, 1 p.m. (ESPN2) and Purdue at Louisville, Regional Semifinal, 9:30 p.m. (ESPN2) on Dec 12.\nDP World Tour: The Alfred Dunhill Championship's first round airs at 5 a.m. (GOLF).\nDetroit at Boston (Dec 11), L.A. Rams at San Francisco (Dec 12).\nUEFA Preliminary Draw For The FIFA World Cup airs on FS1, Friday, Dec 26.\nBraga at AS Roma and Lazio at Ajax Amsterdam air on CBSSN, Wednesday, Dec 11."},{"title":"How I feel about Groupon","content":"Mary Hunt, founder of EverydayCheapskate.com, expresses her dislike for Groupon, considering it preys on impulsive people and encourages unplanned spending. She believes Groupon's deals are often not for items she plans to purchase. Mary Hunt recommends dealing with Groupon by unsubscribing from their emails."},{"title":"Bridge - The power of the first blow","content":"The article discusses a bridge game on December 19, 2023, between East and West. In the game, East made an opening lead of the diamond two, which West responded to by playing the queen. After winning with the club ace, West led another club and won, forcing South to overruff with the spade king. West praised East's defensive play, saying she would have ruffed with the spade two if her wife played bridge as well."},{"title":"'Still matters today': Community to read famous Frederick Douglass speech on Saturday","content":"Here is a concise summary of the article:\n\nFrederick Douglass delivered his famous \"What to the Slave is the Fourth of July?\" speech on July 5, 1852, in Rochester, New York. The Easton-based Frederick Douglass Honor Society will host an annual community reading of the speech on July 5, 2025, at the Talbot County Courthouse. Fifty-nine people will participate in the event, including local officials and residents. The society has held the reading annually since 2018 and encourages people to attend despite how they celebrate the holiday."},{"title":"TV LISTINGS 12-28-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nDecember 28, 2024 TV listings include Md.-Eastern Shore at Maryland, UCLA vs. Gonzaga, Wisconsin at Indiana, and The Wasabi Fenway Bowl: UConn vs. North Carolina. Women's college basketball games on December 28 are Wisconsin at Indiana and Creighton at St. John's. December 29 includes Indiana St. at Ohio St., South Florida at Rice, Louisville at Boston College, and Dallas at Chicago in NFL matchups."},{"title":"St. Michaels talks tax rates at commissioners meeting","content":"St. Michaels Commission President David Breimhurst discussed gathering stakeholders to discuss town tax rates at a meeting on November 8. The St. Michaels Historic District Residents Association proposed four steps for the commissioners: studying alternative revenue sources, engaging with the Chesapeake Bay Maritime Museum over payments in lieu of taxes (PILOTs), holding public hearings, and reviewing residential property rates. Commissioner Tad DuPont said the conversation has already started, while Treasurer Al Mercier mentioned potential additional revenue sources like a tourism tax and parking meters. The meeting followed an issues brief arguing that St. Michaels is largely supported by residents rather than businesses."},{"title":"Community donates vessels to Charity Boat Auction","content":"A wide array of boats were displayed at the Chesapeake Bay Maritime Museum ahead of its annual Charity Boat Auction on August 29. The auction will take place on Saturday, August 31, raising money for the museum and its community efforts. Donated vessels include a 40-foot trawler, a jet ski with minimal use, and various kayaks. Kristen Greenaway, CBMM president and CEO, noted that each boat has a story behind it. The auction aims to raise funds directly for the museum's mission."},{"title":"Heading for the debt trap","content":"Mary Hunt, founder of Everyday-Cheapskate.com, shares her experience being trapped in unsecured debt for 13 years, which included a six-figure load of credit card debt. She and her husband repaid every dime including interest, penalties, and fees without filing for bankruptcy."},{"title":"Clyde Eugene Kopp \"Chuck\"","content":"Clyde Eugene Kopp \"Chuck\" was born on December 18, 1939. He passed away on November 23, 2023, at age 83. Chuck served in the United States Navy from 1956 to 1963 and worked as a Senior Production Supervisor at Black & Decker for 38 years. He is survived by his wife Donna Kopp, daughters Angela and Danette Spears, granddaughter Chelsea Scott, and two great-granddaughters Chloe and Violet Scott."},{"title":"Gyroplane crashes at Easton Airport","content":"A Rotorsport MTOSport 2017 gyroplane crashed at Easton Airport on October 13, injuring its sole pilot who was flown to the University of Maryland Shock Trauma Center in Baltimore for treatment. The FAA and NTSB will investigate the incident further with a preliminary investigation indicating unknown issues and substantial damage."},{"title":"Easton's Hershey named player of the year; St. Michaels Miller selected coach of the year","content":"Easton's Jake Hershey was named North Bayside boys tennis player of the year after a 20-1 season in singles play and a third straight Class 2A East Region II singles title. St. Michaels' Jordan Miller was selected coach of the year for his team, which dominated its North competition with an 18-1 overall record and won their first state mixed doubles championship."},{"title":"The Strand Beach project faces more controversy","content":"The Strand Beach project in Oxford faces controversy as a fence that has been installed to support vegetation growth is considered an \"eye sore\" by local Commissioner Dave Donovan. The beach was once popular but remains largely empty since the project's implementation. A resident who has lived in Oxford for decades notes that it used to be packed with people. The duration of the fencing, which could range from a season to multiple seasons, is unknown."},{"title":"TV LISTINGS 10-3-24","content":"Here is a concise summary of the article:\n\n- Thursday, Oct. 3: Texas St. at Troy (7 p.m.) and Sam Houston St. at UTEP (9 p.m.)\n- Women's college soccer: Clemson at Pittsburgh (6 p.m.), Virginia Tech at Miami (8 p.m.)\n- Women's college volleyball: Maryland at Penn St. (6 p.m.), Nebraska at Illinois (7 p.m.)\n- Men's futsal: World Cup 2024 semifinal between Argentina and France (10:50 a.m.)\n- Golf: First rounds of DP World Tour, Korn Ferry Tour, PGA Tour, Asia-Pacific Amateur Championship, and Ladies European Tour\n- Horse racing: NYRA at America's Day at the Races (12:30 p.m.)\n- MLB: N.L. Wild Card games between Atlanta and San Diego, and N.Y. Mets and Milwaukee\n- NFL: Tampa Bay at Atlanta (8:15 p.m.)\n- NHL: Preseason games between New Jersey and Philadelphia, and Colorado and Vegas\n- Men's soccer: UEFA Europa League matches between Nice and Lazio, and Lyon and Rangers"},{"title":"Budget discussions kicked off at Talbot Board of Ed work session","content":"Talbot County Public Schools' Chief Financial Officer Sarah Jones outlined priorities including achieving academic equity in math and special education, during a work session on December 18, 2024. Superintendent Sharon Pepukayi confirmed these priorities were determined during a board retreat last year. The district is focusing on compliance with Maryland's Blueprint for Education funding initiative, which allocates money based on per-student funding. Jones noted the need to \"make shifts\" in two programs and expressed concern about foundation funding being insufficient for smaller schools."},{"title":"AL GLANCE 6-9-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe East Division standings are led by New York with 45 wins and 20 losses. The Central Division is topped by Cleveland with 40 wins and 22 losses. In the West Division, Seattle leads with 36 wins and 30 losses. On June 8, 2024, Friday's games saw Pittsburgh defeat Minnesota, while Baltimore beat Tampa Bay 6-3 in their matchup. Sunday's schedule includes several matchups, including San Francisco vs. Texas and Houston at L.A. Angels."},{"title":"On the ballot: What is Question 1 or the Right to Reproductive Freedom Amendment?","content":"Reproductive healthcare access will be decided by Maryland voters on Question 1, a constitutional amendment passed in the 2023 General Assembly. The amendment would guarantee \"reproductive freedom\" in the state constitution, enshrining the right to abortion and reproductive autonomy. The proposal is endorsed by Gov. Wes Moore, Pro-Choice Maryland, and the Maryland State Education Association, but opposed by the Maryland Catholic Conference and other conservative groups."},{"title":"Academy Art Museum announces board change","content":"The Academy Art Museum has announced nine new trustees: Christina Acosta, Sue Bredekamp, Sandford Cardin, Robert Fogarty, Joanne Lukens, Patricia Parkhurst, Jazmine Paxon, Daniel Weiss, and Donald Wooters. Board Chair Nanny Trippe will step down after six years as chair, with Donna Alpi taking over starting September 1."},{"title":"\"Terrestrial Caravan\" - Hoesy Corona connects art and climate change at Academy Art Museum","content":"Hoesy Corona's art exhibit \"Terrestrial Caravan\" at Academy Art Museum in Easton, MD wraps up on September 10, 2023. The exhibit explores climate change's impact on humans and nature through large-scale installation and Climate Ponchos that double as wearable sculptures. Hoesy Corona is a Baltimore-based artist whose work has been featured at various institutions including the Baltimore Museum of Art."},{"title":"Top 10 things Dems will do","content":"Here is a concise summary of the article:\n\nJoe Biden will likely prevail over Donald Trump in November's presidential election. Democrats will support clean energy and reduce fossil fuels to address climate challenges. The party will recognize women's health care autonomy and continue to support allies like Israel and Ukraine. Democrats will prioritize appointing ethical justices, maintaining economic policies with historically low unemployment, and respecting election results."},{"title":"Bridge - Santa and his elves present problems","content":"Here is a summary of the article in 2-5 concise sentences:\n\nPhillip Alder's quiz for readers. \n\n1. South should plan to cover East and West hands. \n2. The vulnerability changes to East-West. \n3a. South opens one spade, respond with a minimum bid. \n3b. Rebid one no-trump after opening 12-14 points. \n4. East leads hearts. \n5. North opens one no-trump, 15-17 points; South responds accordingly."},{"title":"Stand up for rights","content":"Here is a summary of the article in 4 sentences:\n\nTalbot County's current DEI statement should be kept intact, according to Sandra Rowland-Hack. The author shares her personal experience with her mother not being able to vote, highlighting the importance of women's rights. Local jurisdictions upholding diversity and inclusion can influence federal government actions."},{"title":"Lessons learned from Donald Trump’s campaigns","content":"Here is a summary of the article in 4 sentences:\n\nDonald Trump's presidential campaigns utilized adaptability to media trends and platforms, such as leveraging Twitter and bypassing traditional media gatekeepers like \"60 Minutes\". This strategy helped him connect with voters on his terms, including through select online celebrities and podcasts. Trump's decision not to participate in debates or interviews that he deemed unfavorable to him was also a key aspect of his campaign strategy. The article concludes that the effective use of campaign communications strategies is crucial for future political candidates, as Trump's success can serve as a model for adaptability in the ever-changing media landscape."},{"title":"AL LEADERS 5-26-24","content":"Kansas City's Whit Merrifield not mentioned in stats for AL leaders for 5/26/24; instead, Kansas City's:\n- Witt (.304), Rutschman (.296)\n- Lead runs: Witt (47), Henderson (39), Soto (39), Semien (38)\n- RBIs: J.Ramírez (49), Soto (43), Perez (39)\n- HITS: Peña (64), Soto (64), Witt (63), Altuve (62), \n- Doubles: Judge (17), Bleday (15), Ja.Duran (15), Witt (15)"},{"title":"'Sister Act' takes the cake","content":"March 29, 2025: The Easton High School production of \"Sister Act\" received high praise, showcasing exceptional talent from lead singer Ta'Vea Roberts and freshman Kira Callis as Mother Superior. Director Richard Vitanovec's staging featured captivating set designs, including digital background scenery."},{"title":"'Game-time decision': Clouds, storms could dim eclipse viewing in some parts of U.S.","content":"Some parts of the U.S., particularly Texas and Arkansas, could see cloudy skies and storms during Monday's total solar eclipse due to bad weather forecasting. Over 4 million people are expected to travel for the event, which is also visible in other areas with varying degrees of clarity. The most clear areas to view the eclipse in its totality path include northern parts of Arkansas, southeastern Missouri, southern Illinois, and southern Indiana. Cloudy conditions are forecasted for Mid-Atlantic areas, including Easton and Ocean City, while central Texas may see clear skies."},{"title":"Students head back to school in Talbot County","content":"Students returned to Easton Elementary School in Talbot County, Maryland on August 26, 2024, with a new school year and theme of \"transforming and performing together.\" Principal Lisa Devaric and Superintendent Sharon Pepukayi welcomed students back, highlighting staff preparations including professional development for multilingual learners."},{"title":"ON THE REBOUND","content":"Here is a summary of the article in 5 concise sentences:\n\nMatt Griffith's Easton High football team opens their season with quarterback Mikey O'Connor returning as the starter, backed by sophomore Brady Walls.\nThe Warriors' backfield looks deep with junior Dustin Blue and sophomore Jordan Horsey leading a physical one-two punch.\nEaston's receiving corps welcomes back senior Chase Raab after an injury last year, along with juniors Carter Mooney and Logan Friend.\nThe team's new defensive coordinator is Al Waters, who has coached at Queen Anne's and Cambridge-South Dorchester, and the defense has undergone changes but remains athletic and fast.\nEaston hosts North East of Cecil County on Friday at 7 p.m."},{"title":"Eagles' offensive coordinator Moore becomes New Orleans head coach","content":"Kellen Moore becomes next coach of New Orleans Saints. \nMoore, 36, previously oversaw Philadelphia Eagles' Super Bowl champion offense. \nHe takes over organization with Alvin Kamara and Chris Olave after Drew Brees retirement and Sean Payton's departure.\nThe Saints have not made playoffs since 2020 season. \nKellen Moore was the only assistant coach interviewed by New Orleans that met league rules."},{"title":"Character, truth, civility matter","content":"Here is a summary of the article in 4 concise sentences:\n\nVoters in Easton made a clear statement on May 6 that character, truth, and civility matter. Don Abbatiello's victory was a rebuke of disturbing tactics used in his campaign, including distortions, personal attacks, and fabricated attributions. This election follows a pattern of similar mis- and disinformation tactics in previous local races, which can deter good people from running for office. The historic turnout and Abbatiello's win demonstrate that voters value honesty over artifice and integrity still wins in elections."},{"title":"MEN'S TOP 25 FARED","content":"Here is a summary of the article in 5 concise sentences:\n\nNo. 1 UConn beat St. John's 77-64 and will play Butler on Tuesday. No. 2 Purdue did not play and faces Wisconsin on Sunday. No. 3 North Carolina plays No. 7 Duke before facing Clemson on Tuesday. No. 8 Kansas beat No. 4 Houston 78-65 and will face Baylor on Saturday. No. 10 Kentucky loses to Tennessee, while No. 11 Arizona does not play next; No. 18 Baylor faces Iowa St., No. 16 Auburn faces Alabama, and No. 25 TCU loses to Texas."},{"title":"St. Michaels Commissioners discuss comprehensive plan","content":"St. Michaels commissioners discussed renewing the town's comprehensive plan with a workshop meeting on October 16, 2025. Commissioners President Jay Hudson said priorities would be mapped out for the special session, which has not been scheduled yet. Demographics are one of the concerns brought up by Commissioner Alexis Roiter, and the Planning Commission plans to add this to the plan before the next meeting. The town aims to strengthen its relationship with Talbot County due to federal funding uncertainty."},{"title":"An open letter on recent education mailers","content":"Talbot County Public Schools superintendent Sharon Pepukayi and Board of Education president Emily Jackson wrote an open letter addressing recent mailers targeting their schools and students. They acknowledged challenges but emphasized improvements in state assessments, including significant investments in new curricula and teacher retention. The 23-24 Maryland Comprehensive Assessment results showed modest improvement across all districts, with Talbot County Public Schools experiencing a greater margin of progress than the state average."},{"title":"Candidates file for May primary election","content":"Candidates are filing for May primary elections in Maryland, including U.S. Senate and congressional representative positions, as well as local county board of education seats. Key dates include February 14, 2024, for candidate filings, May 2-9, 2024, for early primary voting, November 5, 2024, for the general election. Notable candidates include Ben Cardin (U.S. Senate), Andy Harris (Congressional District 1), and various local board of education members."},{"title":"Easton council rejects Gunsallus' proposal to delay introduction of campaign finance law","content":"Easton council rejected Frank Gunsallus' proposal to delay the introduction of a campaign finance law on April 22, 2025. The proposed ordinance, sponsored by Mayor Megan Cook and Ward 3 Councilmember David Montgomery, would require campaign contribution reports and set a maximum $250 contribution limit for candidates. The town's May 6 election nears, with Gunsallus facing Abbatiello, and residents expressed concerns about the law potentially disenfranchising grassroots or less wealthy candidates."},{"title":"TV LISTINGS 10-22-25","content":"October 21, 2025:\n\n* MTSU at Delaware (ESPN2), 7:30 p.m.\n* Missouri St. at New Mexico St. (CBSSN), 9 p.m.\n* Santa Clara at Gonzaga (ESPNU), 9 p.m.\n* Syracuse at Boston College (ACC), 7 p.m.\n* Arkansas at Auburn (SEC), 7 p.m.\n\nOctober 22:\n\n* LPGA Tour: The Hanwha LIFEPLUS International Crown, First Round, 10 p.m. (GOLF).\n* Asia-Pacific Amateur Championship, First Round, 5 a.m. Thursday (ESPN2).\n* NYRA: America's Day at the Races, 1 p.m. (FS2).\n* Cleveland at New York, 7:10 p.m. (ESPN).\n* San Antonio at Dallas, 9:35 p.m. (ESPN).\n* Detroit at Buffalo, 7:30 p.m. (TNT, TRUTV).\n\nOctober 23:\n\n* AFL: Port Adelaide at Adelaide, 4:30 a.m. Friday (FS2).\n* South Alabama at Georgia St., 7:30 p.m. (ESPN2).\n* Florida St. at Virginia, 6 p.m. (ACC).\n* Notre Dame at Virginia Tech, 8 p.m. (ACC).\n* PGA Tour: The Bank of Utah Championship, First Round, 5 p.m. (GOLF)."},{"title":"CASA is grateful for its volunteers this holiday season","content":"CASA of the Mid-Shore is a nonprofit organization that advocates for children in Talbot, Dorchester, Queen Anne's, and Kent circuit courts due to abuse, neglect, or abandonment. CASA volunteers, who must be at least 21 years old and have completed pre-service training, play a vital role in identifying unique child needs, advocating for services, and providing stability and support. The organization is grateful for its volunteers, particularly during the holiday season, as they help children find hope amidst challenges. National studies confirm the value of CASA, with findings showing that children are more hopeful when a CASA is present in their lives."},{"title":"AL LEADERS","content":"Kansas City's Witt leads American League batting at .322, followed by Soto (.318) and Perez (.304), with runs leader Witt having 56, Henderson having 49, and Ramirez having 47. J.Ramírez also led in RBIs with 60; Judge had 55; and Rutschman tied with Pasquantino and Perez at 43."},{"title":"Council introduces one-cent resolution question for 2024 ballot","content":"Talbot County Council members introduced a one-cent resolution question for the 2024 general election ballot on May 28, 2024, to amend section 614 of the charter and allow up to one cent per $100 of assessed value above the revenue cap for an additional five years starting July 1, 2026. The original resolution was adopted by a 5-0 vote in 2020 and approved by voters at the same election. Council members Patrick Thomas, Clay Stamp, and Dave Stepp supported the resolution, citing its benefits to public safety services and resident support from previous votes."},{"title":"'It's iconic': Tunis Mills residents push back against county design for bridge replacement","content":"More than 50 people gathered at St Stephens AME Church to discuss proposed bridge replacement plans for the Leeds Creek Bridge in Tunis Mills. County employees presented designs featuring a \"laminated timber deck\" and \"asphalt wearing surface\". Residents expressed concerns over safety, tradition, and environmental benefits of a wooden structure, with many preferring it over an asphalt surface. The county manager said they would revisit the design to explore the wooden option further."},{"title":"DELAY OF GAME","content":"Domonique Foxworth, former NFL cornerback and president of the NFL Players Association, says his son will not play tackle football until high school, citing concerns over brain injuries. Former NFL players Muhammad Oliver and Harry Carson disagree, with Oliver saying flag football can translate to tackle football if taught correctly and Carson advocating for transparency and education about the sport's risks. Bruce Harper suggests that each child should make their own decision about playing tackle football. The NFLPA has no formal policy on tackle football for kids, but supports youth initiatives including both tackle and flag football."},{"title":"Local events: Juneteenth at Academy Art Museum, July 4th carnival kicks off","content":"The Academy Art Museum in Easton will host its annual Juneteenth celebration on June 22 from noon to 4 p.m. The event is a collaboration with BAAM, Frederick Douglass Honor Society, and Talbot County Free Library. Juneteenth commemorates the end of slavery in the U.S., which occurred when news of President Abraham Lincoln's Emancipation Proclamation reached Texas in 1865."},{"title":"More on planning at trick one - Bridge","content":"A match between South and North from different countries takes place. The game ends in a slam with declarer winning the first trick with their diamond ace. However, they incorrectly assessed the situation with 11 winners and needed to capture another club winner. The right line would be to draw only two rounds of trumps and play off three top spades in South's hand."},{"title":"Jazz, Americana shows coming to Avalon","content":"Anthony \"Turk\" Cannon will perform at the Avalon Theatre in Easton on October 4 with bassist J. Castro.\nPeter Bradley Adams will perform at the Avalon on October 5.\nThe shows are scheduled for Friday, October 4 and Saturday, October 5, with ticket prices starting at $30."},{"title":"Maryland session concludes with balanced budget","content":"Maryland lawmakers passed a balanced budget on April 8, 2025, raising income taxes and cutting programs to balance the spending plan for the 2026 fiscal year. The $67 billion budget addresses a significant deficit through $2 billion in spending cuts and $1.6 billion in tax changes. Senate Chair Guy Guzzone said the plan preserves Blueprint priorities, while House Minority Whip Del. Jesse Pippy argued it would burden taxpayers."},{"title":"Simplify your Baking: Quick bread basics for beginners","content":"Here is a summary of the article in 2-5 concise sentences:\n\nQuick bread is a type of bread that does not use yeast or another biological agent for leavening and includes recipes like pancakes, waffles, zucchini bread, and flatbreads like naan or tortillas. Quick breads became popular during the mid-19th century with the introduction of baking soda and baking powder. They are great for beginners due to their ease of preparation, versatility, and consistent results. Quick breads can be made without kneading or shaping, making them a convenient option for those with busy schedules."},{"title":"MEN'S TOP 25 3-3-24","content":"No. 1 Houston (25-3) beats Oklahoma and awaits UCF, Illinois. No. 2 Purdue (25-3) faces Michigan St., then at Illinois. No. 3 UConn (25-3) next plays Seton Hall on Sunday. No. 4 Tennessee (22-6) faces Alabama, then South Carolina."},{"title":"Margaret Turner Schelts","content":"Margaret Turner Schelts passed away on October 20, 2023. She was a mother and grandmother who received sympathy and support from family and friends during her passing. The Hospice care team, including nurses, aids, and staff at Comfort Keepers, also provided compassionate care for her."},{"title":"Senior care leaders warn cuts could be ‘drastic’ for Talbot County seniors","content":"Senior care experts warn that state cuts could impact Talbot County seniors in fiscal year 2026 and potentially as early as this year's final quarter, with initial proposals putting $2.5 million in funding at risk. Carrie Ottey, director of senior services for the Talbot County Health Department, estimates a potential loss of $24,000 in funding if cuts are implemented. Council members, including Pete Lesher and Lynn Mielke, express concern over the impact on senior care programs in the county, where 30% of residents are aged 65 and older. The Maryland Department of Aging is facing an over $3 billion deficit, with state legislators pushing for a reduction in total cuts from $2.5 million to around $900,000."},{"title":"A forgotten promise and a pillowcase filled with cash fuel local business owner's dream","content":"Jessica Tanglao, owner of Tanglao Carriage Driving in Easton, MD, fulfilled her childhood promise to raise $2,500 for a horse at age 9 and went on to become a successful business owner with 11 carriages and 10 horses. Originally from Lexington, VA, she learned about horse-drawn carriage tours in the area and began working there before starting her own business. Tanglao's passion for horses is evident in her work ethic, which inspires happiness in both herself and her customers. She aims to share her love for horses with young girls, encouraging them to believe in themselves and achieve their dreams."},{"title":"Talbot County Council approves purchase of Poplar Hill Farm","content":"The Talbot County Council unanimously approved the purchase of Poplar Hill Farm for $6 million on February 14, 2024. The property is slated for future county use, including preservation of open space in the critical area. The land is bounded by Routes 333 and 322 and is near Easton Club development, Papermill Crossing community, and Easton Woodland Park. Council members praised the purchase as a \"visionary\" move to address future needs, including facilities and open space."},{"title":"'A complicated matter with a lengthy history:' Lakeside resolutions remain pending","content":"Lakeside at Trappe development has been pending approval since its plan for wastewater treatment was approved in recent years. Despite construction underway and some homes already built, efforts to implement county oversight remain unresolved. Three pieces of legislation remain pending approval from the Talbot County Council, including Resolution 281, which aims to upgrade water and sewer services for the development.\n\nThe planning commission initially found Resolution 281 consistent with the comprehensive plan in 2020, but later rescinded its approval in 2021 due to concerns with nutrient discharge to the Chesapeake Bay. The county council approved the legislation despite these concerns, and it was later challenged by environmental groups before being revised to reduce wastewater flow.\n\nIn 2023, a revised permit allowing for a significantly smaller wastewater treatment plant was issued, but the Maryland Department of the Environment still seeks clarification on some specifics of the development. Two new resolutions, 338 and 348, aim to address these issues, including requirements for certification from the planning commission and updates to water and sewer service maps.\n\nThe Talbot County Council is set to hold public hearings on all three pieces of legislation in February, giving residents an opportunity to weigh in on the unresolved measures."},{"title":"Talbot Board of Education approves FY2026 budget","content":"Talbot County Board of Education approved its FY2026 unrestricted budget at $86 million, an increase of $8.9 million from FY2025. The budget accounts for 33 additional positions and $1.3 million in health insurance cost increases due to inflation. Talbot County Public Schools Chief Financial Officer Sarah Jones noted the overall budget is only up by $3.6 million. The district will present the budget to the Talbot County Council next month, which will hold a public budget hearing in May."},{"title":"AL GLANCE 4-7-24","content":"Here is a summary of the article in 3-5 concise sentences:\n\nApril 6, 2024, standings show:\nEast Division: Boston and New York tied for first with 6-2 records; Baltimore trails by half game.\nCentral Division: Cleveland leads with an 7-2 record.\nWest Division: Texas tops its division with a 5-2 record.\n\nApril 6, 2024, baseball schedule includes:\nSaturday's games at 1:35 p.m. and 3:10 p.m.\nSunday's games at 1:35 p.m., 2:10 p.m., 3:10 p.m., and 4:07 p.p.m.\nMonday's games include multiple matchups."},{"title":"Easton Club East resident requests court to order delay of HOA election","content":"Jerome Wade filed a complaint on October 21 with Talbot County Circuit Court to request an injunction against Easton Club East's board election, which he believes was unlawfully rejected after his candidacy was denied due to exceeding a 100-word limit in his answers. Easton Club East is a single-family home neighborhood in Easton, Maryland, where residents will vote from October 23 to November 6. Wade was asked to shorten his responses to comply with the association's guidelines, but later received a rejection notice after submitting a revised form on October 1. The court records show that four other candidates submitted forms within the limit, leading to unequal treatment of Wade."},{"title":"Talbot Historical Society hosting walking tours of downtown Easton","content":"The Talbot County Historical Society is hosting two walking tours of downtown Easton on September 16, 2023, starting at 11 a.m. and 12 p.m. Tour guide Prof. Mike Olmert will lead discussions about historic buildings, fires, and other major events in downtown Easton. The tours depart from 25 S. Washington Street in Easton."},{"title":"It's time for Congress to think outside the sandbox","content":"Here is a summary of the article in 4 concise sentences:\n\nCongress is experiencing adolescent dysfunction, with Republicans blaming each other and Democrats blaming Republicans.\nHakeem Jefferies, minority leader in Congress, suggests thinking outside the sandbox to find solutions, including inclusive brainstorming and collaboration with moderate Democrats and Republicans.\nDemocrats should engage with moderate Republicans who are willing to support a speaker if guaranteed 217 votes.\nThe author argues that embracing this approach is better than the current status quo, which allows power-hungry extremists to dominate."},{"title":"Easton council supportive of potential spike in hotel tax rate","content":"Here is a summary of the article in 2-5 concise sentences:\n\nCassandra Vanhooser recommended increasing the accommodation tax rate from 4% to 6% for Talbot County, which would raise $1 million in revenue by fiscal year 2025. The county collects this tax on lodgings outside town limits or within a mile of those limits, while towns like Easton collect it on hotels and short-term rentals within their limits. Easton council supported the proposal, with Councilmember David Montgomery stating that Talbot County's unique attractions justify the increase. The proposal must be approved by state delegates next year, following a request for support from three towns including Easton in October 2024."},{"title":"Underwater grass populations see slight decline in Bay","content":"Underwater grass populations in Maryland's portion of the Chesapeake Bay decreased from 38,188 acres in 2023 to 36,794 acres in 2024, falling short of the state's restoration goal of 79,800 acres. Freshwater populations did well, with five rivers surpassing their goals. Widgeon grass populations declined significantly, especially in Eastern Bay and Tangier Sound. The loss of widgeon grass is concerning due to its sensitivity to changes in water quality."},{"title":"Immigrants contributing taxes","content":"Here is a summary of the article in 4 sentences:\n\nOver 8 million unauthorized US workers contributed $73 billion in federal taxes in 2022 using ITIN numbers. These workers also paid $33.9 billion in payroll deductions to Medicare, Social Security, and unemployment insurance. The Trump Administration's deportation campaign discourages voluntary tax payment and drives law-abiding residents underground. Over 10 million unauthorized immigrants remain in the US, working and contributing to communities without a path to legal residency or citizenship."},{"title":"Local Lightning Rods: Social media, national partisan divisions, culture wars have changed tone and tenor of local politics","content":"Megan Cook, Russ Nelson, Ann Groves Lloyd, Karen Rose, and Bridget Ziegler are local officials in Maryland, Montana, Wisconsin, Florida, and other places. They have seen exponential growth of social media's impact on civil discourse and divisive national politics affecting community-level issues. \n\nRose and others describe increased polarization, with conservatives like Gov. Ron DeSantis and progressives pushing for issues such as vaccine rules, library books, and racial history education. Local school board meetings in Florida feature organized political agendas, with some advocating for book bans and others countering with LGBTQ rights advocacy.\n\nIn small towns, officials like Nelson avoid social media due to its divisive nature. Others, like Groves Lloyd, use platforms like X (formerly Twitter) to focus on local issues. The increasing intersection of national politics and local governance has led to concerns about the impact of social media on civil discourse and community relationships."},{"title":"TAKING CHARGE - Murphy hits game-winner, Rankin seals it to boost Sabres","content":"Here is a concise summary of the article:\n\nSam Murphy hit a game-winning basket with 12.8 seconds remaining, giving Saints Peter and Paul High a 42-39 victory over Easton on December 20, 2023. The Sabres (4-2) trailed Easton (0-0) 13-11 at halftime but took control in the third quarter. Morgan Quade scored a game-high 17 points, and Lucy Rankin sealed the win with a layup after Sam Murphy's drive-to-the-hoop shot."},{"title":"Sarah Drew and a guide dog star in new Hallmark Movies & Mysteries film","content":"Sarah Drew stars in Hallmark Movies & Mysteries film \"Guiding Emily\" on Sept. 8, marking National Dog Service Month. Based on Barbara Hinske's book, the film follows a successful career woman who gets a guide dog named Garth. The movie also features Antonio Cupo and Sharon Taylor. Sarah Drew visited the Guide Dogs of America open house before filming."},{"title":"Chesapeake Bloom: Healing and building through flowers","content":"Dede Hoopes, owner of Chesapeake Bloom in Easton, Maryland, hosted a flower bar to celebrate International Women's Day. She turned her passion for gardening and flowers into a business after health challenges led her to leave her career in human resources in 2015. With the help of partner Samantha McCall, Hoopes opened Chesapeake Bloom with a quarter-acre flower farm in Oxford in March 2020. The business has grown through its focus on fresh, local, and specialty flowers, and remains an all-women-owned operation."},{"title":"Recalling Kaley Cuoco'S \"Charmed\" Existence - Classic Corner","content":"Kaley Cuoco joined the cast of \"Charmed\" for its final season, which premiered on September 29, 2023, with episodes airing on TNT. The show follows Phoebe (Alyssa Milano), Piper (Holly Marie Combs), and Paige (Rose McGowan) as they reboot their lives after being presumed deceased. Cuoco played a new sorceress in need of help, which helped her secure a role on \"The Big Bang Theory\" starting the following year."},{"title":"Gluten-Free Tourism: Destinations catering to dietary restrictions","content":"Here is a summary of the article in 2-5 sentences:\n\nOne out of every 100 Americans deals with celiac disease, and millions more have gluten sensitivity. The global market for gluten-free products brought in $12.3 billion in 2023 and is projected to increase 10.1% per year through 2032. Destinations like Italy, London, Dublin, Edinburgh, Hungary, Australia, Greece, French Polynesia, and Germany offer many gluten-free options, thanks to organizations such as the Italian Celiac Association and Coeliac UK. Travelers with dietary restrictions can find safe meals in these places by researching restaurants, asking servers about ingredients, and bringing homemade snacks or having a list of gluten-free options saved on their phone."},{"title":"Planning Commission debates resolutions on Lakeside development","content":"The Talbot County Planning Commission debated resolutions on Lakeside development, concluding with one finding of inconsistency and two postponements. Resolutions 338, 347, and 348 aimed to amend the county's comprehensive water and sewer plan related to Lakeside at Trappe. Resolution 338 would require a phased review of future expansion, while Resolution 347 provided estimated equivalent dwelling units for all phases, but included unclear timing. Resolution 348 clarified water and sewer classifications for parcels not part of Resolution 281. The Planning Commission postponed consideration of Resolutions 347 and 348 due to ongoing uncertainty."},{"title":"Rocking reflections: Paramount+ revisits Elvis Presley's 1968 comeback special","content":"Elvis Presley's 1968 television special is being revisited by Paramount+ in \"Reinventing Elvis: The '68 Comeback,\" which starts streaming on August 15, the night before the 46th anniversary of Presley's death. Producer-director Steve Binder narrates the documentary, examining Presley's relationship with Binder and manager Col. Tom Parker. John Scheinfeld directed the film, incorporating segments from the original show and featuring comments from singers Darius Rucker, Drake Milligan, journalist Alanna Nash, and others. The documentary aims to tell the real story of the 1968 special, which was a turning point for Presley and those involved in it. Binder partnered with Paramount+ to include clips from Elvis' films, which were previously unavailable due to copyright issues."},{"title":"Husband lacking concern on health","content":"Need Support wrote to columnist Harriette Cole about her husband's lack of concern for her health and his lecturing style during a recent physical exam that showed abnormal blood test results. Need Support is seeking support and wants to ask a friend or sister for accompaniment to doctor's appointments and discussion of results. She plans to inform her husband of her situation if she chooses to, but prioritizes addressing her health issues first."},{"title":"NL GLANCE 5-19-24","content":"The MLB East Division standings are as follows:\n- Philadelphia 33 14 .702 —\n- Atlanta 26 15 .634 4\n- Washington 20 24 .455 11½\n- New York 20 25 .444 12\n- Miami 15 32 .319 18\n\nIn the Central Division, Milwaukee leads with a record of 26 18 .591 —, followed by Chicago and Pittsburgh. The West Division is led by Los Angeles with a 30 17 .638 — record.\n\nNotable games include Pittsburgh 9, Chicago Cubs 3; Philadelphia 4, Washington 2; Miami 8, N.Y. Mets 0; San Diego 3, Atlanta 1; Houston 5, Milwaukee 4; Detroit 13, Arizona 0; and the series matchups for each team on Fridays through Mondays."},{"title":"Arboretum announces botanical art programs","content":"Adkins Arboretum has announced a series of botanical art programs taught by artists Sarah Saltus, Kelly Sverduk, and Judy Thomas from August to December 2023 in Ridgely, MD.\nThe programs include Colored Pencil with Mixed Media, Botanical Drawing I & II, Pumpkin & Gourd Color Pencil, Illustrated Phenology Wheel, Watercolor Pencils in Nature & Travel Journaling, and Watercolor Wreath.\nPrograms start on August 19 and October 26, and registration is required; fees vary."},{"title":"Maryland faced the coldest winter in six years","content":"Here is a summary of the article in 2-5 concise sentences:\n\nMaryland's winter was the coldest in six years, with an average temperature of 39.3°F at BWI Airport. The state has seen variable winter temperatures over the past decades, with averages increasing by about 3°F since 1896. February is typically the snowiest month in Maryland, with around 140 inches of total snowfall recorded since 2004-2005. This past winter saw relatively light snowfall, but still was the most snow that Marylanders have seen in three years."},{"title":"Fall Kickoff Weekend in Easton","content":"Downtown Easton will host a Fall Kickoff Weekend event on October 4-5. The event coincides with First Friday arts events and features various activities, including pumpkin carving, kids art events, an adoption \"kissing booth,\" carriage rides, juggler performances, and children's story time."},{"title":"Easton EDC updates Town Council on foot traffic, Fire & Ice","content":"Here is a summary of the article in 4 sentences:\n\nHolly DeKarske, Easton Economic Development Corporation Executive Director, provided an update to the Easton Town Council on foot traffic and the Fire & Ice Festival. Data from Placer.ai showed around 9,200 visits on North Washington Street during the festival this year, down from 11,300 in 2024. DeKarske plans to keep streets open for future festivals despite insurance and police costs, with the goal of mitigating foot traffic. Councilmember David Montgomery asked for aggregated sales numbers from businesses to better judge economic development benefits, while Councilmembers Frank Gunsallus and Don Abbatiello also offered feedback on data sharing and factors affecting retail spending."},{"title":"71-year-old spends season in Glacier National Park","content":"Cheryl Krebeck, 71, spent her 72nd year in Glacier National Park from April to October. She worked as a front desk person at a hotel built by the Great Northern railroad in 1910 and also hiked on trails like the Highline Trail up at Logan Pass, reaching 6,600 feet. Krebeck lived on the west side of the park, which she found had fewer people, allowing for more animal sightings. She plans to take trips to the Amazon next."},{"title":"New training center will provide cross-training, easier commute for first responders","content":"A new Emergency Services Training Campus is being built in Easton, Maryland, to provide cross-training and easier commutes for first responders, including Talbot County firefighters and police officers. The campus will be run by the Easton Volunteer Fire Department and coordinated with the University of Maryland Fire and Rescue Institute. Construction began on a 7,200-square-foot facility at 9095 Mistletoe Drive in August 2024. The campus is expected to be completed by winter 2025 and will feature a burn building for repeated training scenarios."},{"title":"TODAY IN HISTORY/Aug. 13","content":"On August 13, 1961, East Germany sealed its border and built a wall separating Berlin's eastern and western sectors; on this date in other years: \n\n1521 - Hernando Cortez captured Tenochtitlan (present-day Mexico City) from the Aztecs.\n1792 - French revolutionaries arrested King Louis XVI.\n1889 - William Gray received a patent for the first coin-operated telephone.\n1918 - Opha May Johnson became the first woman to join the U.S. Marine Corps.\n1952 - Big Mama Thornton first recorded \"Hound Dog.\"\n1969 - New York City held a ticket-tape parade for Apollo 11 astronauts.\n1995 - Baseball Hall of Famer Mickey Mantle died in Dallas.\n2011 - Seven people were killed at the Indiana State Fair during a stage collapse.\n2020 - President Donald Trump acknowledged starving the U.S. Postal Service.\nBirthdays: Joycelyn Elders (91), Janet Yellen (78), Kathleen Battle (76), Philippe Petit (75), Bobby Clarke (75), Betsy King (69), Paul Greengrass (69), Danny Bonaduce (65), Sam Champion (63), Dawnn Lewis (63), John Slattery (62), Debi Mazar (60), Midori Ito (55), Andy Griggs (51), Karine Jean-Pierre (50), Sarah Huckabee Sanders (42), Sebastian Stan (42), Lennon Stella (25)."},{"title":"Massaro leads Talbot in opener","content":"Anthony Massaro led Talbot Post 70/77 to a 4-3 win over Queen Anne's-Kent County on July 16, 2024, in Game 1 of their American Legion Eastern Shore League North Division playoff series. Massaro threw a complete game four-hitter with 10 strikeouts and allowed one earned run. Talbot improved to 3-5-1, while Queen Anne's-Kent County fell to 3-4."},{"title":"Bridge - Top or bottom, take your pick","content":"Mark Twain was barred from meteorological school in 1865. Bridge player South weathered a storm by continuing with a low heart or the jack after winning trick one and cashing the heart ace. Declarer realized he needed East or West to cover the suit, leading him to ruff a diamond and force out East's last trump."},{"title":"Easton Town Council OKs Delmarva Pride Festival permit","content":"The Easton Town Council unanimously approved a permit for the 2025 Delmarva Pride Festival on December 4, 2024. The festival is set for June 14, 2025, and expected attendance is around 4,000. It is organized by the Delmarva Pride Center, which will feature vendors, businesses, food, and a celebration of the LGBTQ+ community in Easton, MD. Council President Frank Gunsallus and four other council members voted for approval, while Ward 3 Councilmember David Montgomery was absent from the meeting."},{"title":"Easton forfeits boys' game to Cambridge-SD","content":"Here is a summary of the article in 2-5 concise sentences:\n\nEaston High's boys' basketball team forfeited its game against Cambridge-South Dorchester on January 11, 2024, due to safety concerns. The decision was made after altercations during an Easton-Cambridge football game on October 27, 2023. Easton will play the girls' game without spectators, while Cambridge-SD will be credited with the win for both boys and girls games scheduled at their school. Talbot County Public Schools also announced that they would not allow spectators at home basketball events against Cambridge-SD due to safety concerns."},{"title":"Talbot State's Attorney's Office hires deputy","content":"Talbot County State's Attorney Joseph Coale appointed Joyce Jones as Talbot County deputy state's attorney on August 30, 2023. Joyce Jones joined the State's Attorney's Office in December 2022 and has extensive experience with criminal law and the Talbot County Drug Task Force."},{"title":"Steady leadership, respect earn voters' support","content":"William Scranton, a former one-term Republican member of Congress, won the 1962 Pennsylvania gubernatorial election against Richardson Dilworth by beating him with 55% of the total statewide votes. Dilworth had previously been elected city treasurer, district attorney, and twice as mayor of Philadelphia. The election was marked by a notable debate between Scranton and Dilworth, where Dilworth's meltdown after Scranton unexpectedly showed up on live TV led to a shift in public perception."},{"title":"Talbot schools welcome back teachers and staff","content":"Hundreds of teachers and staff gathered at Easton High School's auditorium on August 22, 2024 to celebrate the start of the new school year. Jeremy Hillyard was named 2024-2025 Teacher of the Year, while Rosario Steele received the Support Staff of the Year award. General Manager Pat Papineau presented awards and praised teachers for their dedication. District Superintendent Sharon Pepukayi closed the event with a speech outlining major areas for focus, including staffing, transportation, and student behavior."},{"title":"Stephen Harvey is bringing jazz to St. Michaels","content":"Stephen Harvey will perform a sold-out show at Windon Distilling Company's new event space, Golden Hour, in St. Michaels, MD, on Friday night to mark its opening. Jaime Windon, founder of Windon Distilling Company, is a fan of jazz and sees the event as an opportunity to showcase music alongside rum cocktails. Harvey was raised in a musical family and has a generational love for music, studying Western European art music before focusing on American jazz styles. He released his latest album \"Library Card\" and will be performing with his trio Sphinx. The event aims to expand jazz music's presence in the area."},{"title":"Easton man pleads guilty to distributing child pornography","content":"Darian Braun, 23, of Easton, Maryland, pleaded guilty to six counts of promoting and distributing child pornography in February 2025. The offense occurred in June 2024, after a cyber tip from the National Center for Missing and Exploited Children led investigators to Braun's residence. He initially received 34 charges, with 17 related to promoting and distributing child pornography, and will not face prosecution on remaining charges as part of his plea agreement."},{"title":"Art exhibits at Zach Gallery","content":"The Zach Gallery in Easton, MD is hosting art exhibits featuring Paton Miller and Scott Bluedorn through November 30, 2024. The gallery is located at 17 South Washington Street and is part of the Prager Family Center for the Arts."},{"title":"The Blue Crab meets the Bagery: St. Michaels restaurant gets new owners","content":"The Blue Crab Coffee Shop in St. Michaels, MD has reopened under new ownership, Matt Andrews, who also owns the Bagery in Easton. The building, originally constructed as an Odd Fellows Lodge in 1867, was renamed Freedom's Friend Lodge No. 1024 after the Civil War. Andrews plans to honor the space's history through social media and interviews with historical society members. The new owners have maintained a good working relationship with former owners Helen and Brian Herman, who still own the building. The menu features organic products made from scratch in Easton, including an array of vegan options."},{"title":"Doncic learning it takes awhile to win","content":"Here is a summary of the article in 2-5 concise sentences:\n\nLuka Doncic lost his first NBA championship to the Boston Celtics in 2024, ending their series at 106-88. Doncic was already one of the best players in the world at age 25 and has achieved impressive stats through his six-year career, including being on an absolute Hall of Fame trajectory. Despite playing with injuries in the playoffs, Doncic finished as the leader in points, rebounds, and assists. Mavericks coach Jason Kidd believes Doncic will come back stronger after facing criticism during the finals, saying \"this will only make the great ones better.\""},{"title":"TODAY IN HISTORY/Nov. 12","content":"Ellis Island officially closed as an immigration station and detention center on November 12, 1954. On this date, Josef Stalin became the undisputed ruler of the Soviet Union in 1927, while President Franklin D. Roosevelt authorized the opening of the San Francisco-Oakland Bay Bridge in 1936."},{"title":"Bridge - The feeling was wrong","content":"Here is a summary of the article in 4 sentences:\n\nPhillip Alder writes about a bridge play he spotted in a magazine. In the modern tournament game, North can rebid a forcing two spades with only 10 or 11 points to force to game. However, defenders can counter by playing one heart and two club tricks, followed by a third club from East, which West should avoid leading a trump to. Alder recommends ruffing the diamond six at trick two and instead leads a heart to communicate, while also considering switching to clubs if East plays low."},{"title":"Trappe Planning Commission approves Phase 1D Lakeside plans","content":"The Trappe Planning Commission approved Phase 1D Lakeside plans on March 21, 2024. The commission cleared the way for the Trappe Town Council to vote by approving a minor amendment and subdivision revision plat. Attorney Lyndsey Ryan clarified that open space areas would be defined as public spaces under the homeowner's association mandate. Commissioner Edgar Harrison sat down with resident Margaret English after the meeting to discuss her concerns about cannabis businesses."},{"title":"St. Michaels Commissioners bid farewell to duPont, approve ordinances","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThomas \"Tad\" duPont resigned as St. Michaels Commissioner due to health reasons; his resignation came within 90 days of the next regular election. The board unanimously approved an ordinance changing zoning regulations for cannabis businesses, allowing dispensaries and processing facilities as a special exception. Commissioners also voted to renew their contract with International Computer Services Incorporated for IT services and approved an annual review of the Police Accountability Board."},{"title":"VFW plans parade to welcome Vietnam veterans home 50 years after end of war","content":"Kenley Timms and other Vietnam veterans plan a parade in Easton on March 30 to welcome home fellow service members who were not given a warm reception upon returning from the war 50 years ago. The event includes a wreath laying ceremony, parade through downtown Easton, and a short program honoring Vietnam veterans. Timms hopes for a large turnout with spectators waving American flags and public participation in transporting unable veterans. Event organizers seek military vehicles and assistance with transportation."},{"title":"Player Profile - Hovland Looks To Bring Youthful Spark At 2023 Ryder Cup","content":"Here is a concise summary of the article:\n\nThe 44th Ryder Cup begins on September 30 at Marco Simone Golf and Country Club in Rome. Team Europe, led by four-time Ryder Cup winner Luke Donald, aims to return to winning ways with a balanced team featuring Rory McIlroy, Jon Rahm, Matt Fitzpatrick, Shane Lowry, and Viktor Hovland (Norway). Hovland is participating in his second Ryder Cup tournament after making his debut in 2021."},{"title":"TV LISTINGS 2-7-25","content":"TV LISTINGS February 6-7, 25\n\nFebruary 6\n- Unrivaled Basketball League: Phantom vs. Lunar Owls at 7:15 p.m., and Mist vs. Rose at 8:30 p.m.\n- Caribbean Series: Dominican Republic vs. Mexico at 10 p.m.\n- VCU at Dayton at 7 p.m., Southern Cal at Purdue at 7 p.m., St. John's at UConn at 8 p.m., Saint Louis at Saint Joseph's at 9 p.m., and San Jose St. at Boise St. at 9 p.m.\n- Florida at Arkansas, Kentucky at Oklahoma, LSU at Alabama, Denver at Arizona St., Michigan at Penn St., Nebraska at Iowa, North Carolina at Pittsburgh, Purdue at Wisconsin, PGA Tour Champions: The Hassan II Golf Trophy at 8 a.m., LIV Golf League Riyadh at 10 a.m., LPGA Tour: The Cognizant Founders Cup at 11 a.m., PGA Tour: The Waste Management Phoenix Open at 4 p.m.\n- NYRA: America's Day at the Races at 3 p.m.\n- Invicta FC 60 Main Card: Olga Rubin vs. Mayra Cantuaria at 7 p.m.\n- Philadelphia at Detroit at 7:40 p.m., Pittsburgh at N.Y. Rangers at 7 p.m., PBR: Monster Energy Team Challenge at 6 p.m., SailGP: The KPMG Australia Grand Prix — Event 3 — Day 1, at 12:30 a.m.\n- Concacaf U-17 Qualifier Group Stage: Bermuda vs. Curacao at 6:50 p.m., Saudi Pro League: Al-Fayha at Al-Nassr at 9 p.m.\n- Abu-Dhabi-WTA Semifinals; Cluj-Napoca-WTA, Rotterdam-ATP, Dallas-ATP Quarterfinals, and Dallas-ATP Quarterfinals at 7 a.m. and 8 p.m.\n\nFebruary 7\n- Women's College Gymnastics: Florida at Arkansas, Kentucky at Oklahoma, LSU at Alabama.\n- Men's College Hockey: Denver at Arizona St.\n- College Wrestling: Michigan at Penn St., North Carolina at Pittsburgh, Nebraska at Iowa, Purdue at Wisconsin.\n- Golf: PGA Tour Champions: The Hassan II Golf Trophy at 8 a.m., LIV Golf League Riyadh at 10 a.m., LPGA Tour: The Cognizant Founders Cup at 11 a.m., PGA Tour: The Waste Management Phoenix Open at 4 p.m.\n- Horse Racing: NYRA: America's Day at the Races at 3 p.m.\n- Mixed Martial Arts: Invicta FC 60 Main Card: Olga Rubin vs. Mayra Cantuaria at 7 p.m.\n- NBA: Philadelphia at Detroit at 7:40 p.m., Pittsburgh at N.Y. Rangers at 7 p.m.\n- Rodeo: PBR: Monster Energy Team Challenge at 6 p.m.\n- Sailing: SailGP: The KPMG Australia Grand Prix — Event 3 — Day 1, at 12:30 a.m.\n- Men's Soccer: Concacaf U-17 Qualifier Group Stage: Bermuda vs. Curacao at 6:50 p.m., Saudi Pro League: Al-Fayha at Al-Nassr at 9 p.m.\n- Tennis: Abu-Dhabi-WTA Semifinals; Cluj-Napoca-WTA, Rotterdam-ATP, Dallas-ATP Quarterfinals, and Dallas-ATP Quarterfinals at 7 a.m. and 8 p.m.\n\nFebruary 8\n- Men's College Basketball:\nTennessee at Oklahoma, noon \nSouth Carolina at Kentucky, noon \nFAU at Tulsa, noon \nOregon at Michigan St., noon \nSeton Hall at Georgetown, noon \nRichmond at Davidson, noon \nMichigan at Indiana, 1 p.m. \nVirginia Tech at Notre Dame, 1 p.m. \nWisconsin at Iowa, 1 p.m.\nTexas at Vanderbilt, 1 p.m. \nUNC-Wilmington at Drexel, 2 p.m.\nKansas at Kansas St., 2 p.m. \nMiami at Louisville, 2 p.m.\nLittle Rock at Morehead St., 2 p.m.\nMarquette at Creighton, 2 p.m.\nProvidence at Butler, 3 p.m.\nBoston College at Syracuse, 3:15 p.m. \nTexas A&M at Missouri, 3:30 p.m. \nPenn St. at UCLA, 4 p.m.\nTowson at Monmouth, 4 p.m.\nSam Houston St. at Liberty, 4 p.m.\nFlorida at Auburn, 4 p.m.\nWake Forest at California, 5 p.m. \nGeorgia Tech at Virginia, 5:30 p.m.\nIllinois at Minnesota, 6 p.m.\nLoyola of Chicago at Duquesne, 6 p.m.\nDuke at Clemson, 6 p.m.\nBYU at Cincinnati, 6 p.m.\nIllinois St. at Northern Iowa, 6 p.m.\nMississippi St. at Georgia, 6 p.m.\nN.C. State at Stanford, 7 p.m.\nAlabama at Arkansas, 8 p.m.\nEast Carolina at UTSA, 8 p.m.\nMississippi at LSU, 8:30 p.m.\nSan Diego St. at Colorado St., 10 p.m.\nTexas Tech at Arizona, 10 p.m.\nSaint Mary's at Oregon St., 10 p.m.\nUC San Diego at UC Irvine, 10 p.m.\nNorthwestern at Washington, 10:30 p.m.\n\nWomen's College Basketball:\nOral Roberts at S. Dakota St., noon \nXavier at Seton Hall, 2 p.m.\nOhio St. at Southern Cal, 9 p.m.\nGOLF\nDP World Tour: The Qatar Masters, Third Round, 4:30 a.m. (GOLF).\nPGA Tour Champions: The Hassan II Golf Trophy, Final Round, 8 a.m. (GOLF).\nPGA Tour: The Waste Management Phoenix Open, Third Round, 1 p.m. (GOLF).\nPGA Tour: The Waste Management Phoenix Open, Third Round, 3 p.m. (CBS).\nLPGA Tour: The Cognizant Founders Cup, Third Round, 3 p.m. (GOLF).\nDP World Tour: The Qatar Masters, Final Round, 3:30 a.m. Sunday (GOLF).\nMIXED MARTIAL ARTS\nUFC 312 Prelims: Undercard Bouts, 8 p.m.\nNBA\nBoston at New York, 8:30 p.m.\nNHL\nTampa Bay at Detroit, 1 p.m. (ABC).\nVegas at Boston, 3:30 p.m. (ABC).\nSKIING\nFIS: Alpine World Championships, 3 p.m. (NBC).\nTRACK AND FIELD \nUSATF, 4 p.m. (NBC)."},{"title":"PET OF THE WEEK","content":"Tigger, a male orange kitten born around May 2023, is available for adoption through forms.gle/4U19x6VuytCXxUzn9. He is super affectionate and good with other cats, kittens, and people of all ages."},{"title":"Subscriber And Delivery Services 410-770-4005 Subscribe@Chespub.Com Subscribe Today For Just $7 A Week!","content":"I can't help with that."},{"title":"Denise, Denise (My Sweetest Angel)","content":"Denise, a 16-year-old girl, passed away. The poet expresses their love and grief through the poem \"Denise, Denise (My Brightest Angel)\". The author hears Denise's voice in dreams and receives comfort from her whispers saying to not cry or worry about her being happy after passing."},{"title":"Easton police join athletes in carrying the torch for Special Olympics","content":"Here is a concise summary of the article:\n\nOn June 18, 2025, athletes from Special Olympics Maryland joined police officers on the Law Enforcement Torch Run in Easton, carrying the \"Flame of Hope\" torch through downtown streets. Participants included officers from the Easton Police Department and Talbot County Sheriff's Office, as well as local officials and community members. The event aimed to promote inclusion, dignity, and respect for athletes. Other counties across Maryland participated in the torch tradition, including Queen Anne's County and Kent Island High School students."},{"title":"National Night Out connects cops with community","content":"Here is a summary of the article in 2-5 concise sentences:\n\nNational Night Out was celebrated in Easton on August 7, 2024, connecting law enforcement with the community for the 40th annual event. The Easton Police Department and other agencies participated, including fire departments and emergency services personnel. Megan Coxon, a sergeant with the EPD, organized the event along with Jill Garvey and Lorraine Gould. Mayor Megan Cook attended, highlighting the importance of building relationships with law enforcement. The event featured community resources booths, food, and entertainment."},{"title":"Trappe election canceled; incumbents will retain seats until 2029","content":"The Trappe Town Council election was canceled due to a lack of opposition, with incumbents Brian Schmidt, Walter Chase Sr., and Jeremy Newnam being unopposed in their bids for reelection. The deadline for candidates had passed, and no write-in candidates filed by the deadline. Schmidt has served since 2021, while Chase has been on and off since 2004. Newnam won a special election last year. Their new terms will end in May 2029."},{"title":"Decline of civil dialog in society is a threat","content":"Here is a concise summary of the article:\n\nThe 2024 presidential election campaign and its aftermath are generating widely different reactions in deeply divided America. The attempted assassination at a Pennsylvania rally has been met with various conspiracy theories on both sides of the political divide. A decline in civil dialogue, characterized by vicious disagreements and demonization of opponents, is seen as the greatest existential threat to democracy in America. Some have questioned the sincerity of Trump's responses to the tragedy, while others claim it was staged for political points."},{"title":"Violence is everywhere, so are those fighting it","content":"Here is a summary of the article:\n\nViolence is prevalent worldwide, but communities are taking action to stop it. Campaign Nonviolence aims to end violence in all its forms and promote nonviolent solutions. On September 21-October 2, tens of thousands will participate in Action Days with 4,438 planned events across the US and globally. The campaign seeks to build a culture of peace and active nonviolence, addressing systemic and cultural violence through various actions and events."},{"title":"Inflation: Higher prices for car insurance, beer, housing, fabric, baby formula","content":"Inflation rose 3.2% in February compared to a year ago, with higher prices for housing, car insurance, dining, and items such as beer and baby formula.\nU.S. prices are up 20% from before the COVID pandemic and its shutdowns, and 18.6% since January 2021 when President Joe Biden took office.\nRents increased by 5.7% in February, while car insurance rates rose 20.6%, and prices for baby formula jumped 8.8%.\nBeer prices are up 4.1%, while housing costs contributed to the overall 3.2% CPI inflation rate, with affordable housing remaining a concern.\nU.S. prices were higher during Trump's term in office (2017-2021), rising 7.7%."},{"title":"History is filled with many 'what if' questions","content":"Historian Fred Kaplan argues that if President John Kennedy had not been assassinated in November 1963, the outcome and duration of the Vietnam War would have been different. Kennedy's leadership during the Cuban Missile Crisis, particularly his decision to accept a Soviet proposal to remove nuclear missiles from Cuba in exchange for removing American missiles from Turkey, suggests he may have avoided escalation in Vietnam. If Kennedy had lived, America might have avoided a futile and divisive war resulting in over 58,000 deaths and widespread PTSD among veterans."},{"title":"When life gives you tomatoes","content":"Lynda Balslev's recipe for Tomato, Arugula and Orzo Salad features fresh summer ingredients including cherry tomatoes, heirlooms, and Early Girls, combined with dainty orzo, mozzarella, Parmigiano-Reggiano, arugula, Kalamata olives, basil, and balsamic vinegar."},{"title":"Gunsallus leading in race for town council president","content":"Frank Gunsallus led in the race for Easton Town Council president with 835 votes, ahead of Robert Willey (696), Al Silverstein (348), and Kevin Bateman (30). The election was held on September 13, 2023, at Easton's firehouse, where 1,900 ballots were cast. Former Mayor Robert Willey had been running for office since 1992 and acknowledged that this election cycle had been contentious."},{"title":"TODAY IN HISTORY/Dec. 10","content":"Here is a summary of the article in 2-5 concise sentences:\n\nDecember 10, 1906: President Theodore Roosevelt won the Nobel Peace Prize for negotiating peace in the Russo-Japanese War.\n1861: The Confederacy admitted Kentucky as a pro-Southern shadow state government.\n1898: A treaty was signed in Paris officially ending the Spanish-American War.\n1964: Martin Luther King Jr. received the Nobel Peace Prize in Oslo, accepting it with an audacious faith in humanity's future.\nDecember 10, 2022: Morocco became the first African country to reach the World Cup semifinals by beating Portugal 1-0."},{"title":"Public speaking workshop at Church Hill Theatre","content":"Church Hill Theatre will host public speaking workshops on April 12 and April 26 from 10 a.m. to noon, presented by Lisa Shaffer. The workshop costs $50; registration can be done by calling 410-556-6003 (Tuesday-Friday, 11 AM-4 PM) or emailing office@churchhilltheatre.org."},{"title":"Pastoral Ponderings: Christ's last words","content":"The author is praying for an awakening among Christians in 2025, noting a lack of passion about Jesus' last words before ascending to Heaven. Mark 16:15 quotes Jesus as saying \"Go into all the world and preach the gospel.\" The author urges Christians to prioritize winning souls over debating theological or secular issues, citing 2 Timothy 4:2. They pray for God's mercy and strength to fulfill the Great Commission."},{"title":"Maryland gas prices bounce back up in past week","content":"Average gasoline prices in Maryland have risen 7.6 cents per gallon, averaging $3.59 per gallon, while national average prices for diesel fell 1.6 cents to $3.73 per gallon. The cheapest station in Maryland was priced at $3.05 per gallon and the most expensive at $4.29 per gallon."},{"title":"Blessed are the animals - St. Michaels church blesses 50 local dogs","content":"St. Michaels church blessed over 50 local dogs on October 8, 2023, at Christ Church. Rector Steve Mosher performed the outdoor ceremony, where he read from Genesis and gave blessings to each animal. The event took place in perfect fall weather, with owners and their Tibetan terriers, golden retrievers, and German shepherds in attendance."},{"title":"Art exhibit in Easton uses small items to explore larger themes such as war, homelessness","content":"Anita Groener's art exhibit \"To the Edge of Your World\" at the Academy Art Museum in Easton, MD, uses small-scale items to explore themes such as war and homelessness. The exhibit, created by Dutch-Irish artist Anita Groener, features grid-like drawings and bird-chirping sounds, including two sculpture works titled Cradle and Shrapnel made from twigs collected over 10 years. The exhibit is the museum's first international exhibit, co-produced with a documentary film addressing homelessness, which screened at the opening weekend event drawing over 250 people."},{"title":"LYNNETTE KEEFE","content":"Here is a summary of the article in 2-5 concise sentences:\n\nLynnette Keefe, 54, is running for Ward 2 seat on Easton Town Council. She wants to prioritize accountability, transparency, and smart growth to address affordability and social security concerns. Keefe advocates for affordable housing, including barndominiums and prefab neighborhoods, and plans to improve public safety with more resources for first responders. As a resident of Ward 2, she aims to maintain the area's positive trail system and update Idlewild Park."},{"title":"Ruth Emma Santucci (Dietrich)","content":"Ruth Emma Dietrich Santucci, born August 21, 1928, in Fleetwood, Pennsylvania, died June 24, 2023, at age 94, after years of declining health. She was a devoted teacher, graduating from Mansfield State Teacher's College and later completing a graduate degree at George Washington University. Ruth married Hubert Chester Santucci on August 22, 1953, in Hershey, Pennsylvania, and continued teaching until the births of her daughters. She was survived by her four daughters, seven grandchildren, and nine great-grandchildren, and will be cremated and buried with her husband at the Eastern Shore Veteran's Cemetery."},{"title":"Chesapeake Film Festival showcases artists' perspectives for record-breaking crowds","content":"The Chesapeake Film Festival showcased two documentary films: \"Lives Beyond Motion\" by Keith Glassman and \"100 Foot Photo\" by Matt Kresling, held at the Academy Art Museum in Easton, MD. The festival's Executive Director Cid Collins Walker had chosen to show these films together to balance environmental and women's empowerment themes with stories about men. The festival saw record-breaking crowds for its 18-year history."},{"title":"TV LISTINGS 1-7-24","content":"Michigan plays Penn St., UMass at Dayton, and Wichita St. at Temple on Jan. 7. N.C. State plays Virginia Tech, Kentucky plays Tennessee, and LSU plays Mississippi on Jan. 7. Montana faces S.Dakota St in the FCS Tournament Championship on Jan. 7. The Sentry Tournament Of Champions concludes on NBC and Golf on Jan. 7."},{"title":"Ruth Candace Prossner","content":"Ruth Candace Prossner, age 79, of Royal Oak, MD, passed away on August 5, 2023, due to complications of Parkinson's disease. Born in Utica, NY on July 26, 1944, she is survived by her husband David and four sons, eight grandchildren, and predeceased all five siblings. A private ceremony will be held with her family; memorial donations may be sent to the Talbot County Hospice."},{"title":"Women to Watch event recognizes more than 200 local leaders","content":"More than 250 women gathered at The Avalon Theatre on April 14, 2024, to celebrate the unveiling of the annual Women to Watch magazine, honoring over 200 local leaders from the Mid-Shore region. Kari Mielke Clow, principal at Chapel District Elementary, said the event highlights community work and powerful women in the community. Three featured speakers - Ivette Furneisen, Sharon Pepukayi, and Meisha Amia - shared their personal stories and advice to the audience, with Furneisen being from Barcelona and Pepukayi speaking about her path to becoming Talbot County Public Schools superintendent."},{"title":"Jousting season kicks off at Tuckahoe Equestrian Center","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe Eastern Shore Jousting Association held its first joust on May 25 at the Tuckahoe Equestrian Center. The Mid Atlantic Joust has been held for over 30 years, featuring jousters from neighboring counties and states. Winners included Michaella Patrick, Mackenzie Strong, Samantha Miller, and Janice Enfield in various classes. The next ESJA joust will be held at the Talbot County Fair on July 13."},{"title":"Chesapeake Film Festival, Talbot Library host film series","content":"The Chesapeake Film Festival and Talbot County Free Library are hosting a new monthly film series to celebrate their respective anniversaries. The series will feature films at the Easton Branch of the library, starting with \"Taste of Things\" (March 19), followed by \"River\" (April 30), \"Conclave\" (May 21), and \"Wicked\" (June 21). The screenings are free and open to the public, with no reservations required."},{"title":"Frederick Douglass' Valentine's Day birthday honored by his family","content":"Frederick Douglass never knew his exact birthday due to slavery's lack of record-keeping, but he celebrated on Valentine's Day as it was called \"his little Valentine\" by his mother. Born in 1818 in Talbot County, Maryland, Douglass fled slavery in 1838 and became a prominent abolitionist orator. His family, the Bailey-Groce Family Foundation, honors his legacy with annual birthday celebrations from February 14-20, featuring performances by relatives such as singer Ayla Dennis, to fundraise for African American Cultural Centers and Historical Societies."},{"title":"Maryland approves $2.75 million settlement for discrimination by state police","content":"Here is a summary of the article in 3 sentences:\n\nMaryland approved a $2.75 million settlement on October 2, 2024, after a federal investigation found discriminatory hiring practices by the Maryland State Police. The investigation, conducted by the U.S. Department of Justice, revealed that tests disproportionately impacted Black and female applicants, particularly physical fitness tests for women and written tests for Black candidates. The agency has committed to changing its testing methods to prevent future discrimination, with new policies expected to be in place after the next two MDSP classes start."},{"title":"Medical center, juvenile justice top priorities for Shore lawmakers","content":"Mid-Shore lawmakers prioritize securing funding for a new regional medical center and addressing juvenile justice reform impacts. Senator Johnny Mautz and Representatives Chris Adams and Tom Hutchinson discuss ways to advance progress in the 2024 General Assembly. The University of Maryland Shore Regional Health's proposed 147-bed hospital and medical office building aims to receive financial support from lawmakers, with a start of construction dependent on receiving a Certificate of Need from the Maryland Health Care Commission. Former Governor Larry Hogan earmarked $100 million for the project, while lawmakers secured $10 million in this year's budget. Talbot County officials express concerns about juvenile justice reform laws, including a 42% increase in youth crime and limitations on police interactions with minors."},{"title":"Talbot Board of Ed adds makeup day for snow; approves 2025-26 calendar","content":"The Talbot County Board of Education added a makeup day to this year's school calendar due to snow and approved a revised 180-day requirement. The board unanimously passed a new calendar for the 2025-26 school year with three options: two days off in March, five days for spring break, or an eight-day spring break. The final calendar was adopted with a 6-1 vote, featuring two inclement weather days in March and a five-day spring break."},{"title":"Bridge - Wait, Wait, but not for too long","content":"South and his partner North bid notrump after West overcalled in spades, with South planning to wait until he had sufficient data on club values before playing a club to dummy's king. He assumed East held the tripleton but cashed his heart winners instead, allowing him to acquire more information about West's distribution. This decision allowed South to claim the trick. The hand took place in September 2023, with West marking at least nine points in suit cards."},{"title":"TODAY IN HISTORY/Oct. 15","content":"On October 15:\n\n* Alyssa Milano tweeted \"Me too\" to support women who had been sexually harassed or assaulted in 2017.\n* Napoleon Bonaparte arrived on St. Helena in 1815 for his exile.\n* Pierre Laval was executed for treason in 1945, and Hermann Goering fatally poisoned himself before execution in 1946.\n* Hurricane Hazel made landfall on the Carolina coast as a Category 4 storm in 1954.\n* Walter F. Mondale and Bob Dole debated in Houston in 1976.\n* Clarence Thomas was confirmed to the U.S. Supreme Court despite Anita Hill's allegations in 1991.\n* Andy Green shattered the world's land-speed record driving a jet-powered car in Nevada in 1997.\n* A Staten Island ferry crashed into a pier, killing 11 and injuring 70, in 2003.\n* Notable birthdays include Jim Palmer, Richard Carpenter, Mira Nair, Sarah Ferguson, Emeril Lagasse, Dominic West, Ginuwine, Keyshia Cole, Bailee Madison, and others."},{"title":"Orioles sending nearly $8.5 million to teams involved in trade-deadline deals","content":"Baltimore Orioles sending $8,452,365 to four teams as part of five deals made ahead of trade deadline.\n- San Diego: $3,324,300, Ryan O'Hearn ($2,537,634), Ramón Laureano ($1,268,817)\n- Detroit: $2,758,065, Charlie Morton's salary reduction\n- Toronto: $1.75 million, Seranthony Domínguez' salary reduction\n- Houston: $520,000, Ramón Urías' salary reduction\n- Minnesota paid $33 million to Houston in July 31 trade involving Carlos Correa\n- Arizona paying Milwaukee $5,258,000 in four installments on different dates\n- Milwaukee sending San Diego $2,169,000 and Cincinnati paying Pittsburgh $1,935,484\n- Kansas City giving Kansas City $1,934,100 for Mike Yastzemski's salary reduction\n- Tampa Bay sending Milwaukee $1.1 million to Jadher Areinamo in July 28 trade"},{"title":"Talbot County removes DEI statement amid funding concerns for airport","content":"Talbot County removed its diversity, equity and inclusion statement from the employee handbook amid concerns over millions of dollars in federal funding for an ongoing airport project. The decision came after U.S. Department of Transportation Secretary Sean Duffy's April directive stating that DEI programs violate federal law. Council members voted 4-1 to remove the statement, with Keasha Haythe opposing. The resolution also voids two previous diversity resolutions and requests a replacement welcoming statement."},{"title":"Easton election cycle has been charged, political in nature","content":"Easton is experiencing a heated election cycle for three open Town Council seats, with campaigns involving stolen and vandalized signs, debates on transparency, and political mailers calling out Mayor Megan Cook. The race for Town Council president between incumbent Frank Gunsallus and Ward 2 representative Don Abbatiello has been marked by tense debates on civility. Local politicians such as Maureen Curry have endorsed Abbatiello, while Gunsallus has received endorsements from Republican leaders like Sheriff Joe Gamble and Senator Johnny Mautz."},{"title":"Legislators, local officials differ on unhoused individuals bill","content":"Here is a summary of the article in 2-5 concise sentences:\n\nDel. Bernice Mireku North has filed House Bill 487 to protect unhoused individuals from civil and criminal punishment on public land if they don't have an \"adequate alternative indoor\" space. Maryland's homeless population was 5,865 individuals in 2023, according to HUD data. Local officials like Talbot County Sheriff Joe Gamble and Easton Mayor Megan Cook oppose the bill, citing concerns over public safety, economic development, and local control. Advocates say the bill is needed to address the state's homelessness crisis and prioritize humane treatment of unhoused individuals."},{"title":"Local chef nominated for James Beard Award","content":"Bas Rouge Executive Chef Harley Peet has been named a semifinalist for best chef in the Mid-Atlantic region by the James Beard Foundation. He will be competing against other top chefs from the Mid-Atlantic region for the award, which recognizes exceptional talent and achievement in the culinary arts. The nominees will be announced on April 3, and winners will be announced at the James Beard Restaurant and Chef Awards Ceremony on June 10."},{"title":"Easton leans away from annexing new land in comprehensive plan update","content":"Easton's town council has chosen to retain language in its comprehensive plan update discouraging new annexations for the next 10 years. The town's growth rate, which slowed from 36% between 2000-2010 to 7% between 2010-2020, is expected to influence this decision. Easton Point, a redevelopment project that has stalled for nearly 20 years, may be an exception to the no-annexation rule due to its \"extraordinary\" nature. The town aims to establish a 1.14% annual growth rate and demands more thorough traffic reviews in future development projects."},{"title":"TRANSACTIONS 11-15-24","content":"Baltimore Orioles agreed to terms with RHP Robinson Martinez on a minor league contract. The Boston Red Sox hired Chris Holt as Bullpen Coach and agreed to terms with LHP Justin Wilson on a major league contract. The Chicago White Sox agreed to terms with OF Hendry Alcala on a minor league contract."},{"title":"Castro Rios scores twice, leads Colonel","content":"Colonel Richardson High's boys soccer team led by Senior Angel Castro Rios defeated North Dorchester 5-0 on September 18, 2024, improving to a 3-0 overall record and 2-0 in the North Bayside league."},{"title":"Easton Town Council vote on cannabis moratorium delayed - Tabled measure leads to heated discussion among council members","content":"Here is a summary of the article in 4 concise sentences:\n\nEaston Town Council President Frank Gunsallus delayed a vote on a proposed cannabis moratorium by three weeks at their October 16 meeting, prompting heated discussion among council members. The nine-month moratorium was originally slated for a public hearing and vote on September 18 but was tabled to allow all five council members to participate. Councilman David Montgomery objected to Gunsallus' decision, stating he did not have the authority to continue the discussion. The council will again table voting on the ordinance until November 6, with uncertainty remaining about the moratorium's duration and specifics."},{"title":"TWINS CELEBRATE 95TH","content":"Identical twin sisters Arline Zyvoloski and Corinne Bissell were born on August 28, 1928, in Springfield, Massachusetts. They spent their childhood living worldwide, including Hawaii, China, Australia, New Zealand, and the Philippines. Both married and started families, now celebrating their 95th birthday at Heartfields Assisted Living in Easton, Maryland."},{"title":"College junior feels jealous of friend","content":"Here is a summary of the article in 4 concise sentences:\n\nJealous College Junior Fights Envy and Moves Forward. Jealous, a college junior, struggles with feelings of jealousy towards her friend's recent successes in securing a $10,000 scholarship for a study abroad program in Japan and landing an internship at a top investment banking firm. Harriette Cole advises Jealous to focus on herself, view life as a challenge, and claim small victories through creating a vision board. Jealous should wish well for others' success while pivoting back to planning her own life."},{"title":"Pastoral Ponderings: Thanks for blessing received","content":"The article by Denzil Cheek, published in the Star Democrat on February 8, 2024, discusses prayer and blessings received. A humorous example of a modern prayer is presented, followed by a question about where people express thanks for their blessings. The author emphasizes the importance of prayer as a core value in personal and church life."},{"title":"Port Street housing project nearing completion","content":"The Port Street Commons housing project in Easton, MD, is nearing completion with nine affordable units and a new headquarters for The Arc Central Chesapeake Region. Construction began in June 2022 and is expected to finish by October 2024. Jonathon Rondeau, president and CEO of The Arc, aims to provide immediate assistance to those in need of housing in the Easton area. A ribbon-cutting ceremony is planned for November 7, with the first tenants moving in on December 1."},{"title":"Don't throw a tizzy. Come to Tilghman","content":"Gina Lee Werner opened a restaurant on Tilghman Island in November 2024, called Gina's at the Bridge, which is situated next to the historic Tilghman Island Drawbridge. The Werners plan to provide shuttle services from St. Michaels and beyond using a new shuttle van named \"The Tizzy\" starting next week, and a center console boat for water transportation. Gina Lee Werner has over 20 years of restaurant experience and emphasizes extreme freshness through local sourcing and community relationships with artists and businesses. The Werners' husband Michael Joseph Werner calls their approach \"Ginafying.\""},{"title":"Traffic concerns derail proposed apartment complex - Board of Zoning Appeals denies Aspire Apartments' special exception request","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe Easton Board of Zoning Appeals denied Aspire Apartments' special exception request to use a property off Mathewstown Road as a multifamily apartment complex. The project, proposed by Derick Daly, would have included six buildings with 162 units, but was rejected due to concerns over traffic and congestion. The board's decision was unanimous, and Daly plans to make adjustments to his proposal and resubmit it in less than a year. The denial means that the town's zoning ordinance requires a one-year wait before reconsidering the application, or allowing for a substantially different proposal."},{"title":"Filing auto insurance claims","content":"Mary Hunt wrote an article for The Star Democrat on November 15, 2023. Key points include:\n\nCar insurance companies may increase premiums or cancel coverage if a claim is filed.\nThere are situations where filing an auto insurance claim is necessary, including:\n- Injuries to yourself or others\n- Damage to vehicles or property\n- Contacting the insurer after a crash with another driver, especially when fault isn't clear.\nFiling a claim in these situations ensures coverage applies and prevents unexpected bills or lawsuits.\nIn contrast, not filing a claim may protect premiums for drivers who are only involved and have minor damage."},{"title":"Bucs, Sabres set sights on titles","content":"The Sabres' boys lacrosse team has already faced top-ranked teams in its first five games of the regular season. Head coach Todd Wolters is focused on preparing for another run at a Maryland Interscholastic Athletic Association B Conference title. Kent Island's Bobby Woolley has been impressed with his team's performance in preseason, while Easton's Dennis Keenan looks to send off as a winner despite graduating most of its firepower. New head coaches Ben Joiner and Teddy Peyton will lead Gunston and North Dorchester, respectively."},{"title":"The IRS deserves good leadership","content":"Billy Long, the IRS commissioner from Missouri who served for two months, has left his position and is expected to be nominated as U.S. Ambassador to Iceland. He had little tax expertise before being chosen by the president in 2025. The IRS has experienced a decline in morale due to his leadership, with thousands of employees leaving since January. Despite this, over 266 million tax returns were filed with the IRS in fiscal year 2024, collecting $98 billion in enforcement revenue."},{"title":"Legislation seeks to make persimmons the state fruit","content":"Sen. Arthur Ellis introduced a bill to make persimmons the state fruit of Maryland on January 3, 2024. Persimmons are native to the state and have been used for food, medicine, and other purposes by indigenous people and during the Civil War. The fruit is now worth around $6 per pound, with Ellis stating he has trees in his yard that grow naturally. If Senate Bill 74 passes, it would become effective October 1."},{"title":"From the courtroom to the Chesapeake, 'The Judge' leaves a lasting legacy","content":"Here is a summary of the article in 4 sentences:\n\nJohn North died on September 19, 2025, at age 94. He was a well-respected judge who also served as Talbot County state's attorney and chairman of the Maryland Critical Area Commission. North played a crucial role in protecting the Chesapeake Bay's health and implementing local critical area programs. He was known for his fairness, loyalty, and compassion, leaving behind a legacy that is remembered by family, friends, and the community, including through his work with the Chesapeake Bay Maritime Museum and the St. Michaels Concours d'Elegance."},{"title":"Trappe Planning Commission approves changes to Lakeside plans","content":"The Trappe Planning Commission approved changes to the Lakeside Wastewater Treatment Plant plan on August 28, 2024. The Talbot County Health Department and Maryland Department of the Environment requested two changes: one related to the signature approval block and the other to combine three lots for spray irrigation into a single parcel. The commission unanimously approved the motion to authorize Commission President Edgar to sign the revised plans upon Health Department and MDE approval."},{"title":"Encounter with Jimmy Carter provides memories","content":"Linda Evans met Jimmy Carter at a cherry blossom event in Washington D.C.'s Tidal Basin in the mid-1970s as part of her job as a personal assistant to George Romney. She was mistaken for Mitt Romney's sister Lynn and shook President Carter's hand, saying \"Thank you for being our president.\" A Secret Service employee had arranged for her to meet the president, and he took a photo with her. Years later, Evans contacted White House Press Secretary Karl Schumaker who claimed to have three photos of her that he would mail or allow her to pick up at the White House."},{"title":"Easton considers ordinance to crack down on seafood processing odors","content":"Here is a concise summary of the article:\n\nThe Easton Town Council is considering an ordinance to regulate seafood processing odors in response to complaints from residents living near Chesapeake Brand Seafood on Maryland Avenue. The proposed ordinance would restrict seafood processing in residential areas and require odor control technology, with existing businesses given six months to comply. Councilmembers have mixed views on the proposal, with some expressing concerns about the impact on smaller businesses and others advocating for stricter regulations to alleviate resident complaints."},{"title":"Bridge - The exception to the rule","content":"A bridge player bid three notrump to keep a vulnerable game alive with partner's help. Declarer played low clubs to deny East cashing his top suits. West won one trick but was forced to concede the next with declarer's heart king, ultimately losing the game. This unusual deal highlights how exceptions can occur in bridge despite conventional strategies."},{"title":"Mid-Shore could see highs in upper 90s as heat wave approaches","content":"Here is a summary of the article in 4 concise sentences:\n\nMid-Shore counties in Maryland, including Caroline and Talbot, are expected to see temperatures near triple digits from Sunday through Wednesday. The Dorchester County Health Department advises vulnerable groups such as babies, older adults, and pregnant women to take precautions during heatwaves. Easton Fire Chief J.R. Dobson asks residents for water donations due to the physically intensive work of firefighting; local departments are working together to respond to emergencies. Maryland Secretary of Health Dr. Meena Seshamani reminds parents to never leave children in cars during heatwaves."},{"title":"Knox, Easton top Pocomoke, 2-1","content":"Easton High field hockey beat Pocomoke City 2-1 on October 8, 2025, with goals from Addie Knox and Lily Tiebosch. Taylor Bowen made eight saves in the game. The win improves Easton's record to 6-3."},{"title":"James saves U.S. from big upset","content":"LeBron James saved the U.S. Olympic team from a stunning loss with an 8-second layup that gave the Americans a 101-100 win over South Sudan in London on July 20, 2024. The U.S. team, led by LeBron James and Anthony Davis, rallied from a 16-point deficit to avoid a possible upset against the African nation. Carlik Jones' runner off the glass missed with about 4 seconds left, allowing the Americans to escape with the win."},{"title":"Limits on how much a drug should cost","content":"The US government has released a list of 10 medications, including Enbrel, that will be subject to price negotiations under the Medicare reform bill. The list includes medications taken by millions of people and those costing billions to develop, with Enbrel's cost exceeding $1,700 per pen. President Joe Biden announced the start of new negotiations aimed at giving voice to patients and saving Medicare more than $100 billion over 10 years."},{"title":"Delmarva Pride Center brings new world with Dungeons and Dragons","content":"The Delmarva Pride Center hosts an open Dungeons & Dragons game on the fourth Saturday of each month, providing a safe space for LGBTQ+ community members and allies to explore gender identity, sexuality, and imagination. The center's host, Lauren Fierman, acts as dungeon master and ensures player comfort and respect for personal boundaries. Players have found the game helpful in exploring their identities and building LGBTQ+ representation in media. The Delmarva Pride Center offers various monthly events, including Gender Expression Movement and Elder and Intergeneration Social."},{"title":"The Zebra Gallery: a place for 'evolutionary' artists","content":"Susa Schauer opened The Zebra Gallery in Easton, MD, which features \"evolutionary\" art and artists, including those with disabilities, such as her daughter-in-law's grandson, who has Ehlers Danlos Syndrome. Schauer was diagnosed with cancer during the COVID-19 pandemic but used it as an opportunity to create her dream gallery. She aims to support local and international artists with a contemporary spin on traditional art, also giving 10% of proceeds to Ehlers Danlos research. The Zebra Gallery has featured artists Ingrid Matuszewski and Adam Himoff, who praised Schauer's energy and enthusiasm for their work."},{"title":"'A testament to our shared values' - Easton Mayor's Prayer Breakfast marks 40th anniversary Oct. 26","content":"Easton Mayor Megan Cook hosted the 40th annual prayer breakfast, bringing together about 150 local leaders to pray and connect over a buffet breakfast at the Tidewater Inn on October 26. The event marked a milestone in fostering community values. Guest speakers Claudia Reyes and Linda Saathoff Brown shared their testimonies of faith and God's healing presence in their lives. Honored guests included former Mayor Robert Willey and State Sen. Johnny Mautz, who presented official citations for Cook and Willey."},{"title":"Trump steps up push for federal defunding of NPR, PBS","content":"Here is a summary of the article in 2-5 concise sentences:\n\nU.S. President Donald Trump is pushing for federal funding to be eliminated for National Public Radio (NPR) and Public Broadcasting Service (PBS) stations. Congressional Republicans, including U.S. Rep. Marjorie Taylor Greene, are also backing the effort to defund NPR and PBS. The Corporation for Public Broadcasting (CPB), which helps fund PBS and NPR stations nationwide, received $535 million in the most recent annual federal budget. Defunding CPB would have dire consequences for public broadcasting, particularly for rural areas that rely heavily on public media outlets."},{"title":"McCall, Sabres roll past Dragons again","content":"Avery McCall scored 29 points and grabbed 20 rebounds as Sts. Peter and Paul High's girls basketball team beat Salisbury School's Dragons 53-32 on January 31, 2025. Junior Kaylin Palmer added eight points and 14 boards for the Sabres. The win extended their Eastern Shore Independent Athletic Conference win streak to four games, improving their record to 8-8 overall."},{"title":"Star Democrat delivery delayed","content":"Production of the November 23, 2024 Star Democrat was delayed due to mechanical issues. The newspaper is expected to be delivered by noon for carriers and likely not arrive via postal service until Monday. The e-edition is available now and can be accessed online."},{"title":"Celebrating Hispanic art and artists with poster contest","content":"The Academy Art Museum in Easton hosted a poster competition celebrating Hispanic cultural heritage with a theme of \"Ser Hispano, es Ser Valiente\" (\"Being Hispanic is Being Brave\"). The Chesapeake Multicultural Resource Center invited community members to participate, and the top three winners were selected from a variety of ages and ethnicities. The first-place winner was Piper Hambleton and Ellis Williams' collaborative poster featuring a tree with flags from every Latin American and Hispanic country attached to its branches. The competition included works by Albert Gamez, Ahias Murillo, and Majo Arrivillaga, who spoke about the importance of representing the Latino community through art."},{"title":"Interim executive director named for Chesapeake Music","content":"Margaret Enloe-North was named Interim Executive Director of Chesapeake Music in September 2023. She brings 30 years of nonprofit experience to the role. Based in Easton, MD, Chesapeake Music has been hosting concerts since its founding over 35 years ago."},{"title":"25-year-old set to bike from Easton to Canada","content":"Hayden Kessinger, 25, will bike from Easton to Canada starting June 14, 2025. He previously biked from Baltimore to San Francisco in 70 days in 2023. The ride is motivated by Chris Guillebeau's book \"The Happiness of Pursuit\". Kessinger plans to use Warm Showers app to coordinate sleeping arrangements and meet new people for support."},{"title":"Talbot County resident named to Maryland Humanities board","content":"Jill Ferris, a resident of Talbot County and vice president of education and interpretation at the Chesapeake Bay Maritime Museum, was named to the Maryland Humanities board in November 2023. Ferris previously received awards from Maryland History Day and Colgate University for her teaching work, and holds a master's degree in history museum studies from the Cooperstown Graduate Program."},{"title":"Easton minister detained by ICE","content":"Daniel Fuentes Espinal, a Honduran-born minister from Easton, MD, was detained by ICE agents on July 22, 2025, while stopping for material at Lowe's; he has been held at the Baltimore ICE detention center since. Espinal had lived in the US since 2001 and served as minister of Iglesia del Nazareno Jesús Te Ama since 2015; his family is trying to obtain citizenship legally but have faced backlogs and expenses. Espinal has no criminal record, with over 600 immigrants arrested in Maryland under President Trump having also had no prior charges."},{"title":"Salt truck crews work to keep ice at bay and local businesses open","content":"Here is a summary of the article in 5 sentences:\n\nDarrell Doupnik's landscaping company Greenshore provides salt and snow plow services to local businesses in Easton, MD, for 40 years. On January 19, 2024, his team worked to clear ice from walkways and parking lots despite icy weather, using over 100 bags of salt. Foreman Jerry Widener has 15 years of experience with winter weather and used this knowledge to manage the workload. The storm brought 3-4 inches of snow to Easton, but Doupnik's team found it manageable. The company provides essential services to commercial clients, including banks, schools, and churches, which often show appreciation for their hard work."},{"title":"Songs about the water - Chesapeake Bay Maritime Museum continues Changing Chesapeake series","content":"Peter Panyon and his band Big Tribe will present \"Songs About the Water\" at the Chesapeake Bay Maritime Museum's Van Lennep Auditorium on September 28. The concert features songs inspired by local rivers, including \"Can't Work the River,\" which tells a waterman's struggles with the Patuxent River. Panyon, a biologist professor turned musician, has written hundreds of songs drawing from his experiences teaching biology and exploring themes related to valuing our waterways."},{"title":"Be careful what you vote for","content":"Here is a summary of the article in 2-5 concise sentences:\n\nLarry Pifer wrote about the potential risks of authoritarian governments, including those led by Donald Trump. Trump claimed he would be a \"dictator but only for a short time,\" raising concerns among Americans. He also failed to fulfill many promises made during his first presidential run, such as building a wall with Mexico paying for it and repealing Obamacare. The article warns voters to be cautious of politicians who don't keep their promises and notes that it's difficult to get rid of dictators once elected."},{"title":"TV LISTINGS 11-14-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\n* The TV listings for Thursday, Nov. 14 include men's college basketball games between Grand Canyon and Arizona St., Creighton at Kansas St., and Utah at Northwestern.\n* Additional sports events are scheduled, including college football matches, soccer tournaments, and women's volleyball games.\n* Golf tournaments, horse racing events, and NBA games are also listed for the day.\n* Other international soccer matches, including UEFA Nations League Group Stage and CONCACAF Nations League quarterfinals, are scheduled."},{"title":"'Heartbeat of Easton Utilities' legacy lives on","content":"Vicki Petro retired as vice president of human resources at Easton Utilities on January 13, 2025, after 31 years of service. She began with the organization in 1993 and has shaped the careers of countless employees, overseeing the hiring of 324 individuals during her tenure. Vicki's impact extends beyond Easton Utilities, influencing professionals across Maryland through her Leadership Maryland classes."},{"title":"Lesher withdraws name from Easton Utilities Commission consideration","content":"Pete Lesher withdrew his name from consideration for the Easton Utilities Commission on March 12, 2025, following concerns over dual representation as Talbot County Council Vice President and utilities commissioner. The decision was made after a lengthy discussion by the town council, which raised questions about the legality of serving on both bodies under state law."},{"title":"Meet the Wednesday Morning Artists","content":"A group of artists gathers every Wednesday at Peachblossom Place in Easton, MD, showcasing their hand-made jewelry, woodworking, and pottery from 9:30 a.m. to 10 a.m. Artist Bill Pavin received encouragement from the group before speaking in front of elected officials in Washington, D.C., advocating for funding of rare diseases research. The meeting takes place on September 17, 2025, with members also enjoying coffee and interacting with their pets, including Robert Gladney's mastiff, Basil."},{"title":"Juvenile crime, reform are top issues for Talbot County police","content":"Here is a summary of the article in 4 concise sentences:\n\nTalbot County police reported a 19% increase in calls for service and a 13% increase in reported crime handled by the sheriff's office, including increases in juvenile crimes, petty thefts, and some violent crimes. Sheriff Joe Gamble identified juvenile crimes in schools as a particular issue, citing Easton High School and Middle School as hotspots. Easton Police Chief Alan Lowrey discussed recent local incidents, including homicides, burglaries, and crime on the Rails to Trails pathways, and plans to increase patrols and citations to address concerns. Other police departments in Talbot County reported few issues, with St. Michaels Police Chief Jeffrey Oswald noting two car thefts and Oxford Police Chief Eric Kellner saying his town is \"very safe.\""},{"title":"'Vision from the beginning': BAAM leaders excited for new academic center","content":"Here is a summary of the article in 5 concise sentences:\n\nBuilding African American Minds Inc.'s new academic center will be officially opened on December 14, 2024, with a ribbon-cutting ceremony. The center, located on Jowite Street in Easton, Maryland, will serve as a hub for after-school and summer enrichment programs. Dina Daly, executive director of Building African American Minds, hopes the center will expand her organization's reach beyond under-resourced youth in nearby neighborhoods. The facility will host classrooms, a library, media center, and multipurpose dining room on the first floor, with adult workforce programs and GED classes also being offered. Private donors, community donations, and state and federal funding made the $10 million project possible."},{"title":"AL GLANCE 4-21-24","content":"April 20, 2024: The current MLB standings are as follows:\n- East Division: New York (14-7), Baltimore (12-7), Toronto (11-9), Boston (12-10), Tampa Bay (12-10)\n- Central Division: Cleveland (14-6), Kansas City (13-7), Detroit (11-10), Minnesota (7-12), Chicago (3-16)\n- West Division: Texas (11-10), Seattle (9-10), Los Angeles (9-11), Oakland (8-12), Houston (7-15)\n\nFriday's games:\n- Cincinnati 7, L.A. Angels 1\n- Philadelphia 7, Chicago White Sox 0\n- Boston 8, Pittsburgh 1\n- Cleveland 10, Oakland 2\n- Houston 5, Washington 3\n- N.Y. Yankees 5, Tampa Bay 3\n- Atlanta 8, Texas 3\n- Kansas City 9, Baltimore 4\n- Detroit 5, Minnesota 4\n- Toronto 5, San Diego 1"},{"title":"Eating out on a tight budget","content":"Mary Hunt suggests combining quick-service food with home cooking to create \"semi-homemade\" meals on a tight budget. She recommends purchasing premade pizza dough from local stores and supermarkets for $3.50-$3.49, allowing for affordable pizzas at home. Independent pizza shops may also sell their own dough, making it easier to find a reliable source."},{"title":"No end to this game?","content":"Here is a summary of the article in 3 sentences:\n\nThe Town of Trappe's attempt to control growth through new legislation by the Lesher/Melkie team has been met with criticism for its unclear agenda and potential to prolong the process. The proposed resolution rehashed previous attempts, sparking concern that it aims to maintain minority control over Lakeside development. Residents, including Michael Sullivan, express frustration over the lack of transparency in government spending and urge the county council to focus on the positives of planned development rather than dwelling on negatives."},{"title":"'Spirit of the Shore' CBMM celebrating Watermen's Appreciation Day","content":"Chesapeake Bay Maritime Museum (CBMM) is celebrating Watermen's Appreciation Day in St. Michaels on August 11 with a 10am-4pm event. The event honors the men and women who work on the Chesapeake Bay, including harvesting crabs and oysters, and features a boat docking contest, steamed crabs, live music, and kids activities. CBMM is partnering with the Talbot Waterman Association for the event. Tickets are available online or at the door, with discounted pricing for members."},{"title":"TV LISTINGS 7-24-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nJuly 24, 2024: TV listings include horse racing on NYRA's Saratoga Live at 1 p.m., MLB regional coverage and baseball games including Baltimore at Miami and N.Y. Mets at N.Y. Yankees. Men's soccer includes CONCACAF U-20 Championship Group Stage and Club Friendly matches, as well as tennis tournaments in Kitzbuhel, Umag, Iasi, and Prague. The Basketball Tournament features TBT Round of 16 matches, while the Olympics include handball, rugby, and men's soccer competitions starting at 3 a.m. on Thursday."},{"title":"It's time for Mid-Shore regional planning","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe Greater Baltimore Committee released a new 10-year strategic plan calling for economic development changes in Baltimore city and five Maryland counties. The new plan aims to boost economic opportunity through collaboration between businesses, leaders, developers, and stakeholders. Chesapeake College is suggested as an outstanding organization to lead regional economic development efforts in the Mid-Shore region."},{"title":"Texas tragedy has shown worst of American society","content":"A flash flood tragedy in central Texas resulted in an outpouring of sympathy and support from Americans, but also saw numerous vile messages on social media blaming Trump supporters or policy decisions for the tragedy. Former national co-chair Nina Turner called these responses \"shameful,\" while Pod Save America co-hosts John Favreau and Tommy Vietor condemned similar posts as lacking civility. Sen. Chuck Schumer demanded an investigation into weather service vacancies, but Favreau challenged suggestions that staffing levels were directly responsible. The article emphasizes the need for social media users to prioritize decency and respect in their reactions to tragedies like this one."},{"title":"Irene Gurka","content":"Irene Gurka, nee Myshak, died December 16 at Hospice House in Easton, MD. She was born and raised in Jermyn, Pennsylvania, and was a member of St. Michael's Orthodox Church, Jermyn, and St. Thekla Orthodox Church, Easton. Irene celebrated her 100th birthday in September and is survived by family members including two daughters, three grandsons, and four great-grandchildren."},{"title":"Life - Rotarians Holding Food Drive In Honor Of Late Lord Scott","content":"The Rotary Club of Easton and community partners are hosting a \"Drop for Scotty\" food drive through December 31 to honor late Lord Scott Sr., who passed away in January 2020. The food drive is named after Scott, who hosted Operation Christmas Spirit since the 1970s, providing meals and gifts to local children. Donations can be dropped off at designated sites or made financially through dropforscotty.com."},{"title":"Suicide of a superpower","content":"Here is a concise summary of the article:\n\nUS President Trump's cost-cutting measures are harming America's military power by reducing government-funded research programs and universities. Key players in developing the atomic bomb were universities such as Princeton, University of Chicago, Columbia, and Berkeley. US reliance on scientific advancements will be crucial in future conflicts, which will feature high-tech systems."},{"title":"Bridge - Try to reduce your assets","content":"Mark Twain wrote \"Tell the truth or trump - but get the trick.\" In a Bridge game against East's spades led by the club ace, South made a farsighted play of immediately cashing dummy's heart ace and ruffing a heart in their hand. West had raised to game with two top trump honors, leaving declarer (South) concerned about his trump length. South cashed diamond tricks, eventually winning a trump coup against East."},{"title":"States apart, Waterfowl artists build lasting friendships","content":"Jim Green and his wife Kara traveled from Hermosa, South Dakota to Easton, Maryland for the Waterfowl Festival. Carol Heiman-Greene and her husband are friends with the Greens, who have been exhibiting at the festival for a decade. The two couples attend the festival annually, describing it as a \"family\" of artists who welcome newcomers into their group. Jim Green values the creative exchange and camaraderie among fellow artists, which helps him expand his work."},{"title":"Festivals Coming To Chesapeake Bay Maritime Museum - Festivals","content":"The Chesapeake Bay Maritime Museum is hosting two festivals: OysterFest on October 28 and the Eastern Shore Sea Glass & Coastal Arts Festival's Holiday Edition on November 18. OysterFest features oysters, live music, kids' activities, and a raw oyster competition. The festival will also showcase guest speakers related to \"The Changing Chesapeake\" and feature exhibits from CBMM."},{"title":"Drivers need patience on roadways","content":"Drivers in Talbot County and Easton need to exercise patience on roadways due to challenging driving conditions such as narrow streets, double parking, and large vehicles. 70-year-old senior driver Joel S. Strobeck is frustrated with younger drivers' impatience, including honking horns, tailgating, and passing on the right side. Strobeck expects younger drivers will become senior drivers themselves and understand the need for extra time to react safely."},{"title":"New art exhibit critiques America's 'consumption culture'","content":"Marty Two Bulls Jr.'s exhibition \"Dominion\" opens at the Academy Art Museum in Easton, MD on September 15, 2023 and runs through August 2024. The exhibit critiques America's consumption culture using the metaphor of the American Bison. Marty Two Bulls Jr., a South Dakota-based Oglaia Lakota artist, created the immersive installation which features QR codes with historical information about its elements."},{"title":"Crusaders extend mastery over Sabres","content":"Here is a summary of the article in 4 concise sentences:\n\nSam Gerdano's Sts. Peter & Paul Crusaders defeated Sabres 5-2 on February 7, 2025, at the Talbot Community Center to clinch second seed in the MIAA B Conference playoffs. Mason Kaplan netted a hat trick and helped set up two goals for Casey Burkom as Sts. Peter & Paul controlled the neutral zone early. The Crusaders led 4-1 before Buel Jenson scored an unassisted goal with 6:45 left to make it 5-2, their final lead. Gerdano's team is seeking confidence and scoring ways after a brief slump."},{"title":"An age in America comes to an end","content":"Here is a summary of the article in 4 sentences:\n\nOroville, California, became a shadow of its former self after gold was discovered there in 1848 and eventually petered out by 1900. In 1911, a Native American named Ishi, the last living member of the Yahi tribe, arrived in Oroville and was taken into custody. Anthropologist Alfred Kroeber took Ishi under his care at UC Berkeley, where he worked as a janitor for five years, adapting to modern life despite his traumatic past. Kroeber's wife, Theodora Kracaw Kroeber, wrote the classic anthropological book \"Ishi in Two Worlds\" about their time with Ishi, describing his remarkable resilience and dignity in the face of cultural change."},{"title":"Thoughts on smart phone restrictions in schools","content":"Here is a summary of the article in 2-5 concise sentences:\n\nSocial psychologist Jonathan Stephen Haidt suggests that smartphone restrictions in schools are not addressing the root causes of anxiety and depression among American youth, citing his book \"The Anxious Generation\". The decline of play-based childhood, rise of phone-based childhood, and over-reliance on technology have contributed to this trend. Haidt recommends delaying smartphone use until high school, giving children basic phones instead of smartphones, and limiting social media access. Despite efforts to limit screen time, parents and guardians must take responsibility for making decisions that benefit their children's well-being."},{"title":"Annual Back to School Resource Fair: Preparing students for success","content":"Here is a summary of the article in 2-5 concise sentences:\n\nFor All Seasons hosted an annual Back to School Resource Fair at Idlewild Park on August 22, 2024, partnering with the Talbot County Department of Social Services. The event provided hundreds of pre-stuffed backpacks with school supplies and hundreds of children's books from organizations such as Appleseed Books. Over 1,700 people attended, including families in need who received essential items. For All Seasons CEO Beth Anne Dorman said the event sets students up for success by addressing mental health and providing community support. The event has grown significantly since its origin six years ago and will expand next year due to overcrowding."},{"title":"Talbot Interfaith Shelter's Lip Sync Battle returns","content":"Talbot Interfaith Shelter's eighth annual Lip Sync Battle Fundraiser will be held on April 27 at the Waterfowl Building in Easton, MD. The event aims to raise $100,000 and features 19 teams competing for top fundraiser title, including local business owners, school faculty, and community leaders. A panel of judges led by County Council member Keasha Haythe will score each team."},{"title":"TV LISTINGS 7-21-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nFormula 1's Hungarian Grand Prix airs on ESPNU at 8:55 a.m. on July 21. The NBA Summer League Tournament continues with games including L.A. Clippers vs. Memphis at 2 p.m. and Toronto vs. San Antonio at 7 p.m. on July 21, and the championship game is scheduled for July 22 at 9 p.m. on ESPN. Other sports include the Open Championship golf tournament and the NHRA Northwest Nationals on NBC and FOX respectively. The B.C. Lions take on the Calgary Stampeders in a CFL football matchup on CBSSN."},{"title":"Chesapeake Bay Maritime Museum celebrates 60 years","content":"The Chesapeake Bay Maritime Museum is celebrating its 60th year, opening in 1965 at Navy Point with two buildings and becoming accredited in 1978. Pete Lesher, chief historian, said the museum was created by a community effort to preserve the region's history. The museum now features exhibits such as Sailing to Freedom, which highlights the Underground Railroad on the water, and plans to honor African American business owners William Coulbourne and Frederick Jewett with its education building name change."},{"title":"Schmidt's seven goals pace Easton rout","content":"Here is a concise summary of the article:\n\nDrew Schmidt scored seven goals and set up another as Easton High beat Kent County 15-4 on April 17, 2024. Cambridge-South Dorchester won its first game of the season with five hat tricks, including Luke Reinbold's five goals against Wicomico 0-21. North Caroline defeated Parkside 15-8 in girls lacrosse, while Saints Peter and Paul beat Worcester Prep 17-2. St. Michaels beat North Dorchester 12-0 in baseball, and Jewels Vroman threw a complete game one-hitter as North Dorchester won 11-1 in softball."},{"title":"Clow's winning goal lift Easton","content":"Easton High's field hockey team defeated James M. Bennett 4-3 in overtime on September 10, 2025. McKenna Clow scored the game-winning goal set up by Ryann Quicke and assisted by Addie Knox. The Warriors' Taylor Bowen made six saves in the win. Easton improved to a 2-1 record."},{"title":"Keeping things frugal pays off","content":"Here is a summary of the article in 4 sentences:\n\nMary Hunt encourages readers to adopt frugal habits after noticing an impact on her spending over the past six months. Tips shared by readers include decluttering and organizing (Millie), creating \"Everything But the Kitchen Sink Soup\" to use up fridge items before they expire (Erica), and using grocery delivery services (Molly). Molly, who started using grocery delivery during the pandemic, has reduced impulse buys and eliminated junk food purchases. These frugal practices are expected to help readers save money on basic consumer goods."},{"title":"TODAY IN HISTORY/June 18","content":"Here is a summary of the article in 2-5 concise sentences:\n\nJune 18, 1778 - American forces entered Philadelphia during the Revolutionary War. June 18, 1812 - The United States Congress approved and President James Madison signed a declaration of war against Britain, starting the War of 1812."},{"title":"St. Michaels Police Chief says salaries need to be raised for officer recruitment, retention","content":"St. Michaels Police Chief Jeffrey Oswald said the police department will lose an 18-year veteran officer due to better pay. The St. Michaels Police Department is operating with four officers after three left, including one for a larger department's higher salary and opportunities. Town Manager Don Richardson suggested hiring a recruiting firm and raising wages with potential costs of over $200,000. Commissioners agreed to draft legislation allowing for salary amendments to make the police department competitive in hiring and retention."},{"title":"NL GLANCE 5-5-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe MLB National League standings (as of May 4, 2024) are as follows: East Division leaders Philadelphia and Atlanta, Central Division leaders Milwaukee and Chicago, and West Division leader Los Angeles. The top teams are separated by several games in their respective divisions. This week's schedule includes various matchups between teams."},{"title":"Talbot OKs bill to begin accepting cannabis funds","content":"The Talbot County Council approved a bill on October 14, 2025, allowing it to accept $730,000 from Maryland's Cannabis Reinvestment and Repair Fund. The county will use the funds for community-based initiatives, such as after-school programs, behavioral health services, and housing prevention. Council member Lynn Mielke abstained from voting."},{"title":"'Proven leader': Easton will soon welcome Kitzrow as new town manager","content":"Easton will welcome Andy Kitzrow as its new town manager starting July 7. Kitzrow was chosen by Mayor Megan Cook after conducting full-day interviews with four finalists and is expected to oversee town operations, lead department heads, and be a point of contact with the mayor and Town Council members. Kitzrow, current Salisbury city administrator, has experience working under three different mayors in Salisbury, including Jake Day and Randy Taylor, who will benefit from his connections as he takes on Easton's housing challenges."},{"title":"Letters To The Editor","content":"Letters To The Editor from Sept. 29, 2023. A response to David Reel's OpEd calls it \"characteristic of the post-2016 American Enterprise sandwich\" and criticizes its lack of transparency regarding the author's affiliation with the American Enterprise Institute. Holly Wright writes about the need for quality education in Baltimore, citing poor school performance rates and lack of accountability from local leaders. She proposes setting a 50% goal for student reading and math proficiency by 2026."},{"title":"Plea hearing is scheduled for Rider case","content":"Fred \"Trey\" Rider III is scheduled for a plea hearing on August 19 and a sentencing hearing on October 19, related to setting his house on fire in November 2022. Talbot County Assistant State's Attorney Jennifer Wilson said Rider plans to plead guilty to first-degree arson and five counts of reckless endangerment. Rider's divorce proceedings with Kari Rider are parallel to this case, and it may affect sentencing. The state may seek restitution, but this has not been determined."},{"title":"Easton planners: amid affordable housing shortage, inclusionary zoning may be useful","content":"Here is a concise summary of the article:\n\nEaston planners consider inclusionary zoning to address affordable housing shortage in Easton and Talbot County, with 42% of workers commuting from adjacent counties due to unaffordable housing prices. The proposed ordinance would require residential developers to allocate 15% of units as affordable, with prices capped at area median income levels. Town leaders, including Mayor Megan Cook, believe the ordinance is a critical step in addressing the shortage and promoting mixed-income projects to reduce housing inequities."},{"title":"Police arrest man on charges in overdose","content":"A Henderson man, Justin A. Bodman, was arrested on September 28, 2023, for manslaughter and narcotic distribution in connection to an overdose death in Easton that occurred on September 5, 2022. Elina Lazarieva, 23, of Easton, had previously been arrested on August 2, 2023, on similar charges in Baltimore. The duo allegedly sold heroin to Cristian Gonzales, who overdosed and died. Bodman was turned over to the Talbot County Detention Center, while Lazarieva was released on bond on September 12, with her case scheduled for a jury trial in January."},{"title":"Free family fun to ring in the new year at First Night Talbot","content":"First Night Talbot will mark its 30th year on December 31, offering free family-friendly fun in Easton, MD. The event starts at 6 p.m. and features performances by Improv Easton, Mike Elzey's Guitar Studio students, and more. The main event is the crab drop at 9 p.m., followed by another drop at midnight. Free collectible buttons will be available at the Easton Visitor Center."},{"title":"TV LISTINGS 12-20-24","content":"Here is a concise summary of the article:\n\n- December 19, 20, 24\n- Sports events:\n  - Chris Paul HBCU Challenge: Norfolk St., Grambling St., Delaware St., Alabama St.\n  - Men's and women's college basketball games\n  - College football games (DNA Cure Bowl, Union Home Mortgage Gasparilla Bowl)\n  - Golf tournaments (AfrAsia Bank Mauritius Open, PNC Championship Pro-Am)\n- Horse racing: NYRA's America's Day at the Races\n- NBA games: Milwaukee at Cleveland\n- Winter Showcase G-League games\n- Tennis: Next Gen ATP Finals"},{"title":"Museum seeks information on mystery device","content":"Here is a concise summary of the article:\n\nVolunteers at Trappe's Rural Life Museum are seeking information on an antique wooden device left on museum grounds, which appears to have been used as a press with metal hardware and non-structural boards. The device was found in the Carriage House building, which is undergoing renovation that began in 2021 after being damaged in a storm in 2020. President of the museum's board of directors Elizabeth Ferguson posted a picture on social media seeking information on the device's source and original use."},{"title":"APG Media of Chesapeake wins 19 press association awards","content":"APG Media of Chesapeake won 19 press association awards in 16 categories at the Maryland-Delaware-DC Press Association's annual ceremony in Annapolis on May 3, 2024. The awards included a total of nine for The Star Democrat, with Maggie Trovato and Connie Connolly taking home first place wins, and Meredith Moore winning top prizes in two special section categories. Other winners include Matt Hubbard, Patrick LaPorte, Carl Hamilton, Mike Reid, Josh Shannon, and the Star Democrat's marketing team, with APG Chesapeake Executive Editor Jim Johnson expressing pride in the staff's work."},{"title":"CBMM events: 'Year on the Water', Watermen tales","content":"The Chesapeake Bay Maritime Museum in St. Michaels will host two events on January 9 and November is not mentioned - instead January 11. \nOn January 9, a \"Year on the Water Magic Lantern Show\" features artist Marc Castelli from 5 p.m to 7 p.m for free CBMM members. \nA \"Waterman's Story Swap\" event will take place on January 11 with local author Brent Lewis and a panel of local watermen starting at 5:30 p.m. Sponsored by the Upper Shore Regional Folklife Center, admission costs $8 per person."},{"title":"Music as medicine: holiday concert provides cheer to residents living with memory loss","content":"Here is a summary of the article in 2-5 sentences:\n\nTiShawna Jordan led a holiday concert at HeartFields Assisted Living in Easton, Maryland, to provide cheer and intervention for residents with memory loss. The event was part of a partnership between HeartFields and Chesapeake Center, which aims to support elderly individuals through volunteer-led events. According to Erin Lewis, director of career services at Chesapeake Center, TiShawna Jordan's concerts have provided holiday cheer and positive memory recollection to those in the Bridge to Rediscovery program. The first holiday concert was a success, with TiShawna being presented with roses by HeartFields Resident Ambassador."},{"title":"All The Leaves Are Red, Yellow, and Orange - Top U.S. Destinations For Leaf Peeping And Other Fall Adventure","content":"Here is a summary of the article in 4 sentences:\n\nCalifornia ranked top for fall foliage, with numerous national parks and scenic drives. New York topped the list for peak days of ideal leaf peeping, with over 31 days available. Washington State offered 12 weeks of peak viewing time due to its mountainous terrain, while Michigan had an extended season due to its inland location. Other popular destinations included Pennsylvania's Pocono Mountains, Vermont's sugarhouses and maple syrup tours, and Illinois' Morton Pumpkin Festival and corn mazes."},{"title":"A 'smart buoy' is coming to St. Michaels harbor","content":"The St. Michaels Climate Change/Sea Level Rise Commission will deploy a \"smart buoy\" in the harbor to monitor water levels and flooding, starting with permission from the commissioners. The buoy measures sea state, temperature, and wave action, as well as tidal head and pressure at its bottom. Andrew David Thaler presented the device, which is solar-powered and real-time data gathering, with one long-term goal being to establish a town-owned tide gauge in St. Michaels. The commission had previously applied for an equipment grant from So Far Ocean last year."},{"title":"Women to Watch event recognizes 212 leaders","content":"Shawna Payne was one of 14 women featured in this year's Women to Watch magazine, an annual publication by APG Chesapeake recognizing contributions of women to Mid-Shore workplaces and communities. The event, held April 9 at the Avalon Theatre, celebrated their accomplishments and honored potential for positive change. Orestes Baez, regional president of APG Chesapeake, attended with wife Betsy Griffin, general manager for sales and marketing. Yixin Qiu, co-founder of Apollo's Dream Foundation, and Jackie Wilson, senior vice president at Burke and Herbert Bank, were among three speakers who offered advice to the gathering. The fifth Women to Watch magazine was launched on April 9, with a preliminary printed version unveiled that evening."},{"title":"TV LISTINGS 10-10-24","content":"Here is a summary of the article in 2-5 concise sentences:\n\nOctober 9, 2024 listings include:\n- Coastal Carolina at James Madison on ESPN2\n- MTSU at Louisiana Tech on CBSSN\n- UTEP at W. Kentucky on ESPNU\n- N.C. State vs. Virginia on ACC\n- Alabama vs. Auburn on SEC\n- Nebraska at Rutgers on BTN\n- Oklahoma at Texas on SEC\n- Baylor at BYU on FS1\n- Cleveland at Detroit in Game 4 of the A.L. Division Series on TNT\n- L.A. Lakers at Milwaukee on NBA"},{"title":"Tony Shalhoub returns as \"Monk\" in new Peacock movie","content":"Tony Shalhoub reprises his role as Adrian Monk in the Peacock movie \"Mr. Monk's Last Case: A Monk Movie,\" premiering December 8. The film follows Monk on a personal mission to help his step-daughter Molly after tragedy strikes her wedding. Fellow \"Monk\" veterans, including creators Andy Breckman and writers Traylor Howard and Jason Gray-Stanford, return for the movie."},{"title":"celebrityupdate","content":"Morgan Kohan, a British Columbia native, began studying dance before focusing on acting at Toronto's Randolph Academy. She gained experience with guest roles in shows like \"Murdoch Mysteries\" and \"Star Trek: Discovery.\" Kohan appeared in cable movies such as \"The Black Widow Killer,\" \"Love on Harbor Island,\" and \"A Romance Wedding,\" which led to her lead role in the CTV series \"Sullivan's Crossing.\" The show, based on novels by Robyn Carr, has been renewed for a second season."},{"title":"Constitution Day includes Douglass reenactment","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe Mid-Shore Constitution Alliance will host its second annual Constitution Day celebration on September 16, featuring a reenactment of Frederick Douglass by renowned actor Darius Wallace. The event will be held from noon-2 p.m. on the Talbot County Courthouse lawn, with additional activities including speakers, music, and an honor guard ceremony. This is part of a larger effort to promote civic engagement through education and constitutional values, led by the Mid-Shore Constitution Alliance in partnership with other organizations. The event is free and open to the public."},{"title":"Colonel tops Easton, evens slate","content":"Colonel Richardson defeated Easton High 58-24 on December 18, 2024. Colonels coach Bryan Hall attributed the win to \"filling in\" for lost starters. Elisee Pierre-Louis scored a takedown via injury default. The match saw Colonel's Ethan Thomas win by pinfall at 165 pounds, with Anthony Alexander and others contributing to the victory."},{"title":"Wild and woolly auction enterers","content":"The article discusses a tournament bridge game where North led the diamond ace and West followed with three rounds of hearts to stop a diamond ruff in the dummy. South made the contract by establishing a spade for a diamond discard and finding the club queen, with East having the club queen. The declarer won the hand with careful play, noting that if East had covered the club jack, declarer would have won."},{"title":"Dubois readies for another fresh start","content":"Pierre-Luc Dubois, chosen third in the 2016 draft, has been traded three times since 2021 to Winnipeg for Patrik Laine and Jack Roslovic, then to Los Angeles, and finally to the Washington Capitals. The trade was made by GM Rob Blake of the Kings, who acknowledged not putting Dubois in the right roles. Dubois turned 26 on Monday and aims to get back on track after a disappointing season with the Kings."},{"title":"County offers training to prepare for disasters","content":"Here is a summary of the article in 4 concise sentences:\n\nTalbot County Emergency Services offers free Community Emergency Response Training, held at the Talbot County Operations Center in Easton, starting September 18. The seven-session course includes emergency preparedness, fire safety, and hands-on activities taught by local first responders. Sessions run from 6 p.m. to 8:30 p.m., with participants required to attend all sessions; minors under 18 must be accompanied by an adult. To register, contact Geneva Schaffle at gschaffle@talbotcountymd.gov or call 410-770-8166."},{"title":"Parades and Santa highlight Christmas in St. Michaels","content":"Christmas events will be held in St. Michaels from Friday, Dec. 8 to Sunday, Dec. 10. Events include a Breakfast with Santa for kids ages 4-9, a Christmas parade featuring Santa on Talbot Street, and a lighted boat parade. The Union United Methodist Church will host a Christmas music concert on Sunday, Dec. 10 at 5 p.m."},{"title":"Preserve, protect and defend","content":"Donald Trump promised to \"preserve, protect and defend the Constitution\" on January 20, 2025."},{"title":"Final Four beckons Bueckers and Clark","content":"Caitlin Clark and Paige Bueckers will face off in the Final Four on Friday night as top-seeded Iowa and third-seeded UConn take center stage. The two players have helped propel interest in women's basketball to an all-time high. Their careers were marked by injuries, but they've both returned healthy and dominant. Clark views herself and Bueckers as part of a chain of growing young talent in the sport, not just individual stars."},{"title":"Talbot Board of Ed voices mixed opinions over 2025-26 calendar draft","content":"Talbot County Board of Education members expressed mixed opinions over a draft calendar for the 2025-26 school year, which includes two days off in March and a five-day spring break from April 2 to April 6, 2026.\nHelga Einhorn presented the draft calendar, but Board President Emily Jackson expressed confusion and concern about the lack of multiple drafts, stating she was expecting more diverse ideas. \nBoard Members Deborah Bridges liked the March break, while Dyshekia Strawberry raised concerns about a shorter spring break potentially increasing chronic absenteeism in April.\nAmy Dodson suggested moving an off day in March to extend spring break if needed, while Superintendent Sharon Pepukayi emphasized finding a balance between student needs and staff requirements."},{"title":"AL LEADERS 5-3-24","content":"American League leaders as of May 2, 2024:\n\nBATTING: Kwan (.360) leads; Perez (.355), Altuve (.341), Soto (.331), Peña (.325)\nRUNS: Kwan (27) and Witt (27); Henderson (25), Greene (24), Altuve (22), Soto (22)\nRBIS: Perez (27), A.García (25), Soto (25), J.Naylor (24), J.Ramírez (24)\nHITS: Kwan (45), Altuve (42), Soto (41), Witt (41), Perez (39)\nDOUBLES: J.Smith (10), Altuve (9), Santander (9) and others\nTRIPLES: Ja.Duran (4), Witt (4), Henderson (3) and others\nHOME RUNS: Trout (10); Henderson (10), O'Neill (9)\nSTOLEN BASES: Caballero (9), Ja.Duran (9), Rengifo (9), Witt (9)\nPITCHING: Lugo (5-1), Skubal (4-0), Rodriguez (4-1) and others\nERA: Berríos (1.44); K.Crawford (1.56); Houck (1.60); Lugo (1.60) and others\nSTRIKEOUTS: Flaherty (50); Castillo (49); Crochet (47); Ragans (46)"},{"title":"Talbot Board of Ed OKs contracts for EHS auditorium, Chapel Elementary windows","content":"Here is a summary of the article in 2-5 concise sentences:\n\nThe Talbot Board of Education approved contracts for two projects: $1.1 million for auditorium lights at Easton High School (summer 2026) and $132,000 for window glazing (security film) at Chapel District Elementary School (potentially summer 2026). The school is currently under renovation with a multimillion-dollar budget expected in 2026. The contract for window glazing was secured through a Maryland Center for School Safety grant."},{"title":"Mid-Shore early voting centers","content":"Here is a summary of the article in 3 sentences:\n\nEarly voting in Maryland runs from October 24 to October 31, with voting centers open from 7 a.m. to 8 p.m. Each county has at least one early voting center; Caroline, Dorchester, and Talbot counties have specific locations for their centers: \n- Caroline County: Health and Public Services Building, 403 S. Seventh Street, Room 112, Denton, MD 21629\n- Dorchester County: Dorchester Election Office, 1000 Goodwill Avenue, Cambridge, MD 21613\n- Talbot County: Easton Fire Hall, 315 Aurora Park Drive, Easton, MD 21601"},{"title":"Demir's hat trick paces Colonels","content":"Morgan Demir scored a hat trick as Colonel Richardson High's boys soccer team beat Washington with a 5-0 shutout on September 19, 2024. Caleb Rouser and Jack Walls scored one goal each for the Colonels (4-0). Preston Rickwood and Aydan Downie had assists."},{"title":"Former 1st-rounders Toney, Farley cut","content":"Kansas City receiver Kadarius Toney and Tennessee cornerback Caleb Farley, both first-round picks in the 2021 NFL draft, were cut from their teams as part of roster trimming before the regular season.\n\nToney was on his second team since being drafted by the New York Giants in 2021, while Farley started just twice due to injuries over his first two seasons with the Titans.\n\nTeams had to cut their rosters to 53 players, and Toney, Farley, among hundreds of others, will be eligible for practice squads."},{"title":"Talbot County farmers markets ready for spring season","content":"Talbot County farmers markets will open in Easton on April 20 and St. Michaels on April 13. The Easton market will run on Saturdays from April to December, with vendors including Triangle Acres, Cottingham Farm, and Honeybee Flower Farm. The St. Michaels market will also run through November 23."},{"title":"Snow fall brings snow day on the Eastern Shore","content":"Residents of Easton woke up to two inches of snow on January 17, 2024, prompting a snow day for Talbot County Public Schools and closures for Dorchester County Public Schools due to icy road conditions. Easton's Superintendent of Public Works Mike Dickerson reported using 46.92 tons of salt on main roads. A winter weather advisory was issued for Queen Anne's, Talbot, and Caroline counties from early Tuesday morning until 1 p.m., with a chance of snow and freezing rain in the afternoon."},{"title":"Body-worn camera footage from fatal officer-involved car crash released","content":"Body-worn camera footage from a fatal officer-involved car crash on July 22 in Easton, Maryland was released by the Independent Investigations Division of the Maryland Office of the Attorney General. Deputies from Talbot County Sheriff's Office and Easton Police Department pursued a stolen vehicle driven by 18-year-old Yemaya Wilson at speeds over 100 MPH. The pursuit ended with the vehicle crashing on Route 50, resulting in fatal injuries to Wilson."},{"title":"Pelosi, Biden: A fractured political friendship","content":"Here is a summary of the article in 2-5 concise sentences:\n\nNancy Pelosi was accused of playing a key role in convincing President Biden to withdraw from seeking re-election in late July. Pelosi made calls to Biden, expressing concerns about his re-election prospects, and also spoke with other Democratic Party power brokers. The outcome has energized the Democratic Party, increasing their chances of controlling Congress. However, Biden is reportedly angry with Pelosi, viewing her as \"ruthless\" and willing to prioritize party power over long-term relationships."},{"title":"Jury finds Tilghman man guilty of child sexual abuse","content":"A Talbot County jury found Eric L. Werner, 61, guilty of 16 counts related to the sexual abuse of a child, including sexual abuse of a minor, third-and fourth-degree sex offenses, and second-degree assault, in November 2023. Werner was acquitted on one count. The case began with an investigation by detectives from the Talbot County Sheriff's Office in February after learning of multiple child sexual abuse incidents at a home in Tilghman. Werner showed the child pornographic videos and engaged in inappropriate conversations before being arrested."},{"title":"Talbot County passes 1-cent resolution for 2024 ballot","content":"Talbot County Council passed a resolution on June 26, 2024, to place a question on the 2024 ballot to amend the county's charter to raise residents' taxes for public safety by up to 1 cent per $100 of assessed value above the revenue cap for seven years beginning July 1, 2026. The previous 1-cent resolution in 2020 was approved by voters and allowed for the addition of 26 public safety positions. The new resolution extends the funding for an additional two years."},{"title":"Local author encourages 'choose love'","content":"Abraham Keys, a local author from Rock Hall, MD, is releasing his third book \"Kitty the Goat and the Puppy\" with themes of love and acceptance, in what will be a five-part series about farm animals teaching lessons to children. The series was inspired by Keys' real-life farming experiences growing up in South America and Canada. His books have sold 3-4,000 copies since his first publication in December 2023, and he has been featured in four newspapers, including ones from Montana, Canada, and Maryland."},{"title":"Was Biden's health cover-up worse than Watergate?","content":"The book \"Original Sin: President Biden's Decline, Its Cover-Up, and His Disastrous Choice to Run Again\" coauthored by Jake Tapper and Alex Thompson has sparked a mixed reaction in the public regarding Biden's health cover-up and its comparison to Watergate. Congressional investigations are underway on Biden's mental decline during his presidency. The book suggests that Biden's cover-up may be worse than Watergate, with some media outlets criticized for not following up on similar scandals involving Democratic presidents like Bill Clinton."},{"title":"Talbot County diversity training, statement stir dialogue","content":"Talbot County Council Member Dave Stepp requests to repeal a diversity statement resolution passed in 2020. The statement defines diversity, equity and inclusion and outlines how employees can report discrimination. The proposed repeal was met with strong reactions from residents and organizations, including the Demarva Pride Center, which opposes the repeal. Former Talbot County President Corey Pack implemented the original resolutions and expressed disappointment that the council may be looking to remove the statement."}]